      ************************************
      *SATRIB work field definitions
      ************************************
     D I1              S              3  0
     D I2              S              3  0
