     A********************************************************************
     A* Copyright 2012    ** KDP Software Ltd **      All Rights Reserved
     A********************************************************************
     A*
     A*  DISPLAY FILE ID     -    MPORENT
     A*  DISPLAY FILE NAME   -        Purchase Order Entry
     A*  DATE CREATED        -    Jan 12, 2012
     A*
     A******************************************************************
     A                                      PRINT
     A                                      ALTHELP(CA01)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      HLPTITLE(' ')
     A                                      HELP
     A          R SCR001
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Purchase Order Entry      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SC0001    '
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  4  2'Type one or more action codes. The-
     A                                      n Enter.'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  5  4'2=Edit'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  5 12'4=Delete'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  5 22'5=Display'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  5 33'6=Text'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  5 41'7=Detail Lines'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  7  2'Act'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  7  7'P.O.Number'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  7 19'Whs'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  7 24'Supplier'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  7 36'Supplier name'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A          R SCR001S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0001         1  0B  8  3
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XHPORD    R     A  O  8  7REFFLD(PHPORD PORDH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  8 19REFFLD(PHWHSE PORDH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0052    R     A  O  8 24REFFLD(PHSUPPN PORDH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0035    R     A  O  8 31REFFLD(PHBRNBR PORDH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0050    R     A  O  8 36REFFLD(PHSNAME PORDH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC02          9  0H
     A            HD0015    R        H      REFFLD(PHCOYNO PORDH)
     A                                      ALIAS(ALIAS00001)
     A            HD0016    R        H      REFFLD(PHPORD PORDH)
     A                                      ALIAS(ALIAS00002)
     A            INSAV1        99   H
     A          R SCR001C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR001S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR001S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Previous')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(8 3 19 3)
     A                                      HLPPNLGRP(SC0001FL0001 -
     A                                      MPORENTH)
     A          H                           HLPARA(8 7 19 16)
     A                                      HLPPNLGRP(PHPORD -
     A                                      PORDHH)
     A          H                           HLPARA(8 19 19 21)
     A                                      HLPPNLGRP(PHWHSE -
     A                                      PORDHH)
     A          H                           HLPARA(8 24 19 29)
     A                                      HLPPNLGRP(PHSUPPN -
     A                                      PORDHH)
     A          H                           HLPARA(8 31 19 33)
     A                                      HLPPNLGRP(PHBRNBR -
     A                                      PORDHH)
     A          H                           HLPARA(8 36 19 75)
     A                                      HLPPNLGRP(PHSNAME -
     A                                      PORDHH)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(SC0001PS0102 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MPORENTH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0102        10   B 21 18
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=P-
     A                                      revious'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A            RRN01          4S 0H      SFLRCDNBR
     A            XRN01          4S 0H
     A          R SCR002
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF10 INDTXT(10 'Text')
     A                                      CF12 INDTXT(12 'Previous')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(6 19 6 28)
     A                                      HLPPNLGRP(PHPORD -
     A                                      PORDHH)
     A          H                           HLPARA(7 19 7 21)
     A                                      HLPPNLGRP(PHWHSE -
     A                                      PORDHH)
     A          H                           HLPARA(7 40 7 79)
     A                                      HLPPNLGRP(PHWNAME -
     A                                      PORDHH)
     A          H                           HLPARA(8 19 8 28)
     A                                      HLPPNLGRP(SC0002WSDLVDT -
     A                                      MPORENTH)
     A          H                           HLPARA(8 40 8 79)
     A                                      HLPPNLGRP(PHWLIN1 -
     A                                      PORDHH)
     A          H                           HLPARA(9 19 9 23)
     A                                      HLPPNLGRP(PHBUYER -
     A                                      PORDHH)
     A          H                           HLPARA(9 40 9 79)
     A                                      HLPPNLGRP(PHWLIN2 -
     A                                      PORDHH)
     A          H                           HLPARA(10 19 10 33)
     A                                      HLPPNLGRP(PHCUSORD -
     A                                      PORDHH)
     A          H                           HLPARA(10 40 10 79)
     A                                      HLPPNLGRP(PHWLIN3 -
     A                                      PORDHH)
     A          H                           HLPARA(11 19 11 33)
     A                                      HLPPNLGRP(PHNLALL -
     A                                      PORDHH)
     A          H                           HLPARA(11 40 11 79)
     A                                      HLPPNLGRP(PHWLIN4 -
     A                                      PORDHH)
     A          H                           HLPARA(12 40 12 79)
     A                                      HLPPNLGRP(PHWLIN5 -
     A                                      PORDHH)
     A          H                           HLPARA(13 40 13 48)
     A                                      HLPPNLGRP(PHWPSTCD -
     A                                      PORDHH)
     A          H                           HLPARA(15 19 15 24)
     A                                      HLPPNLGRP(PHSUPPN -
     A                                      PORDHH)
     A          H                           HLPARA(15 26 15 28)
     A                                      HLPPNLGRP(PHBRNBR -
     A                                      PORDHH)
     A          H                           HLPARA(15 40 15 79)
     A                                      HLPPNLGRP(PHSNAME -
     A                                      PORDHH)
     A          H                           HLPARA(16 19 16 38)
     A                                      HLPPNLGRP(PHCONNAM -
     A                                      PORDHH)
     A          H                           HLPARA(16 40 16 79)
     A                                      HLPPNLGRP(PHSLIN1 -
     A                                      PORDHH)
     A          H                           HLPARA(17 40 17 79)
     A                                      HLPPNLGRP(PHSLIN2 -
     A                                      PORDHH)
     A          H                           HLPARA(18 19 18 38)
     A                                      HLPPNLGRP(SC0002WKSVIA1 -
     A                                      MPORENTH)
     A          H                           HLPARA(18 40 18 79)
     A                                      HLPPNLGRP(PHSLIN3 -
     A                                      PORDHH)
     A          H                           HLPARA(19 19 19 38)
     A                                      HLPPNLGRP(SC0002WKSVIA2 -
     A                                      MPORENTH)
     A          H                           HLPARA(19 40 19 79)
     A                                      HLPPNLGRP(PHSLIN4 -
     A                                      PORDHH)
     A          H                           HLPARA(20 40 20 79)
     A                                      HLPPNLGRP(PHSLIN5 -
     A                                      PORDHH)
     A          H                           HLPARA(21 40 21 79)
     A                                      HLPPNLGRP(PHSLIN6 -
     A                                      PORDHH)
     A          H                           HLPARA(22 40 22 48)
     A                                      HLPPNLGRP(PHSPSTCD -
     A                                      PORDHH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MPORENTH)
     A            USER          10   O  1  2
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                      OVRATR
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  1 73DATE EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                      OVRATR
     A            PGM           10   O  2  2
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  2 26'    Purchase Order Entry      '
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  3  2'SC0002    '
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  4  2'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  6  2'P.O.Number'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XHPORD    R     A  O  6 19REFFLD(PHPORD PORDH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  6 40'Ship To'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  7  2'Warehouse Code'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XHWHSE    R     A  O  7 19REFFLD(PHWHSE PORDH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A            WK0059    R     A  B  7 40REFFLD(PHWNAME PORDH)
     A                                      DLTEDT
     A  37                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A  36                                  DSPATR(PR)
     A                                  8  2'Delivery Date'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            RN0026        10   B  8 19
     A  05                                  DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  04                                  DSPATR(PR)
     A            WK0053    R     A  B  8 40REFFLD(PHWLIN1 PORDH)
     A                                      DLTEDT
     A  30                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(PC)
     A  28                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A                                  9  2'Buyers Code'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            WK0036    R     A  B  9 19REFFLD(PHBUYER PORDH)
     A                                      DLTEDT
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(PR)
     A            WK0054    R     A  B  9 40REFFLD(PHWLIN2 PORDH)
     A                                      DLTEDT
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(PR)
     A                                 10  2'Our customer ref'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            WK0039    R     A  B 10 19REFFLD(PHCUSORD PORDH)
     A                                      DLTEDT
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(PR)
     A            WK0055    R     A  B 10 40REFFLD(PHWLIN3 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  32                                  DSPATR(PR)
     A                                 11  2'Allocation acc'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0042    R     A  B 11 19REFFLD(PHNLALL PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A  10                                  DSPATR(PR)
     A            WK0056    R     A  B 11 40REFFLD(PHWLIN4 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  33                                  DSPATR(PR)
     A            WK0057    R     A  B 12 40REFFLD(PHWLIN5 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  34                                  DSPATR(PR)
     A            WK0060    R     A  B 13 40REFFLD(PHWPSTCD PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  38                                  DSPATR(PC)
     A  38                                  DSPATR(RI)
     A  39                                  DSPATR(PR)
     A                                 14 40'Order From'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 15  2'Supplier Account'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0052    R     A  B 15 19REFFLD(PHSUPPN PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  25                                  DSPATR(PC)
     A  25                                  DSPATR(RI)
     A  26                                  DSPATR(PR)
     A            WK0035    R     A  B 15 26REFFLD(PHBRNBR PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A  06                                  DSPATR(PR)
     A            WK0050    R     A  B 15 40REFFLD(PHSNAME PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  19                                  DSPATR(PC)
     A  19                                  DSPATR(RI)
     A  20                                  DSPATR(PR)
     A                                 16  2'Placed With'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0037    R     A  B 16 19REFFLD(PHCONNAM PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  08                                  DSPATR(PR)
     A            WK0044    R     A  B 16 40REFFLD(PHSLIN1 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A  12                                  DSPATR(PR)
     A            WK0045    R     A  B 17 40REFFLD(PHSLIN2 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  14                                  DSPATR(PR)
     A                                 18  2'Ship Via'
     A                                      OVRATR
     A            RN0024        20   B 18 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0046    R     A  B 18 40REFFLD(PHSLIN3 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  15                                  DSPATR(PR)
     A            RN0025        20   B 19 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A  02                                  DSPATR(PR)
     A            WK0047    R     A  B 19 40REFFLD(PHSLIN4 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  16                                  DSPATR(PR)
     A            WK0048    R     A  B 20 40REFFLD(PHSLIN5 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  17                                  DSPATR(PR)
     A            WK0049    R     A  B 21 40REFFLD(PHSLIN6 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  18                                  DSPATR(PR)
     A            WK0051    R     A  B 22 40REFFLD(PHSPSTCD PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  22                                  DSPATR(PC)
     A  22                                  DSPATR(RI)
     A  23                                  DSPATR(PR)
     A                                 23  2'F1=Help  F4=Prompt  F10=Text  F12=-
     A                                      Previous  F14=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR003
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Purchase Order Entry      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SC0003    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  4'1=Create'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 14'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 24'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 11'Seq'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 17'Print'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 24'Text'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR003S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0002         1  0B  8  4
     A  02                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A            XHSEQ     R        O  8 10REFFLD(THSEQ IPSTXTH)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A            XHTCDE    R     A  B  8 18REFFLD(THTCDE IPSTXTH)
     A                                      DLTEDT
     A  04                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A            XHTEXT    R     A  B  8 24REFFLD(THTEXT IPSTXTH)
     A                                      DLTEDT
     A  06                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            HRC11          9  0H
     A            HD0010    R        H      REFFLD(THCOYNO IPSTXTH)
     A                                      ALIAS(ALIAS00003)
     A            HHPORD    R        H      REFFLD(THPORD IPSTXTH)
     A                                      ALIAS(ALIAS00004)
     A            HHSEQ     R        H      REFFLD(THSEQ IPSTXTH)
     A                                      ALIAS(ALIAS00005)
     A            INSAV1        99   H
     A          R SCR003C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR003S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR003S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF12 INDTXT(12 'Previous')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(8 4 19 4)
     A                                      HLPPNLGRP(SC0003FL0002 -
     A                                      MPORENTH)
     A          H                           HLPARA(8 10 19 14)
     A                                      HLPPNLGRP(THSEQ -
     A                                      IPSTXTHH)
     A          H                           HLPARA(8 18 19 18)
     A                                      HLPPNLGRP(SC0003THTCDE -
     A                                      MPORENTH)
     A          H                           HLPARA(8 24 19 63)
     A                                      HLPPNLGRP(SC0003THTEXT -
     A                                      MPORENTH)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(PHPORD -
     A                                      PORDHH)
     A          H                           HLPARA(21 30 21 35)
     A                                      HLPPNLGRP(SC0003PS0301 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MPORENTH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XHPORD    R     A  O 21 18REFFLD(PHPORD PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0301         5  0B 21 30
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F12=Previous'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN02          4S 0H      SFLRCDNBR
     A            XRN02          4S 0H
     A          R SCR004
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Purchase Order Entry      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SC0005    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 35'6=Text'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 41'Quantity'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7  2'Act'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7  7'Seq'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 12'Whse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 18'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 41'Ordered'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR004S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0003         1  0B  8  3
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XOSEQ     R        O  8  6REFFLD(POSEQ PORDD)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A            XOWHSE    R     A  O  8 13REFFLD(POWHSE PORDD)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XOITEM    R     A  O  8 18REFFLD(POITEM PORDD)
     A                                      DLTEDT
     A            XOQORD    R        O  8 41REFFLD(POQORD PORDD)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  05                                  DSPATR(ND)
     A            WSMANF        20   O  9 18
     A                                      COLOR(GRN)
     A            ITEMDO        30   O  9 41
     A                                      COLOR(GRN)
     A            HRC03          9  0H
     A            HD0014    R        H      REFFLD(POCOYNO PORDD)
     A                                      ALIAS(ALIAS00006)
     A            HOPORD    R        H      REFFLD(POPORD PORDD)
     A                                      ALIAS(ALIAS00007)
     A            HOSEQ     R        H      REFFLD(POSEQ PORDD)
     A                                      ALIAS(ALIAS00008)
     A            INSAV1        99   H
     A          R SCR004C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR004S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR004S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(6)
     A                                      SFLSIZ(6)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Previous')
     A                                      CF24 INDTXT(24 'Header')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(8 3 13 3)
     A                                      HLPPNLGRP(SC0005FL0003 -
     A                                      MPORENTH)
     A          H                           HLPARA(8 6 13 10)
     A                                      HLPPNLGRP(POSEQ -
     A                                      PORDDH)
     A          H                           HLPARA(8 13 13 15)
     A                                      HLPPNLGRP(POWHSE -
     A                                      PORDDH)
     A          H                           HLPARA(8 18 13 37)
     A                                      HLPPNLGRP(POITEM -
     A                                      PORDDH)
     A          H                           HLPARA(8 41 13 49)
     A                                      HLPPNLGRP(POQORD -
     A                                      PORDDH)
     A          H                           HLPARA(9 18 14 37)
     A                                      HLPPNLGRP(SC0005WSMANF -
     A                                      MPORENTH)
     A          H                           HLPARA(9 41 14 70)
     A                                      HLPPNLGRP(SC0005ITEMDO -
     A                                      MPORENTH)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(PHPORD -
     A                                      PORDHH)
     A          H                           HLPARA(21 29 21 34)
     A                                      HLPPNLGRP(SC0005PS0501 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MPORENTH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHPORD    R     A  O 21 18REFFLD(PHPORD PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A            PS0501         5  0B 21 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=P-
     A                                      revious  F24=Header'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN03          4S 0H      SFLRCDNBR
     A            XRN03          4S 0H
     A          R SCR005
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF05 INDTXT(05 'Non Stock')
     A                                      CF12 INDTXT(12 'Previous')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(6 31 6 70)
     A                                      HLPPNLGRP(PHSNAME -
     A                                      PORDHH)
     A          H                           HLPARA(7 31 7 40)
     A                                      HLPPNLGRP(POPORD -
     A                                      PORDDH)
     A          H                           HLPARA(8 31 8 35)
     A                                      HLPPNLGRP(POSEQ -
     A                                      PORDDH)
     A          H                           HLPARA(10 31 10 50)
     A                                      HLPPNLGRP(POITEM -
     A                                      PORDDH)
     A          H                           HLPARA(11 31 11 70)
     A                                      HLPPNLGRP(POIDESC -
     A                                      PORDDH)
     A          H                           HLPARA(13 31 13 40)
     A                                      HLPPNLGRP(POQORD -
     A                                      PORDDH)
     A          H                           HLPARA(15 31 15 33)
     A                                      HLPPNLGRP(POWHSE -
     A                                      PORDDH)
     A          H                           HLPARA(16 31 16 45)
     A                                      HLPPNLGRP(PONLALL -
     A                                      PORDDH)
     A          H                           HLPARA(17 31 17 40)
     A                                      HLPPNLGRP(SC0006WSDLVDT -
     A                                      MPORENTH)
     A          H                           HLPARA(19 31 19 44)
     A                                      HLPPNLGRP(POPRICE -
     A                                      PORDDH)
     A          H                           HLPARA(19 53 19 53)
     A                                      HLPPNLGRP(SC0006WSFOC -
     A                                      MPORENTH)
     A          H                           HLPARA(20 31 20 35)
     A                                      HLPPNLGRP(POUOM -
     A                                      PORDDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MPORENTH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Purchase Order Entry      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SC0006    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'Supplier name . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0050    R     A  O  6 31REFFLD(PHSNAME PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Purchase Order Number . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOPORD    R     A  O  7 31REFFLD(POPORD PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  8  2'Sequence  . . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOSEQ     R        O  8 31REFFLD(POSEQ PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                 10  2'Item Number . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOITEM    R     A  B 10 31REFFLD(POITEM PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  14                                  DSPATR(PC)
     A  14                                  DSPATR(RI)
     A  15                                  DSPATR(PR)
     A                                 11  2'Item Description  . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0031    R     A  B 11 31REFFLD(POIDESC PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  05                                  DSPATR(PR)
     A                                 13  2'Quantity ordered  . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOQORD    R        B 13 31REFFLD(POQORD PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A  17                                  DSPATR(PC)
     A  17                                  DSPATR(RI)
     A  18                                  DSPATR(PR)
     A                                 15  2'Warehouse . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOWHSE    R     A  B 15 31REFFLD(POWHSE PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  23                                  DSPATR(PC)
     A  23                                  DSPATR(RI)
     A  24                                  DSPATR(PR)
     A                                 16  2'Allocated account . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0032    R     A  B 16 31REFFLD(PONLALL PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  08                                  DSPATR(PR)
     A                                 17  2'Delivery Date . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            RN0026        10   B 17 31
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  02                                  DSPATR(PR)
     A                                 19  2'Price . . . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0033    R        B 19 31REFFLD(POPRICE PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A  11                                  DSPATR(PR)
     A                                 19 46'F.O.C'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WSFOC          1   B 19 53
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A  13                                  DSPATR(PR)
     A                                 20  2'Unit of Measure . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOUOM     R     A  B 20 31REFFLD(POUOM PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  20                                  DSPATR(PC)
     A  20                                  DSPATR(RI)
     A  21                                  DSPATR(PR)
     A                                 23  2'F1=Help  F4=Prompt  F5=Non Stock  -
     A                                      F12=Previous  F14=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR006
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Purchase Order Entry      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SC0007    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  4'1=Create'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 14'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 24'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 11'Seq'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 17'Print'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 24'Text'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR006S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0005         1  0B  8  4
     A  02                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A            XDSEQ     R        O  8 10REFFLD(TDSEQ IPSTXTD)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A            XDTCDE    R     A  B  8 18REFFLD(TDTCDE IPSTXTD)
     A                                      DLTEDT
     A  04                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A            XDTEXT    R     A  B  8 24REFFLD(TDTEXT IPSTXTD)
     A                                      DLTEDT
     A  06                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            HRC17          9  0H
     A            HD0008    R        H      REFFLD(TDCOYNO IPSTXTD)
     A                                      ALIAS(ALIAS00009)
     A            HDPORD    R        H      REFFLD(TDPORD IPSTXTD)
     A                                      ALIAS(ALIAS00010)
     A            HD0009    R        H      REFFLD(TDPOSEQ IPSTXTD)
     A                                      ALIAS(ALIAS00011)
     A            HDSEQ     R        H      REFFLD(TDSEQ IPSTXTD)
     A                                      ALIAS(ALIAS00012)
     A            INSAV1        99   H
     A          R SCR006C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR006S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR006S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF12 INDTXT(12 'Previous')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(8 4 19 4)
     A                                      HLPPNLGRP(SC0007FL0005 -
     A                                      MPORENTH)
     A          H                           HLPARA(8 10 19 14)
     A                                      HLPPNLGRP(TDSEQ -
     A                                      IPSTXTDH)
     A          H                           HLPARA(8 18 19 18)
     A                                      HLPPNLGRP(SC0007TDTCDE -
     A                                      MPORENTH)
     A          H                           HLPARA(8 24 19 63)
     A                                      HLPPNLGRP(SC0007TDTEXT -
     A                                      MPORENTH)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(POPORD -
     A                                      PORDDH)
     A          H                           HLPARA(21 29 21 33)
     A                                      HLPPNLGRP(POSEQ -
     A                                      PORDDH)
     A          H                           HLPARA(21 36 21 41)
     A                                      HLPPNLGRP(SC0007PS0701 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MPORENTH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOPORD    R     A  O 21 18REFFLD(POPORD PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XOSEQ     R        O 21 29REFFLD(POSEQ PORDD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A            PS0701         5  0B 21 36
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F12=Previous'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN04          4S 0H      SFLRCDNBR
     A            XRN04          4S 0H
     A          R SCR007
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 19 10 58)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 19 11 58)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 19 12 58)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 19 13 58)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 19 14 58)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 62)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MPORENTH)
     A                                  3  3'                                  -
     A                                                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'             '
     A                                  4 19'Valid Warehouse Numbers       '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 50'           '
     A                                  4 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                            '
     A                                  5 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                            '
     A                                  6 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                '
     A                                  7 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                            '
     A                                  8 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Whs'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 19'Address Line 1'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 34'                           '
     A                                  9 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T01001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T02001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03001        40   O 10 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 60' '
     A                                 10 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T01002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T02002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03002        40   O 11 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 60' '
     A                                 11 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T01003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T02003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03003        40   O 12 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 60' '
     A                                 12 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T01004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T02004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03004        40   O 13 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 60' '
     A                                 13 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T01005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T02005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03005        40   O 14 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 60' '
     A                                 14 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                            '
     A                                 15 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                '
     A                                 16 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR008
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 7 10 7)
     A                                      HLPPNLGRP(SC0009T04 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 10 10 29)
     A                                      HLPPNLGRP(SC0009T05 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 31 10 70)
     A                                      HLPPNLGRP(SC0009T06 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 7 11 7)
     A                                      HLPPNLGRP(SC0009T04 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 10 11 29)
     A                                      HLPPNLGRP(SC0009T05 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 31 11 70)
     A                                      HLPPNLGRP(SC0009T06 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 7 12 7)
     A                                      HLPPNLGRP(SC0009T04 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 10 12 29)
     A                                      HLPPNLGRP(SC0009T05 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 31 12 70)
     A                                      HLPPNLGRP(SC0009T06 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 7 13 7)
     A                                      HLPPNLGRP(SC0009T04 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 10 13 29)
     A                                      HLPPNLGRP(SC0009T05 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 31 13 70)
     A                                      HLPPNLGRP(SC0009T06 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 7 14 7)
     A                                      HLPPNLGRP(SC0009T04 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 10 14 29)
     A                                      HLPPNLGRP(SC0009T05 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 31 14 70)
     A                                      HLPPNLGRP(SC0009T06 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 74)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MPORENTH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                    '
     A                                  4 26'Valid Item Numbers            '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 57'                '
     A                                  4 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                        '
     A                                  5 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                            '
     A                                  6 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                            '
     A                                  7 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                        '
     A                                  8 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Act'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 10'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 22'        '
     A                                  9 31'Item Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 48'                         '
     A                                  9 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5' '
     A            T04001         1  0B 10  7
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A            T05001        20   O 10 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06001        40   O 10 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 72' '
     A                                 10 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5' '
     A            T04002         1  0B 11  7
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A            T05002        20   O 11 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06002        40   O 11 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 72' '
     A                                 11 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5' '
     A            T04003         1  0B 12  7
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A            T05003        20   O 12 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06003        40   O 12 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 72' '
     A                                 12 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5' '
     A            T04004         1  0B 13  7
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A            T05004        20   O 13 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06004        40   O 13 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 72' '
     A                                 13 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5' '
     A            T04005         1  0B 14  7
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A            T05005        20   O 14 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06005        40   O 14 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 72' '
     A                                 14 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                        '
     A                                 15 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                            '
     A                                 16 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR009
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 15 10 19)
     A                                      HLPPNLGRP(SC0010T08 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 15 11 19)
     A                                      HLPPNLGRP(SC0010T08 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 15 12 19)
     A                                      HLPPNLGRP(SC0010T08 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 15 13 19)
     A                                      HLPPNLGRP(SC0010T08 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 15 14 19)
     A                                      HLPPNLGRP(SC0010T08 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 41)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MPORENTH)
     A                                  3  3'                                  -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5' '
     A                                  4  7'Valid Units of Measure        '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 38'  '
     A                                  4 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                       '
     A                                  5 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'       '
     A                                  6 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                       '
     A                                  7 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                       '
     A                                  8 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Unit Of Measure'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 30'          '
     A                                  9 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T07001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'    '
     A            T08001         5   O 10 15
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 21'                   '
     A                                 10 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T07002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'    '
     A            T08002         5   O 11 15
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 21'                   '
     A                                 11 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T07003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'    '
     A            T08003         5   O 12 15
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 21'                   '
     A                                 12 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T07004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'    '
     A            T08004         5   O 13 15
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 21'                   '
     A                                 13 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T07005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'    '
     A            T08005         5   O 14 15
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 21'                   '
     A                                 14 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                       '
     A                                 15 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                       '
     A                                 16 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR010                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Previous')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCRADD -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(6 33 6 42)
     A                                      HLPPNLGRP(PHPORD -
     A                                      PORDHH)
     A          H                           HLPARA(7 33 7 35)
     A                                      HLPPNLGRP(PHWHSE -
     A                                      PORDHH)
     A          H                           HLPARA(8 33 8 38)
     A                                      HLPPNLGRP(PHSUPPN -
     A                                      PORDHH)
     A          H                           HLPARA(8 40 8 42)
     A                                      HLPPNLGRP(PHBRNBR -
     A                                      PORDHH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SCRADD -
     A                                      MPORENTH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Purchase Order Entry      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SCRADD    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'Purchase Order Number  . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHPORD    R     A  B  6 33REFFLD(PHPORD PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                  7  2'Delivery Warehouse . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  B  7 33REFFLD(PHWHSE PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                  8  2'Supplier Account . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0052    R     A  B  8 33REFFLD(PHSUPPN PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A            WK0035    R     A  B  8 40REFFLD(PHBRNBR PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F4=Prompt  F12=Previous'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR011
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0012 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0012T12 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 14 10 19)
     A                                      HLPPNLGRP(SC0012T13 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 22 10 24)
     A                                      HLPPNLGRP(SC0012T14 -
     A                                      MPORENTH)
     A          H                           HLPARA(10 27 10 66)
     A                                      HLPPNLGRP(SC0012T15 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0012T12 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 14 11 19)
     A                                      HLPPNLGRP(SC0012T13 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 22 11 24)
     A                                      HLPPNLGRP(SC0012T14 -
     A                                      MPORENTH)
     A          H                           HLPARA(11 27 11 66)
     A                                      HLPPNLGRP(SC0012T15 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0012T12 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 14 12 19)
     A                                      HLPPNLGRP(SC0012T13 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 22 12 24)
     A                                      HLPPNLGRP(SC0012T14 -
     A                                      MPORENTH)
     A          H                           HLPARA(12 27 12 66)
     A                                      HLPPNLGRP(SC0012T15 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0012T12 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 14 13 19)
     A                                      HLPPNLGRP(SC0012T13 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 22 13 24)
     A                                      HLPPNLGRP(SC0012T14 -
     A                                      MPORENTH)
     A          H                           HLPARA(13 27 13 66)
     A                                      HLPPNLGRP(SC0012T15 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0012T12 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 14 14 19)
     A                                      HLPPNLGRP(SC0012T13 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 22 14 24)
     A                                      HLPPNLGRP(SC0012T14 -
     A                                      MPORENTH)
     A          H                           HLPARA(14 27 14 66)
     A                                      HLPPNLGRP(SC0012T15 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 70)
     A                                      HLPPNLGRP(SC0012 -
     A                                      MPORENTH)
     A                                  3  3'                                  -
     A                                                                        '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                '
     A                                  4 22'Valid Suppliers               '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 53'                '
     A                                  4 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                    '
     A                                  5 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                        '
     A                                  6 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                        '
     A                                  7 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                    '
     A                                  8 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Supp'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 19'  '
     A                                  9 22'Br'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 25' '
     A                                  9 27'Supplier name'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 41'                            '
     A                                  9 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T12001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T13001         6   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T14001         3   O 10 22
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15001        40   O 10 27
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 68' '
     A                                 10 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T12002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T13002         6   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T14002         3   O 11 22
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15002        40   O 11 27
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 68' '
     A                                 11 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T12003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T13003         6   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T14003         3   O 12 22
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15003        40   O 12 27
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 68' '
     A                                 12 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T12004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T13004         6   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T14004         3   O 13 22
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15004        40   O 13 27
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 68' '
     A                                 13 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T12005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T13005         6   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T14005         3   O 14 22
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15005        40   O 14 27
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 68' '
     A                                 14 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                    '
     A                                 15 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                        '
     A                                 16 70' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                        '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR012
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CF12 INDTXT(12 'Ignore')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SETSPEC -
     A                                      MPORENTH)
     A          H                           HLPARA(5 35 5 35)
     A                                      HLPPNLGRP(PHOS06 -
     A                                      PORDHH)
     A          H                           HLPARA(6 35 6 35)
     A                                      HLPPNLGRP(PHOS07 -
     A                                      PORDHH)
     A          H                           HLPARA(7 35 7 35)
     A                                      HLPPNLGRP(PHOS04 -
     A                                      PORDHH)
     A          H                           HLPARA(8 35 8 35)
     A                                      HLPPNLGRP(PHOS09 -
     A                                      PORDHH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SETSPEC -
     A                                      MPORENTH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 31'Set Special Conditions'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SETSPEC   '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  2'Print Purchase Order . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHOS06    R     A  B  5 35REFFLD(PHOS06 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                  6  2'Print Receiving List . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHOS07    R     A  B  6 35REFFLD(PHOS07 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                  7  2'Leave P.O. Pending . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHOS04    R     A  B  7 35REFFLD(PHOS04 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  8  2'Special Order  . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHOS09    R     A  B  8 35REFFLD(PHOS09 PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F12=Ignore'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR013
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Previous')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SUPP -
     A                                      MPORENTH)
     A                                 16 40'                                  -
     A                                            '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 42'                                  -
     A                                        '
     A                                 17 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 42'  '
     A                                 18 45'Supplier Number Changed, address'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 18 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 42'  '
     A                                 19 45'and all prices will be adjusted'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 19 77' '
     A                                 19 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 42'                                  -
     A                                        '
     A                                 20 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 21 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 21 42'Enter=Accept  F12=Ignore'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 21 67'           '
     A                                 21 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 22 40'                                  -
     A                                            '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR014
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Purchase Order Entry      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SCDELD    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Press Enter to confirm delete.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  4'Seq'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  6  9'Whse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  6 15'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  6 37'Item Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  6 70'Quantity'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR014S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            XOSEQ     R        O  7  2REFFLD(POSEQ PORDD)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A            XOWHSE    R     A  O  7  9REFFLD(POWHSE PORDD)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XOITEM    R     A  O  7 15REFFLD(POITEM PORDD)
     A                                      DLTEDT
     A                                      DSPATR(BL)
     A                                      COLOR(GRN)
     A            ITEMDO        30   O  7 37
     A            XOQORD    R        O  7 69REFFLD(POQORD PORDD)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  01                                  DSPATR(ND)
     A            HRC03          9  0H
     A            HD0014    R        H      REFFLD(POCOYNO PORDD)
     A                                      ALIAS(ALIAS00013)
     A            HOPORD    R        H      REFFLD(POPORD PORDD)
     A                                      ALIAS(ALIAS00014)
     A            HOSEQ     R        H      REFFLD(POSEQ PORDD)
     A                                      ALIAS(ALIAS00015)
     A            INSAV1        99   H
     A          R SCR014C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR014S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR014S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(13)
     A                                      SFLSIZ(13)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCDELD -
     A                                      MPORENTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(7 2 19 6)
     A                                      HLPPNLGRP(POSEQ -
     A                                      PORDDH)
     A          H                           HLPARA(7 9 19 11)
     A                                      HLPPNLGRP(POWHSE -
     A                                      PORDDH)
     A          H                           HLPARA(7 15 19 34)
     A                                      HLPPNLGRP(POITEM -
     A                                      PORDDH)
     A          H                           HLPARA(7 37 19 66)
     A                                      HLPPNLGRP(SCDELDITEMDO -
     A                                      MPORENTH)
     A          H                           HLPARA(7 69 19 77)
     A                                      HLPPNLGRP(POQORD -
     A                                      PORDDH)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(PHPORD -
     A                                      PORDHH)
     A          H                           HLPARA(21 29 21 34)
     A                                      HLPPNLGRP(SCDELDPS7501 -
     A                                      MPORENTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SCDELD -
     A                                      MPORENTH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XHPORD    R     A  O 21 18REFFLD(PHPORD PORDH)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A            PS7501         5  0B 21 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F12=Cancel  Press Enter To Confirm-
     A                                       Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN05          4S 0H      SFLRCDNBR
     A            XRN05          4S 0H
     A          R SCR015
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Previous')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SUPP -
     A                                      MPORENTH)
     A                                 16 40'                                  -
     A                                            '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 42'                                  -
     A                                        '
     A                                 17 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 42'  '
     A                                 18 45'Warning: Supplier address or    '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 18 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 42'  '
     A                                 19 45'postcde details have changed.  '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 19 77' '
     A                                 19 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 42'                                  -
     A                                        '
     A                                 20 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 21 40' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 21 42'Enter=Accept  F12=Revert'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 21 67'           '
     A                                 21 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 22 40'                                  -
     A                                            '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A*********************************************************************
     A          R PSSR0001                  CLRL(*NO) OVERLAY
     A                                  1 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  2 15'PSSR0001'
     A                                  2 24'       Execution Error Handler    -
     A                                                ' DSPATR(HI)
     A                                  2 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 15'                                  -
     A                                                         '
     A                                  3 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 15'Job . . . . :'
     A            WSID          10A  O  4 29COLOR(WHT)
     A                                  4 40'  Program  . . :'
     A            PGM           10A  O  4 57COLOR(WHT)
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 15'User  . . . :'
     A            USER          10A  O  5 29COLOR(WHT)
     A                                  5 40'  Library  . . :'
     A            ULIB          10A  O  5 57COLOR(WHT)
     A                                  5 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 15'Number  . . :'
     A            UJOBN          6S 0O  6 29COLOR(WHT)
     A                                  6 36'      Compiled . . :'
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)  COLOR(WHT)
     A                                  6 66'  '
     A                                  6 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 15'Routine . . :'
     A            UROUTN         8A  O  7 29COLOR(WHT)
     A                                  7 38'                  '
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')  COLOR(WHT)
     A                                  7 66'  '
     A                                  7 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 15'Status Code :'
     A            USTAT4         4A  O  8 29COLOR(WHT)
     A                                  8 34'        Source Line. :'
     A            USRCLN         8A  O  8 57COLOR(WHT)
     A                                  8 66'  '
     A                                  8 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 15'Message ID  :'
     A            MSGID          7A  O  9 29COLOR(WHT)
     A                                  9 37'     File Name  . :'
     A            UFILE          8A  O  9 57COLOR(WHT)
     A                                  9 66'  '
     A                                  9 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 16'                                  -
     A                                                       '
     A                                 10 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 11 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)
     A                                 11 67' '
     A                                 11 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 12 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)
     A                                 12 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 13 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)
     A                                 13 46'                      '
     A                                 13 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 15'                                  -
     A                                                         '
     A                                 14 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 15'Select one of the following option-
     A                                      s. Then Enter.     '
     A                                 15 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 15'                                  -
     A                                                         '
     A                                 16 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 17 13' ' DSPATR(RI) COLOR(TRQ)
     A            UEROPT         1A  B 17 15DSPATR(UL) DSPATR(HI)
     A                                      VALUES('1' '2' '3')
     A                                 17 17' 1. Continue at the beginning of p-
     A                                      rogram           '
     A                                 17 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 15'   2. Cancel the processing of the-
     A                                       program           '
     A                                 18 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 15'   3. Return control to the system-
     A                                       error handler     '
     A                                 19 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 15'                                  -
     A                                                         '
     A                                 20 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 15'Enter                             -
     A                                                         '  DSPATR(HI)
     A                                 21 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 22 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A*********************************************************************
     A          R MSGRCD                    TEXT('MSG SFL RECORD')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGM                       SFLPGMQ
     A*********************************************************************
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ
     A N98                                  SFLEND
     A            PGM                       SFLPGMQ
     A*
