     A********************************************************************
     A* Copyright 2012    ** KDP Software Ltd **      All Rights Reserved
     A********************************************************************
     A*
     A*  DISPLAY FILE ID     -    MSTOKREQ
     A*  DISPLAY FILE NAME   -    Work with Stock Take Requests
     A*  DATE CREATED        -    Jan 12, 2012
     A*
     A******************************************************************
     A                                      PRINT
     A                                      ALTHELP(CA01)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      HLPTITLE(' ')
     A                                      HELP
     A          R SCR001
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'Work with Stock Take Requests '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0001    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  4'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 14'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 18'Inv'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7  6'Seq'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 12'Whse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 18'Group'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 25'Supplier'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 36'Class'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 42'Group'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 48'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 59'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR001S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            WK0007    R        H      REFFLD(SRBFLAG STOKREQ)
     A            FL0001         1  0B  8  2
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XRSEQ     R        O  8  5REFFLD(SRSEQ STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A            WK0016    R     A  O  8 12REFFLD(SRFWHSE STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0014    R     A  O  8 19REFFLD(SRFSTIG STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0015    R     A  O  8 25REFFLD(SRFSUPPN STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0012    R     A  O  8 32REFFLD(SRFSBRN STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0009    R     A  O  8 36REFFLD(SRFCLAS STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0013    R     A  O  8 42REFFLD(SRFSGRP STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0011    R     A  O  8 48REFFLD(SRFLOCN STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0010    R     A  O  8 59REFFLD(SRFITEM STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0024    R     A  O  9 12REFFLD(SRTWHSE STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0022    R     A  O  9 19REFFLD(SRTSTIG STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  9 25REFFLD(SRTSUPPN STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0020    R     A  O  9 32REFFLD(SRTSBRN STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0017    R     A  O  9 36REFFLD(SRTCLAS STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0021    R     A  O  9 42REFFLD(SRTSGRP STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0019    R     A  O  9 48REFFLD(SRTLOCN STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0018    R     A  O  9 59REFFLD(SRTITEM STOKREQ)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC01          9  0H
     A            HD0006    R        H      REFFLD(SRCOYNO STOKREQ)
     A                                      ALIAS(ALIAS00001)
     A            HRSEQ     R        H      REFFLD(SRSEQ STOKREQ)
     A                                      ALIAS(ALIAS00002)
     A            INSAV1        99   H
     A          R SCR001C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR001S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR001S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(6)
     A                                      SFLSIZ(6)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0001CYDESC -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 2 13 2)
     A                                      HLPPNLGRP(SC0001FL0001 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 5 13 9)
     A                                      HLPPNLGRP(SC0001SRSEQ -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 12 13 14)
     A                                      HLPPNLGRP(SC0001SRFWHSE -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 19 13 20)
     A                                      HLPPNLGRP(SC0001SRFSTIG -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 25 13 30)
     A                                      HLPPNLGRP(SC0001SRFSUPPN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 32 13 34)
     A                                      HLPPNLGRP(SC0001SRFSBRN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 36 13 38)
     A                                      HLPPNLGRP(SC0001SRFCLAS -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 42 13 44)
     A                                      HLPPNLGRP(SC0001SRFSGRP -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 48 13 57)
     A                                      HLPPNLGRP(SC0001SRFLOCN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 59 13 78)
     A                                      HLPPNLGRP(SC0001SRFITEM -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 12 14 14)
     A                                      HLPPNLGRP(SC0001SRTWHSE -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 19 14 20)
     A                                      HLPPNLGRP(SC0001SRTSTIG -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 25 14 30)
     A                                      HLPPNLGRP(SC0001SRTSUPPN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 32 14 34)
     A                                      HLPPNLGRP(SC0001SRTSBRN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 36 14 38)
     A                                      HLPPNLGRP(SC0001SRTCLAS -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 42 14 44)
     A                                      HLPPNLGRP(SC0001SRTSGRP -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 48 14 57)
     A                                      HLPPNLGRP(SC0001SRTLOCN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 59 14 78)
     A                                      HLPPNLGRP(SC0001SRTITEM -
     A                                      MSTOKREQH)
     A          H                           HLPARA(21 18 21 23)
     A                                      HLPPNLGRP(SC0001PS0102 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MSTOKREQH)
     A                                 21  2'Position to . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            PS0102         5  0B 21 18
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=C-
     A                                      ancel'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A            RRN01          4S 0H      SFLRCDNBR
     A            XRN01          4S 0H
     A          R SCR002                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0002CYDESC -
     A                                      MSTOKREQH)
     A          H                           HLPARA(6 36 6 40)
     A                                      HLPPNLGRP(SC0002SRSEQ -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 36 8 38)
     A                                      HLPPNLGRP(SC0002SRFWHSE -
     A                                      MSTOKREQH)
     A          H                           HLPARA(8 58 8 60)
     A                                      HLPPNLGRP(SC0002SRTWHSE -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 36 9 37)
     A                                      HLPPNLGRP(SC0002SRFSTIG -
     A                                      MSTOKREQH)
     A          H                           HLPARA(9 58 9 59)
     A                                      HLPPNLGRP(SC0002SRTSTIG -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 36 10 41)
     A                                      HLPPNLGRP(SC0002SRFSUPPN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 43 10 45)
     A                                      HLPPNLGRP(SC0002SRFSBRN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 58 10 63)
     A                                      HLPPNLGRP(SC0002SRTSUPPN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 65 10 67)
     A                                      HLPPNLGRP(SC0002SRTSBRN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 36 11 38)
     A                                      HLPPNLGRP(SC0002SRFCLAS -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 58 11 60)
     A                                      HLPPNLGRP(SC0002SRTCLAS -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 36 12 38)
     A                                      HLPPNLGRP(SC0002SRFSGRP -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 58 12 60)
     A                                      HLPPNLGRP(SC0002SRTSGRP -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 36 13 45)
     A                                      HLPPNLGRP(SC0002SRFLOCN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 58 13 67)
     A                                      HLPPNLGRP(SC0002SRTLOCN -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 36 14 55)
     A                                      HLPPNLGRP(SC0002SRFITEM -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 58 14 77)
     A                                      HLPPNLGRP(SC0002SRTITEM -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MSTOKREQH)
     A            USER          10   O  1  2
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                      OVRATR
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                      OVRATR
     A            PGM           10   O  2  2
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  2 26'Work with Stock Take Requests '
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  2 73TIME
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  3  2'SC0002    '
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  4  2'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  6  2'Sequence  . . . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XRSEQ     R        O  6 36REFFLD(SRSEQ STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                  7 36'From'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 58'To'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  8  2'Warehouse Number  . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0016    R     A  B  8 36REFFLD(SRFWHSE STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0024    R     A  B  8 58REFFLD(SRTWHSE STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                  9  2'Stock Inventory Group . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0014    R     A  B  9 36REFFLD(SRFSTIG STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0022    R     A  B  9 58REFFLD(SRTSTIG STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 10  2'Supplier Number . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0015    R     A  B 10 36REFFLD(SRFSUPPN STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0012    R     A  B 10 43REFFLD(SRFSBRN STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0023    R     A  B 10 58REFFLD(SRTSUPPN STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0020    R     A  B 10 65REFFLD(SRTSBRN STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 11  2'Item Class  . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0009    R     A  B 11 36REFFLD(SRFCLAS STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0017    R     A  B 11 58REFFLD(SRTCLAS STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 12  2'Stock Group . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0013    R     A  B 12 36REFFLD(SRFSGRP STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0021    R     A  B 12 58REFFLD(SRTSGRP STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 13  2'Location  . . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0011    R     A  B 13 36REFFLD(SRFLOCN STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0019    R     A  B 13 58REFFLD(SRTLOCN STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 14  2'Item Number . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0010    R     A  B 14 36REFFLD(SRFITEM STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0018    R     A  B 14 58REFFLD(SRTITEM STOKREQ)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-
     A                                      4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR003
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 21 10 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 21 11 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 21 12 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 21 13 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 21 14 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 64)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MSTOKREQH)
     A                                  3  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'          '
     A                                  4 16'     List of Item Classes     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 47'                '
     A                                  4 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                              '
     A                                  5 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                              '
     A                                  6 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                  '
     A                                  7 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                              '
     A                                  8 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Class'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 21'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 33'                              '
     A                                  9 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T01001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T02001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18'  '
     A            T03001        40   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 62' '
     A                                 10 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T01002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T02002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18'  '
     A            T03002        40   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 62' '
     A                                 11 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T01003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T02003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18'  '
     A            T03003        40   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 62' '
     A                                 12 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T01004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T02004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18'  '
     A            T03004        40   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 62' '
     A                                 13 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T01005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T02005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18'  '
     A            T03005        40   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 62' '
     A                                 14 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                              '
     A                                 15 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                  '
     A                                 16 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR004
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 7 10 7)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 10 10 29)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 31 10 70)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 7 11 7)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 10 11 29)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 31 11 70)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 7 12 7)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 10 12 29)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 31 12 70)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 7 13 7)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 10 13 29)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 31 13 70)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 7 14 7)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 10 14 29)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 31 14 70)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 74)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MSTOKREQH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'               '
     A                                  4 21'        List of Items         '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 52'                     '
     A                                  4 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                        '
     A                                  5 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                            '
     A                                  6 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                            '
     A                                  7 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                        '
     A                                  8 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Act'
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                  9 10'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 22'        '
     A                                  9 31'Item Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 48'                         '
     A                                  9 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5' '
     A            T04001         1  0B 10  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A            T05001        20   O 10 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06001        40   O 10 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 72' '
     A                                 10 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5' '
     A            T04002         1  0B 11  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A            T05002        20   O 11 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06002        40   O 11 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 72' '
     A                                 11 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5' '
     A            T04003         1  0B 12  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A            T05003        20   O 12 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06003        40   O 12 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 72' '
     A                                 12 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5' '
     A            T04004         1  0B 13  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A            T05004        20   O 13 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06004        40   O 13 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 72' '
     A                                 13 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5' '
     A            T04005         1  0B 14  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A            T05005        20   O 14 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T06005        40   O 14 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 72' '
     A                                 14 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                        '
     A                                 15 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                            '
     A                                 16 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR005
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 14 10 15)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 23 10 62)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 14 11 15)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 23 11 62)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 14 12 15)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 23 12 62)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 14 13 15)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 23 13 62)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 14 14 15)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 23 14 62)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 66)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MSTOKREQH)
     A                                  3  3'                                  -
     A                                                                    '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'          '
     A                                  4 16'   List of Inventory Groups   '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 47'                  '
     A                                  4 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                '
     A                                  5 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                '
     A                                  6 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                    '
     A                                  7 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                '
     A                                  8 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Inv Grp'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 23'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 35'                              '
     A                                  9 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T07001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T08001         2   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 17'     '
     A            T09001        40   O 10 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 64' '
     A                                 10 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T07002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T08002         2   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 17'     '
     A            T09002        40   O 11 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 64' '
     A                                 11 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T07003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T08003         2   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 17'     '
     A            T09003        40   O 12 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 64' '
     A                                 12 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T07004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T08004         2   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 17'     '
     A            T09004        40   O 13 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 64' '
     A                                 13 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T07005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T08005         2   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 17'     '
     A            T09005        40   O 14 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 64' '
     A                                 14 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                '
     A                                 15 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                    '
     A                                 16 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                    '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR006
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 21 10 60)
     A                                      HLPPNLGRP(SC0006T12 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 21 11 60)
     A                                      HLPPNLGRP(SC0006T12 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 21 12 60)
     A                                      HLPPNLGRP(SC0006T12 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 21 13 60)
     A                                      HLPPNLGRP(SC0006T12 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 21 14 60)
     A                                      HLPPNLGRP(SC0006T12 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 64)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MSTOKREQH)
     A                                  3  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'            '
     A                                  4 18'     List of Stock Groups     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 49'              '
     A                                  4 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                              '
     A                                  5 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                              '
     A                                  6 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                  '
     A                                  7 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                              '
     A                                  8 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Group'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 21'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 33'                              '
     A                                  9 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T10001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T11001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18'  '
     A            T12001        40   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 62' '
     A                                 10 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T10002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T11002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18'  '
     A            T12002        40   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 62' '
     A                                 11 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T10003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T11003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18'  '
     A            T12003        40   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 62' '
     A                                 12 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T10004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T11004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18'  '
     A            T12004        40   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 62' '
     A                                 13 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T10005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T11005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18'  '
     A            T12005        40   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 62' '
     A                                 14 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                              '
     A                                 15 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                  '
     A                                 16 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR007
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0007T13 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 14 10 19)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 21 10 23)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 26 10 65)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0007T13 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 14 11 19)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 21 11 23)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 26 11 65)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0007T13 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 14 12 19)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 21 12 23)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 26 12 65)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0007T13 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 14 13 19)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 21 13 23)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 26 13 65)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0007T13 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 14 14 19)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 21 14 23)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 26 14 65)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 72)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MSTOKREQH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                 '
     A                                  4 23'      List of Suppliers       '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 54'                 '
     A                                  4 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                      '
     A                                  5 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                          '
     A                                  6 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                          '
     A                                  7 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                      '
     A                                  8 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Supplier'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 23'  '
     A                                  9 26'Name'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 31'                                  -
     A                                            '
     A                                  9 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T13001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T14001         6   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15001         3   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T16001        40   O 10 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 67'    '
     A                                 10 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T13002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T14002         6   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15002         3   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T16002        40   O 11 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 67'    '
     A                                 11 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T13003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T14003         6   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15003         3   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T16003        40   O 12 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 67'    '
     A                                 12 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T13004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T14004         6   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15004         3   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T16004        40   O 13 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 67'    '
     A                                 13 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T13005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T14005         6   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T15005         3   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T16005        40   O 14 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 67'    '
     A                                 14 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                      '
     A                                 15 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                          '
     A                                 16 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                         -
     A                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR008
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 20 10 59)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 20 11 59)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 20 12 59)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 20 13 59)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 20 14 59)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 63)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MSTOKREQH)
     A                                  3  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'            '
     A                                  4 18'      List of Warehouses      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 49'             '
     A                                  4 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                             '
     A                                  5 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                             '
     A                                  6 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                 '
     A                                  7 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                             '
     A                                  8 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Whse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 20'Whse Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 37'                         '
     A                                  9 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T17001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T18001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18' '
     A            T19001        40   O 10 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 61' '
     A                                 10 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T17002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T18002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18' '
     A            T19002        40   O 11 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 61' '
     A                                 11 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T17003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T18003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18' '
     A            T19003        40   O 12 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 61' '
     A                                 12 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T17004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T18004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18' '
     A            T19004        40   O 13 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 61' '
     A                                 13 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T17005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T18005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18' '
     A            T19005        40   O 14 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 61' '
     A                                 14 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                             '
     A                                 15 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                 '
     A                                 16 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR009
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 20 10 29)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(10 32 10 71)
     A                                      HLPPNLGRP(SC0009T23 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 20 11 29)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(11 32 11 71)
     A                                      HLPPNLGRP(SC0009T23 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 20 12 29)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(12 32 12 71)
     A                                      HLPPNLGRP(SC0009T23 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 20 13 29)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(13 32 13 71)
     A                                      HLPPNLGRP(SC0009T23 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 20 14 29)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MSTOKREQH)
     A          H                           HLPARA(14 32 14 71)
     A                                      HLPPNLGRP(SC0009T23 -
     A                                      MSTOKREQH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 75)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MSTOKREQH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                          '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                   '
     A                                  4 25'List of Locations in Warehouse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 56'                  '
     A                                  4 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                         '
     A                                  5 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                             '
     A                                  6 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                             '
     A                                  7 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                         '
     A                                  8 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Whse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 20'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 29'  '
     A                                  9 32'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 44'                              '
     A                                  9 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T20001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T21001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18' '
     A            T22001        10   O 10 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T23001        40   O 10 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 73' '
     A                                 10 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T20002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T21002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18' '
     A            T22002        10   O 11 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T23002        40   O 11 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 73' '
     A                                 11 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T20003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T21003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18' '
     A            T22003        10   O 12 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T23003        40   O 12 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 73' '
     A                                 12 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T20004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T21004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18' '
     A            T22004        10   O 13 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T23004        40   O 13 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 73' '
     A                                 13 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T20005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T21005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18' '
     A            T22005        10   O 14 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T23005        40   O 14 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 73' '
     A                                 14 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                         '
     A                                 15 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                             '
     A                                 16 75' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                         -
     A                                          '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A*********************************************************************
     A          R PSSR0001                  CLRL(*NO) OVERLAY
     A                                  1 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  2 15'PSSR0001'
     A                                  2 24'       Execution Error Handler    -
     A                                                ' DSPATR(HI)
     A                                  2 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 15'                                  -
     A                                                         '
     A                                  3 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 15'Job . . . . :'
     A            WSID          10A  O  4 29COLOR(WHT)
     A                                  4 40'  Program  . . :'
     A            PGM           10A  O  4 57COLOR(WHT)
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 15'User  . . . :'
     A            USER          10A  O  5 29COLOR(WHT)
     A                                  5 40'  Library  . . :'
     A            ULIB          10A  O  5 57COLOR(WHT)
     A                                  5 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 15'Number  . . :'
     A            UJOBN          6S 0O  6 29COLOR(WHT)
     A                                  6 36'      Compiled . . :'
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)  COLOR(WHT)
     A                                  6 66'  '
     A                                  6 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 15'Routine . . :'
     A            UROUTN         8A  O  7 29COLOR(WHT)
     A                                  7 38'                  '
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')  COLOR(WHT)
     A                                  7 66'  '
     A                                  7 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 15'Status Code :'
     A            USTAT4         4A  O  8 29COLOR(WHT)
     A                                  8 34'        Source Line. :'
     A            USRCLN         8A  O  8 57COLOR(WHT)
     A                                  8 66'  '
     A                                  8 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 15'Message ID  :'
     A            MSGID          7A  O  9 29COLOR(WHT)
     A                                  9 37'     File Name  . :'
     A            UFILE          8A  O  9 57COLOR(WHT)
     A                                  9 66'  '
     A                                  9 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 16'                                  -
     A                                                       '
     A                                 10 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 11 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)
     A                                 11 67' '
     A                                 11 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 12 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)
     A                                 12 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 13 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)
     A                                 13 46'                      '
     A                                 13 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 15'                                  -
     A                                                         '
     A                                 14 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 15'Select one of the following option-
     A                                      s. Then Enter.     '
     A                                 15 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 15'                                  -
     A                                                         '
     A                                 16 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 17 13' ' DSPATR(RI) COLOR(TRQ)
     A            UEROPT         1A  B 17 15DSPATR(UL) DSPATR(HI)
     A                                      VALUES('1' '2' '3')
     A                                 17 17' 1. Continue at the beginning of p-
     A                                      rogram           '
     A                                 17 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 15'   2. Cancel the processing of the-
     A                                       program           '
     A                                 18 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 15'   3. Return control to the system-
     A                                       error handler     '
     A                                 19 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 15'                                  -
     A                                                         '
     A                                 20 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 15'Enter                             -
     A                                                         '  DSPATR(HI)
     A                                 21 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 22 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A*********************************************************************
     A          R MSGRCD                    TEXT('MSG SFL RECORD')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGM                       SFLPGMQ
     A*********************************************************************
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ
     A N98                                  SFLEND
     A            PGM                       SFLPGMQ
     A*
