     A********************************************************************
     A* Copyright 2012    ** KDP Software Ltd **      All Rights Reserved
     A********************************************************************
     A*
     A*  DISPLAY FILE ID     -    MSTOKMOV
     A*  DISPLAY FILE NAME   -        Enter Stock Movements
     A*  DATE CREATED        -    Jan 12, 2012
     A*
     A******************************************************************
     A                                      PRINT
     A                                      ALTHELP(CA01)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      HLPTITLE(' ')
     A                                      HELP
     A          R SCR001
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'    Enter Stock Movements     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0001    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  4'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 10'Trans'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 17'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR001S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0001         1  0B  8  4
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XTTRNC    R     A  O  8 10REFFLD(TTTRNC IMSTRN)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XTDESC    R     A  O  8 17REFFLD(TTDESC IMSTRN)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC05          9  0H
     A            HD0004    R        H      REFFLD(TTCOYNO IMSTRN)
     A                                      ALIAS(ALIAS00001)
     A            HTTRNC    R        H      REFFLD(TTTRNC IMSTRN)
     A                                      ALIAS(ALIAS00002)
     A            INSAV1        99   H
     A          R SCR001C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR001S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR001S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0001CYDESC -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(8 4 19 4)
     A                                      HLPPNLGRP(SC0001FL0001 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(8 10 19 11)
     A                                      HLPPNLGRP(SC0001TTTRNC -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(8 17 19 56)
     A                                      HLPPNLGRP(SC0001TTDESC -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(21 18 21 19)
     A                                      HLPPNLGRP(SC0001PS0102 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MSTOKMOVH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0102         2   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN01          4S 0H      SFLRCDNBR
     A            XRN01          4S 0H
     A          R SCR002                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0002CYDESC -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 2 6 41)
     A                                      HLPPNLGRP(SC0002TTDESC -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(7 25 7 27)
     A                                      HLPPNLGRP(SC0002STWHSE -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(7 41 7 80)
     A                                      HLPPNLGRP(SC0002WKWDES -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(8 25 8 44)
     A                                      HLPPNLGRP(SC0002STITEM -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(9 25 9 64)
     A                                      HLPPNLGRP(SC0002ITIDESC -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 25 10 34)
     A                                      HLPPNLGRP(SC0002STLOCN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 41 10 80)
     A                                      HLPPNLGRP(SC0002WKLDES -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 25 12 34)
     A                                      HLPPNLGRP(SC0002STTQTY -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 25 13 39)
     A                                      HLPPNLGRP(SC0002STTREF -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 25 14 38)
     A                                      HLPPNLGRP(SC0002STUCST -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(15 25 15 38)
     A                                      HLPPNLGRP(SC0002STWEIG -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(16 25 16 31)
     A                                      HLPPNLGRP(SC0002STTIME -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(17 25 17 44)
     A                                      HLPPNLGRP(SC0002EDCARR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(18 25 18 30)
     A                                      HLPPNLGRP(SC0002STSUPPN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(18 32 18 34)
     A                                      HLPPNLGRP(SC0002STBRNBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(19 25 19 27)
     A                                      HLPPNLGRP(SC0002STWHST -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(19 41 19 80)
     A                                      HLPPNLGRP(SC0002WKDESW -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(20 25 20 34)
     A                                      HLPPNLGRP(SC0002STLOCT -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(20 41 20 80)
     A                                      HLPPNLGRP(SC0002WKDESL -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MSTOKMOVH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'    Enter Stock Movements     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0002    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XTDESC    R     A  O  6  2REFFLD(TTDESC IMSTRN)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A                                  7  2'Warehouse Number  . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTWHSE    R     A  B  7 25REFFLD(STWHSE STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  27                                  DSPATR(PC)
     A  27                                  DSPATR(RI)
     A  28                                  DSPATR(PR)
     A            WKWDES        40   O  7 41
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  2'Item Number . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTITEM    R     A  B  8 25REFFLD(STITEM STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A            WK0005    R     A  O  9 25REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A                                 10  2'Location  . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTLOCN    R     A  B 10 25REFFLD(STLOCN STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  13                                  DSPATR(PC)
     A  13                                  DSPATR(RI)
     A            WKLDES        40   O 10 41
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11  2'Transaction Date  . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0023        10   B 11 25
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                 12  2'Transaction Qty . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XTTQTY    R        B 12 25REFFLD(STTQTY STOKMOV)
     A                                      DLTEDT
     A  20                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(M)
     A  19                                  DSPATR(PC)
     A  19                                  DSPATR(RI)
     A                                 13  2'Transaction Ref . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XTTREF    R     A  B 13 25REFFLD(STTREF STOKMOV)
     A                                      DLTEDT
     A  22                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(PC)
     A  21                                  DSPATR(RI)
     A                                 14  2'Unit Cost . . . . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XTUCST    R        B 14 25REFFLD(STUCST STOKMOV)
     A                                      DLTEDT
     A  24                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(PC)
     A  23                                  DSPATR(RI)
     A                                 15  2'Weight  . . . . . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XTWEIG    R        B 15 25REFFLD(STWEIG STOKMOV)
     A                                      DLTEDT
     A  26                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(PC)
     A  25                                  DSPATR(RI)
     A                                 16  2'Time  . . . . . . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            XTTIME    R        B 16 25REFFLD(STTIME STOKMOV)
     A                                      DLTEDT
     A  18                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(PC)
     A  17                                  DSPATR(RI)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 17  2'Carrier . . . . . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            XDCARR    R     A  B 17 25REFFLD(EDCARR EXPDEL)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 18  2'Supplier Number . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  06                                  DSPATR(ND)
     A            WK0012    R     A  B 18 25REFFLD(STSUPPN STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A            WK0009    R     A  B 18 32REFFLD(STBRNBR STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 19  2'Other Warehouse . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  04                                  DSPATR(ND)
     A            XTWHST    R     A  B 19 25REFFLD(STWHST STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A  31
     AO 03                                  DSPATR(PR)
     A  04                                  DSPATR(ND)
     A            WKDESW        40   O 19 41
     A                                      OVRDTA
     A                                      OVRATR
     A                                 20  2'Other Location  . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  04                                  DSPATR(ND)
     A            XTLOCT    R     A  B 20 25REFFLD(STLOCT STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  15                                  DSPATR(PC)
     A  15                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A            WKDESL        40   O 20 41
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR003
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 21 6 23)
     A                                      HLPPNLGRP(SC0003STWHSE -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 7 10 7)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 10 10 29)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 31 10 70)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 7 11 7)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 10 11 29)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 31 11 70)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 7 12 7)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 10 12 29)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 31 12 70)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 7 13 7)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 10 13 29)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 31 13 70)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 7 14 7)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 10 14 29)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 31 14 70)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 73)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                        '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'               '
     A                                  4 21'  List of Items In Warehouse  '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 52'                    '
     A                                  4 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                       '
     A                                  5 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Warehouse . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTWHSE    R     A  O  6 21REFFLD(STWHSE STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                  6 25'                                  -
     A                                                   '
     A                                  6 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 18'6=Locations'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 30'                                  -
     A                                              '
     A                                  7 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                       '
     A                                  8 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Act'
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                  9 10'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 22'        '
     A                                  9 31'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 43'                             '
     A                                  9 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5' '
     A            T01001         1  0B 10  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A            T02001        20   O 10 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03001        40   O 10 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5' '
     A            T01002         1  0B 11  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A            T02002        20   O 11 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03002        40   O 11 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5' '
     A            T01003         1  0B 12  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A            T02003        20   O 12 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03003        40   O 12 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5' '
     A            T01004         1  0B 13  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A            T02004        20   O 13 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03004        40   O 13 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5' '
     A            T01005         1  0B 14  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A            T02005        20   O 14 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03005        40   O 14 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                       '
     A                                 15 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                           '
     A                                 16 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                         -
     A                                        '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR004
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 20 10 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 20 11 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 20 12 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 20 13 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 20 14 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 63)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'         '
     A                                  4 15'      List of Warehouses      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 46'                '
     A                                  4 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                             '
     A                                  5 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                             '
     A                                  6 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 18'6=Items  7=Locations'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 39'                       '
     A                                  7 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                             '
     A                                  8 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Whse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 20'Whse Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 37'                         '
     A                                  9 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T04001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T05001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18' '
     A            T06001        40   O 10 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 61' '
     A                                 10 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T04002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T05002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18' '
     A            T06002        40   O 11 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 61' '
     A                                 11 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T04003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T05003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18' '
     A            T06003        40   O 12 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 61' '
     A                                 12 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T04004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T05004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18' '
     A            T06004        40   O 13 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 61' '
     A                                 13 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T04005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T05005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18' '
     A            T06005        40   O 14 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 61' '
     A                                 14 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                             '
     A                                 15 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                 '
     A                                 16 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR005
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 21 6 23)
     A                                      HLPPNLGRP(SC0005STWHSE -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 14 10 23)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 26 10 65)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 14 11 23)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 26 11 65)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 14 12 23)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 26 12 65)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 14 13 23)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 26 13 65)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0005T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 14 14 23)
     A                                      HLPPNLGRP(SC0005T08 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 26 14 65)
     A                                      HLPPNLGRP(SC0005T09 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 69)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                 '
     A                                  4 23'List of Locations in Warehouse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 54'              '
     A                                  4 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                   '
     A                                  5 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Warehouse . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTWHSE    R     A  O  6 21REFFLD(STWHSE STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                  6 25'                                  -
     A                                               '
     A                                  6 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 18'6=Items'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                              '
     A                                  7 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                   '
     A                                  8 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 23'  '
     A                                  9 26'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 38'                              '
     A                                  9 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T07001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T08001        10   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09001        40   O 10 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 67' '
     A                                 10 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T07002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T08002        10   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09002        40   O 11 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 67' '
     A                                 11 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T07003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T08003        10   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09003        40   O 12 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 67' '
     A                                 12 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T07004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T08004        10   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09004        40   O 13 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 67' '
     A                                 13 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T07005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T08005        10   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09005        40   O 14 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 67' '
     A                                 14 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                   '
     A                                 15 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                       '
     A                                 16 69' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR006
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 21 6 23)
     A                                      HLPPNLGRP(SC0006STWHSE -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 43 6 52)
     A                                      HLPPNLGRP(SC0006STLOCN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 14 10 33)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 37 10 46)
     A                                      HLPPNLGRP(SC0006T13 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 14 11 33)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 37 11 46)
     A                                      HLPPNLGRP(SC0006T13 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 14 12 33)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 37 12 46)
     A                                      HLPPNLGRP(SC0006T13 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 14 13 33)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 37 13 46)
     A                                      HLPPNLGRP(SC0006T13 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0006T10 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 14 14 33)
     A                                      HLPPNLGRP(SC0006T11 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 37 14 46)
     A                                      HLPPNLGRP(SC0006T13 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 57)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'      '
     A                                  4 12'  List of Items in Location   '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 43'             '
     A                                  4 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                       '
     A                                  5 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Warehouse . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTWHSE    R     A  O  6 21REFFLD(STWHSE STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A                                  6 25'  '
     A                                  6 28'Location . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  6 41' '
     A            XTLOCN    R     A  O  6 43REFFLD(STLOCN STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                  6 54'  '
     A                                  6 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                           '
     A                                  7 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                       '
     A                                  8 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 26'          '
     A                                  9 37'Qty available'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 51'     '
     A                                  9 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T10001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T11001        20   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 35' '
     A            T13001         9  0B 10 37
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 10 48'        '
     A                                 10 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T10002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T11002        20   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 35' '
     A            T13002         9  0B 11 37
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 11 48'        '
     A                                 11 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T10003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T11003        20   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 35' '
     A            T13003         9  0B 12 37
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 12 48'        '
     A                                 12 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T10004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T11004        20   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 35' '
     A            T13004         9  0B 13 37
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 13 48'        '
     A                                 13 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T10005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T11005        20   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 35' '
     A            T13005         9  0B 14 37
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 14 48'        '
     A                                 14 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                       '
     A                                 15 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                           '
     A                                 16 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR007
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 20 6 22)
     A                                      HLPPNLGRP(SC0007STWHSE -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 36 6 55)
     A                                      HLPPNLGRP(SC0007STITEM -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 16 10 25)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 29 10 38)
     A                                      HLPPNLGRP(SC0007T18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 16 11 25)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 29 11 38)
     A                                      HLPPNLGRP(SC0007T18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 16 12 25)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 29 12 38)
     A                                      HLPPNLGRP(SC0007T18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 16 13 25)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 29 13 38)
     A                                      HLPPNLGRP(SC0007T18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 16 14 25)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 29 14 38)
     A                                      HLPPNLGRP(SC0007T18 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 57)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'     '
     A                                  4 11'  List of Locations for Item  '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 42'              '
     A                                  4 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                       '
     A                                  5 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Warehouse . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTWHSE    R     A  O  6 20REFFLD(STWHSE STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A                                  6 24'  '
     A                                  6 27'Item . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTITEM    R     A  O  6 36REFFLD(STITEM STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                  6 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                           '
     A                                  7 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                       '
     A                                  8 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 13'  '
     A                                  9 16'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 25'   '
     A                                  9 29'Qty Available'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 43'             '
     A                                  9 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T14001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'     '
     A            T16001        10   O 10 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 27' '
     A            T18001         9  0B 10 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 10 40'                '
     A                                 10 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T14002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'     '
     A            T16002        10   O 11 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 27' '
     A            T18002         9  0B 11 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 11 40'                '
     A                                 11 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T14003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'     '
     A            T16003        10   O 12 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 27' '
     A            T18003         9  0B 12 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 12 40'                '
     A                                 12 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T14004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'     '
     A            T16004        10   O 13 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 27' '
     A            T18004         9  0B 13 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 13 40'                '
     A                                 13 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T14005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'     '
     A            T16005        10   O 14 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 27' '
     A            T18005         9  0B 14 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 14 40'                '
     A                                 14 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                       '
     A                                 15 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                           '
     A                                 16 57' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR008
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCWHST -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SCWHSTT04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SCWHSTT05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 20 10 59)
     A                                      HLPPNLGRP(SCWHSTT06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SCWHSTT04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SCWHSTT05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 20 11 59)
     A                                      HLPPNLGRP(SCWHSTT06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SCWHSTT04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SCWHSTT05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 20 12 59)
     A                                      HLPPNLGRP(SCWHSTT06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SCWHSTT04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SCWHSTT05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 20 13 59)
     A                                      HLPPNLGRP(SCWHSTT06 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SCWHSTT04 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SCWHSTT05 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 20 14 59)
     A                                      HLPPNLGRP(SCWHSTT06 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 63)
     A                                      HLPPNLGRP(SCWHST -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'           '
     A                                  4 17'      List of Warehouses      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 48'              '
     A                                  4 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                             '
     A                                  5 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                             '
     A                                  6 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 18'6=Locations'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 30'                                '
     A                                  7 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                             '
     A                                  8 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Whse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 20'Whse Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 37'                         '
     A                                  9 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T04001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T05001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18' '
     A            T06001        40   O 10 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 61' '
     A                                 10 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T04002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T05002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18' '
     A            T06002        40   O 11 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 61' '
     A                                 11 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T04003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T05003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18' '
     A            T06003        40   O 12 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 61' '
     A                                 12 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T04004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T05004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18' '
     A            T06004        40   O 13 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 61' '
     A                                 13 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T04005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T05005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18' '
     A            T06005        40   O 14 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 61' '
     A                                 14 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                             '
     A                                 15 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                 '
     A                                 16 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR009
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCLOCT -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 21 6 23)
     A                                      HLPPNLGRP(SCLOCTSTWHSE -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(6 37 6 56)
     A                                      HLPPNLGRP(SCLOCTSTITEM -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SCLOCTT14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 16 10 25)
     A                                      HLPPNLGRP(SCLOCTT16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 29 10 37)
     A                                      HLPPNLGRP(SCLOCTT18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SCLOCTT14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 16 11 25)
     A                                      HLPPNLGRP(SCLOCTT16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 29 11 37)
     A                                      HLPPNLGRP(SCLOCTT18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SCLOCTT14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 16 12 25)
     A                                      HLPPNLGRP(SCLOCTT16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 29 12 37)
     A                                      HLPPNLGRP(SCLOCTT18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SCLOCTT14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 16 13 25)
     A                                      HLPPNLGRP(SCLOCTT16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 29 13 37)
     A                                      HLPPNLGRP(SCLOCTT18 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SCLOCTT14 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 16 14 25)
     A                                      HLPPNLGRP(SCLOCTT16 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 29 14 37)
     A                                      HLPPNLGRP(SCLOCTT18 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 63)
     A                                      HLPPNLGRP(SCLOCT -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'         '
     A                                  4 15'  List of Locations for Item  '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 46'                '
     A                                  4 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                             '
     A                                  5 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Warehouse . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTWHSE    R     A  O  6 21REFFLD(STWHSE STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A                                  6 25' '
     A                                  6 27'Item . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTITEM    R     A  O  6 37REFFLD(STITEM STOKMOV)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                  6 58'    '
     A                                  6 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                 '
     A                                  7 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                             '
     A                                  8 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 13'  '
     A                                  9 16'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 25'   '
     A                                  9 29'Qty On hand'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 41'                     '
     A                                  9 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T14001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'     '
     A            T16001        10   O 10 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 27' '
     A            T18001         9  0B 10 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 10 39'                       '
     A                                 10 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T14002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'     '
     A            T16002        10   O 11 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 27' '
     A            T18002         9  0B 11 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 11 39'                       '
     A                                 11 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T14003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'     '
     A            T16003        10   O 12 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 27' '
     A            T18003         9  0B 12 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 12 39'                       '
     A                                 12 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T14004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'     '
     A            T16004        10   O 13 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 27' '
     A            T18004         9  0B 13 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 13 39'                       '
     A                                 13 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T14005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'     '
     A            T16005        10   O 14 16
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 27' '
     A            T18005         9  0B 14 29
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 14 39'                       '
     A                                 14 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                             '
     A                                 15 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                 '
     A                                 16 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR010
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Rtrn')
     A                                      CF16 INDTXT(16 'Subs')
     A                                      CF18 INDTXT(18 'Super')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCALOC -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(16 54 16 73)
     A                                      HLPPNLGRP(ITSUBS -
     A                                      ITMMASTH)
     A          H                           HLPARA(18 54 18 73)
     A                                      HLPPNLGRP(ITSUPG -
     A                                      ITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(9 35 22 76)
     A                                      HLPPNLGRP(SCALOC -
     A                                      MSTOKMOVH)
     A                                  9 35'                                  -
     A                                              '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10 37'                                  -
     A                                          '
     A                                 10 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11 37'                                  -
     A                                          '
     A                                 11 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 37'  '
     A                                 12 40'This transaction will'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 12 62'             '
     A                                 12 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13 37'  '
     A                                 13 40'Create a negative on hand'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 13 66'         '
     A                                 13 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14 37'  '
     A                                 14 40'quantity if you continue'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 14 65'          '
     A                                 14 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15 37'                                  -
     A                                          '
     A                                 15 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16 37'  '
     A                                 16 40'Substitute .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSUBS    R     A  O 16 54REFFLD(ITSUBS ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                 16 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 37'                                  -
     A                                          '
     A                                 17 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 37'  '
     A                                 18 40'Superceded .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSUPG    R     A  O 18 54REFFLD(ITSUPG ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                 18 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 37'                                  -
     A                                          '
     A                                 19 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 37'                                  -
     A                                          '
     A                                 20 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 21 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 21 37'        '
     A                                 21 46'F12=Rtrn  F16=Subs  F18=Super'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 21 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 22 35'                                  -
     A                                              '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR011
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Alpha Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0015 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 14 10 19)
     A                                      HLPPNLGRP(SC0015TSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 21 10 23)
     A                                      HLPPNLGRP(SC0015TBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 26 10 65)
     A                                      HLPPNLGRP(SC0015TSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 14 11 19)
     A                                      HLPPNLGRP(SC0015TSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 21 11 23)
     A                                      HLPPNLGRP(SC0015TBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 26 11 65)
     A                                      HLPPNLGRP(SC0015TSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 14 12 19)
     A                                      HLPPNLGRP(SC0015TSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 21 12 23)
     A                                      HLPPNLGRP(SC0015TBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 26 12 65)
     A                                      HLPPNLGRP(SC0015TSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 14 13 19)
     A                                      HLPPNLGRP(SC0015TSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 21 13 23)
     A                                      HLPPNLGRP(SC0015TBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 26 13 65)
     A                                      HLPPNLGRP(SC0015TSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 14 14 19)
     A                                      HLPPNLGRP(SC0015TSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 21 14 23)
     A                                      HLPPNLGRP(SC0015TBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 26 14 65)
     A                                      HLPPNLGRP(SC0015TSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(16 23 16 28)
     A                                      HLPPNLGRP(SC0015FL0021 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(16 30 16 32)
     A                                      HLPPNLGRP(SC0015FL0022 -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 19 72)
     A                                      HLPPNLGRP(SC0015 -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                '
     A                                  4 22'        List Suppliers        '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 53'                  '
     A                                  4 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                      '
     A                                  5 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                          '
     A                                  6 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                          '
     A                                  7 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                      '
     A                                  8 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Supplier'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 23'  '
     A                                  9 26'Name'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 31'                                  -
     A                                            '
     A                                  9 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T07001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            TSU001         6   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR001         3   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN001        40   O 10 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 67'    '
     A                                 10 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T07002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            TSU002         6   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR002         3   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN002        40   O 11 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 67'    '
     A                                 11 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T07003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            TSU003         6   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR003         3   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN003        40   O 12 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 67'    '
     A                                 12 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T07004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            TSU004         6   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR004         3   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN004        40   O 13 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 67'    '
     A                                 13 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T07005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            TSU005         6   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR005         3   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN005        40   O 14 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                 14 67'    '
     A                                 14 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                      '
     A                                 15 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0021         6   B 16 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A            FL0022         3   B 16 30
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                 16 34'                                  -
     A                                         '
     A                                 16 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'                                  -
     A                                                                      '
     A                                 17 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  6'F12=Cancel  F18=Alpha Seq'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 32'                                  -
     A                                           '
     A                                 18 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                                  -
     A                                                                         -
     A                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR012
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Number Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCSALP -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 7 10 7)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 12 10 21)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 23 10 28)
     A                                      HLPPNLGRP(SCSALPTSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 30 10 32)
     A                                      HLPPNLGRP(SCSALPTBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(10 34 10 73)
     A                                      HLPPNLGRP(SCSALPTSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 7 11 7)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 12 11 21)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 23 11 28)
     A                                      HLPPNLGRP(SCSALPTSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 30 11 32)
     A                                      HLPPNLGRP(SCSALPTBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(11 34 11 73)
     A                                      HLPPNLGRP(SCSALPTSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 7 12 7)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 12 12 21)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 23 12 28)
     A                                      HLPPNLGRP(SCSALPTSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 30 12 32)
     A                                      HLPPNLGRP(SCSALPTBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(12 34 12 73)
     A                                      HLPPNLGRP(SCSALPTSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 7 13 7)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 12 13 21)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 23 13 28)
     A                                      HLPPNLGRP(SCSALPTSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 30 13 32)
     A                                      HLPPNLGRP(SCSALPTBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(13 34 13 73)
     A                                      HLPPNLGRP(SCSALPTSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 7 14 7)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 12 14 21)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 23 14 28)
     A                                      HLPPNLGRP(SCSALPTSU -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 30 14 32)
     A                                      HLPPNLGRP(SCSALPTBR -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(14 34 14 73)
     A                                      HLPPNLGRP(SCSALPTSN -
     A                                      MSTOKMOVH)
     A          H                           HLPARA(16 22 16 31)
     A                                      HLPPNLGRP(SCSALPPSSALP -
     A                                      MSTOKMOVH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 19 76)
     A                                      HLPPNLGRP(SCSALP -
     A                                      MSTOKMOVH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'              '
     A                                  4 20'  List Suppliers in Alpha Seq '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 51'                        '
     A                                  4 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                         -
     A                                       '
     A                                  5 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                              '
     A                                  6 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                              '
     A                                  7 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                         -
     A                                       '
     A                                  8 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Act'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 10' '
     A                                  9 12'Alpha'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 18'    '
     A                                  9 23'Supplier'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 32' '
     A                                  9 34'Name'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 39'                                  -
     A                                        '
     A                                  9 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5' '
     A            T07001         1  0B 10  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10  9'  '
     A            TAL001        10   O 10 12
     A                                      OVRDTA
     A                                      OVRATR
     A            TSU001         6   O 10 23
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR001         3   O 10 30
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN001        40   O 10 34
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5' '
     A            T07002         1  0B 11  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11  9'  '
     A            TAL002        10   O 11 12
     A                                      OVRDTA
     A                                      OVRATR
     A            TSU002         6   O 11 23
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR002         3   O 11 30
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN002        40   O 11 34
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5' '
     A            T07003         1  0B 12  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12  9'  '
     A            TAL003        10   O 12 12
     A                                      OVRDTA
     A                                      OVRATR
     A            TSU003         6   O 12 23
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR003         3   O 12 30
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN003        40   O 12 34
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5' '
     A            T07004         1  0B 13  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13  9'  '
     A            TAL004        10   O 13 12
     A                                      OVRDTA
     A                                      OVRATR
     A            TSU004         6   O 13 23
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR004         3   O 13 30
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN004        40   O 13 34
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5' '
     A            T07005         1  0B 14  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14  9'  '
     A            TAL005        10   O 14 12
     A                                      OVRDTA
     A                                      OVRATR
     A            TSU005         6   O 14 23
     A                                      OVRDTA
     A                                      OVRATR
     A            TBR005         3   O 14 30
     A                                      OVRDTA
     A                                      OVRATR
     A            TSN005        40   O 14 34
     A                                      OVRDTA
     A                                      OVRATR
     A                                 14 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                         -
     A                                       '
     A                                 15 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PSSALP        10   B 16 22
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                 16 33'                                  -
     A                                              '
     A                                 16 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'                                  -
     A                                                                         -
     A                                       '
     A                                 17 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  6'F12=Cancel  F18=Number Seq'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 33'                                  -
     A                                              '
     A                                 18 76' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                                  -
     A                                                                         -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A*********************************************************************
     A          R PSSR0001                  CLRL(*NO) OVERLAY
     A                                  1 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  2 15'PSSR0001'
     A                                  2 24'       Execution Error Handler    -
     A                                                ' DSPATR(HI)
     A                                  2 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 15'                                  -
     A                                                         '
     A                                  3 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 15'Job . . . . :'
     A            WSID          10A  O  4 29COLOR(WHT)
     A                                  4 40'  Program  . . :'
     A            PGM           10A  O  4 57COLOR(WHT)
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 15'User  . . . :'
     A            USER          10A  O  5 29COLOR(WHT)
     A                                  5 40'  Library  . . :'
     A            ULIB          10A  O  5 57COLOR(WHT)
     A                                  5 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 15'Number  . . :'
     A            UJOBN          6S 0O  6 29COLOR(WHT)
     A                                  6 36'      Compiled . . :'
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)  COLOR(WHT)
     A                                  6 66'  '
     A                                  6 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 15'Routine . . :'
     A            UROUTN         8A  O  7 29COLOR(WHT)
     A                                  7 38'                  '
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')  COLOR(WHT)
     A                                  7 66'  '
     A                                  7 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 15'Status Code :'
     A            USTAT4         4A  O  8 29COLOR(WHT)
     A                                  8 34'        Source Line. :'
     A            USRCLN         8A  O  8 57COLOR(WHT)
     A                                  8 66'  '
     A                                  8 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 15'Message ID  :'
     A            MSGID          7A  O  9 29COLOR(WHT)
     A                                  9 37'     File Name  . :'
     A            UFILE          8A  O  9 57COLOR(WHT)
     A                                  9 66'  '
     A                                  9 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 16'                                  -
     A                                                       '
     A                                 10 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 11 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)
     A                                 11 67' '
     A                                 11 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 12 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)
     A                                 12 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 13 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)
     A                                 13 46'                      '
     A                                 13 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 15'                                  -
     A                                                         '
     A                                 14 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 15'Select one of the following option-
     A                                      s. Then Enter.     '
     A                                 15 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 15'                                  -
     A                                                         '
     A                                 16 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 17 13' ' DSPATR(RI) COLOR(TRQ)
     A            UEROPT         1A  B 17 15DSPATR(UL) DSPATR(HI)
     A                                      VALUES('1' '2' '3')
     A                                 17 17' 1. Continue at the beginning of p-
     A                                      rogram           '
     A                                 17 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 15'   2. Cancel the processing of the-
     A                                       program           '
     A                                 18 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 15'   3. Return control to the system-
     A                                       error handler     '
     A                                 19 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 15'                                  -
     A                                                         '
     A                                 20 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 15'Enter                             -
     A                                                         '  DSPATR(HI)
     A                                 21 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 22 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A*********************************************************************
     A          R MSGRCD                    TEXT('MSG SFL RECORD')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGM                       SFLPGMQ
     A*********************************************************************
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ
     A N98                                  SFLEND
     A            PGM                       SFLPGMQ
     A*
