     A********************************************************************
     A* Copyright 2012    ** KDP Software Ltd **      All Rights Reserved
     A********************************************************************
     A*
     A*  DISPLAY FILE ID     -    MWAREHED
     A*  DISPLAY FILE NAME   -      Work with Warehouse Details
     A*  DATE CREATED        -    Jan 11, 2012
     A*
     A******************************************************************
     A                                      PRINT
     A                                      ALTHELP(CA01)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      HLPTITLE(' ')
     A                                      HELP
     A          R SCR001
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0001    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5 35'6=Items'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  5 44'7=Locations'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  7  2'Action'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  7 10'Whse'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  7 16'Description'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A          R SCR001S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0001         1  0B  8  4
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XHWHSE    R     A  O  8 10REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  8 16REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC06          9  0H
     A            HD0020    R        H      REFFLD(WHCOYNO WAREHED)
     A                                      ALIAS(ALIAS00001)
     A            HHWHSE    R        H      REFFLD(WHWHSE WAREHED)
     A                                      ALIAS(ALIAS00002)
     A            INSAV1        99   H
     A          R SCR001C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR001S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR001S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0001CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 4 19 4)
     A                                      HLPPNLGRP(SC0001FL0001 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 10 19 12)
     A                                      HLPPNLGRP(SC0001WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 16 19 55)
     A                                      HLPPNLGRP(SC0001WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(21 18 21 20)
     A                                      HLPPNLGRP(SC0001PS0102 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MWAREHEDH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0102         3   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PR)
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=C-
     A                                      ancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN01          4S 0H      SFLRCDNBR
     A            XRN01          4S 0H
     A          R SCR002                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0002CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 34 6 36)
     A                                      HLPPNLGRP(SC0002WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 34 7 73)
     A                                      HLPPNLGRP(SC0002WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 34 8 35)
     A                                      HLPPNLGRP(SC0002WHWTYP -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 37 8 76)
     A                                      HLPPNLGRP(SC0002WTWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 34 9 34)
     A                                      HLPPNLGRP(SC0002WHCTYP -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 34 10 34)
     A                                      HLPPNLGRP(SC0002WHREPC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 34 12 43)
     A                                      HLPPNLGRP(SC0002DTDTLM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 34 13 43)
     A                                      HLPPNLGRP(SC0002WHLMBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 34 14 43)
     A                                      HLPPNLGRP(SC0002DTCRDT -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 34 15 43)
     A                                      HLPPNLGRP(SC0002WHCRBY -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MWAREHEDH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0002    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'Warehouse Number . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  B  6 34REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  07                                  DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  06                                  DSPATR(PR)
     A                                  7  2'Warehouse Description  . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  B  7 34REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                  8  2'Warehouse Type . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWTYP    R     A  B  8 34REFFLD(WHWTYP WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0029    R     A  O  8 37REFFLD(WTWDESC WARETYP)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  9  2'Costing Type . . . . . . . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XHCTYP    R        B  9 34REFFLD(WHCTYP WAREHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 10  2'Replenishment Cycle flag . . .'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XHREPC    R     A  B 10 34REFFLD(WHREPC WAREHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 12  2'Amended date . . . . . . . . :'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            DTDTLM        10   O 12 34
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13  2'Amended By . . . . . . . . . :'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XHLMBY    R     A  O 13 34REFFLD(WHLMBY WAREHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 14  2'Created Date . . . . . . . . :'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            DTCRDT        10   O 14 34
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15  2'Created by . . . . . . . . . :'
     A                                      COLOR(GRN)
     A                                      OVRATR
     A            XHCRBY    R     A  O 15 34REFFLD(WHCRBY WAREHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-
     A                                      4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR003
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0003    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Warehouse Number  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  4 31REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  4 35REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  6  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 35'6=Locations'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 48'7=Summary'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 59'8=Movements'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  9  2'Act'
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                  9  6'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 28'Item Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 70'Qty On hand'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR003S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0002         1  0B 10  3
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XDITEM    R     A  O 10  6REFFLD(WDITEM WAREDET)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            FL0003        40   O 10 28
     A                                      COLOR(GRN)
     A            XDQOH     R        O 10 70REFFLD(WDQOH WAREDET)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            HRC10          9  0H
     A            HD0019    R        H      REFFLD(WDCOYNO WAREDET)
     A                                      ALIAS(ALIAS00003)
     A            HDWHSE    R        H      REFFLD(WDWHSE WAREDET)
     A                                      ALIAS(ALIAS00004)
     A            HDITEM    R        H      REFFLD(WDITEM WAREDET)
     A                                      ALIAS(ALIAS00005)
     A            HRC02          9  0H
     A            HD0003    R        H      REFFLD(ITCOYNO ITMMAST)
     A                                      ALIAS(ALIAS00006)
     A            HTITEM    R        H      REFFLD(ITITEM ITMMAST)
     A                                      ALIAS(ALIAS00007)
     A            INSAV1        99   H
     A          R SCR003C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR003S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR003S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(10)
     A                                      SFLSIZ(10)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0003CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 31 4 33)
     A                                      HLPPNLGRP(SC0003WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 35 4 74)
     A                                      HLPPNLGRP(SC0003WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 3 19 3)
     A                                      HLPPNLGRP(SC0003FL0002 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 6 19 25)
     A                                      HLPPNLGRP(WDITEM -
     A                                      WAREDETH)
     A          H                           HLPARA(10 28 19 67)
     A                                      HLPPNLGRP(SC0003FL0003 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 70 19 79)
     A                                      HLPPNLGRP(SC0003WDQOH -
     A                                      MWAREHEDH)
     A          H                           HLPARA(21 18 21 32)
     A                                      HLPPNLGRP(SC0003PS0301 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MWAREHEDH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0301        15   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=C-
     A                                      ancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN02          4S 0H      SFLRCDNBR
     A            XRN02          4S 0H
     A          R SCR004                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0004CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(5 23 5 25)
     A                                      HLPPNLGRP(SC0004WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(5 27 5 66)
     A                                      HLPPNLGRP(SC0004WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 23 6 42)
     A                                      HLPPNLGRP(SC0004WDITEM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 23 7 62)
     A                                      HLPPNLGRP(SC0004ITIDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 23 8 27)
     A                                      HLPPNLGRP(SC0004WDUOM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 23 9 28)
     A                                      HLPPNLGRP(SC0004WDSUPPN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 30 9 32)
     A                                      HLPPNLGRP(SC0004WDSBRN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 34 9 73)
     A                                      HLPPNLGRP(SC0004SUNAME -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 23 10 23)
     A                                      HLPPNLGRP(SC0004WDSTOG -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 25 10 64)
     A                                      HLPPNLGRP(SC0004TGDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 23 12 31)
     A                                      HLPPNLGRP(SC0004WDMINB -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 69 12 78)
     A                                      HLPPNLGRP(SC0004WDOBAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 23 13 31)
     A                                      HLPPNLGRP(SC0004WDMAXB -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 69 13 78)
     A                                      HLPPNLGRP(SC0004WDQOH -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 23 14 31)
     A                                      HLPPNLGRP(SC0004WDFIXQ -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 69 14 78)
     A                                      HLPPNLGRP(SC0004WDQAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 23 15 31)
     A                                      HLPPNLGRP(SC0004WDSAFE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 69 15 78)
     A                                      HLPPNLGRP(SC0004WDQOR -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 23 16 31)
     A                                      HLPPNLGRP(SC0004WDEOQ -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 69 16 78)
     A                                      HLPPNLGRP(SC0004WDQOO -
     A                                      MWAREHEDH)
     A          H                           HLPARA(17 69 17 78)
     A                                      HLPPNLGRP(SC0004WDQBQ -
     A                                      MWAREHEDH)
     A          H                           HLPARA(18 23 18 25)
     A                                      HLPPNLGRP(SC0004WDLTIM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(19 23 19 35)
     A                                      HLPPNLGRP(SC0004WDUCST -
     A                                      MWAREHEDH)
     A          H                           HLPARA(19 69 19 78)
     A                                      HLPPNLGRP(SC0004FL0008 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(20 23 20 35)
     A                                      HLPPNLGRP(SC0004WDLCST -
     A                                      MWAREHEDH)
     A          H                           HLPARA(20 69 20 78)
     A                                      HLPPNLGRP(SC0004WDLMBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(21 69 21 78)
     A                                      HLPPNLGRP(SC0004FL0009 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(22 69 22 78)
     A                                      HLPPNLGRP(SC0004WDCRBY -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MWAREHEDH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  17                                  DSPATR(PC)
     A  17                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0004    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  5  2'Warehouse Number  :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  5 23REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  5 27REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  6  2'Item Number . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDITEM    R     A  B  6 23REFFLD(WDITEM WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  08                                  DSPATR(UL)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A  07                                  DSPATR(PR)
     A            WK0002    R     A  O  7 23REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  8  2'Unit of Measure . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDUOM     R     A  B  8 23REFFLD(WDUOM WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  16                                  DSPATR(PC)
     A  16                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                  9  2'Supplier Number . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0018    R     A  B  9 23REFFLD(WDSUPPN WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XDSBRN    R     A  B  9 30REFFLD(WDSBRN WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XUNAME    R     A  O  9 34REFFLD(SUNAME SUPLIER)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10  2'Stk Trnovr Grp  . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDSTOG    R     A  B 10 23REFFLD(WDSTOG WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  14                                  DSPATR(PC)
     A  14                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XGDESC    R     A  O 10 25REFFLD(TGDESC STOVGP)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12  2'Minimum Balance . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDMINB    R        B 12 23REFFLD(WDMINB WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 12 44'Opening balance . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDOBAL    R        O 12 69REFFLD(WDOBAL WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 13  2'Maximum Balance . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDMAXB    R        B 13 23REFFLD(WDMAXB WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 13 44'Quantity on hand  . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDQOH     R        O 13 69REFFLD(WDQOH WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 14  2'Fixed Order Qty . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDFIXQ    R        B 14 23REFFLD(WDFIXQ WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 14 44'Quantity Allocated  . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDQAL     R        O 14 69REFFLD(WDQAL WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 15  2'Safety Stock Qty  .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDSAFE    R        B 15 23REFFLD(WDSAFE WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  13                                  DSPATR(PC)
     A  13                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 15 44'Quantity on reserve . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDQOR     R        O 15 69REFFLD(WDQOR WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 16  2'Economic order qty '
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDEOQ     R        B 16 23REFFLD(WDEOQ WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 16 44'Quantity on Order . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDQOO     R        O 16 69REFFLD(WDQOO WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 17 44'Quantity on backorder :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDQBQ     R        O 17 69REFFLD(WDQBQ WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 18  2'Lead Time in days .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDLTIM    R        B 18 23REFFLD(WDLTIM WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 19  2'Calculated Cost . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDUCST    R        B 19 23REFFLD(WDUCST WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  15                                  DSPATR(PC)
     A  15                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 19 44'Amended date  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0008        10   O 19 69
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 20  2'Cost last rcpt  . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDLCST    R        B 20 23REFFLD(WDLCST WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 20 44'Amended By  . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDLMBY    R     A  O 20 69REFFLD(WDLMBY WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 21 44'Created Date  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0009        10   O 21 69
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 22 44'Created By  . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDCRBY    R     A  O 22 69REFFLD(WDCRBY WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-
     A                                      4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR005
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0005    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Warehouse Number  :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  4 23REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  4 27REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  5  2'Item Number . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDITEM    R     A  O  5 23REFFLD(WDITEM WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0002    R     A  O  6 23REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 10  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 10'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 21'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 53'Qty On hand'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 66'Qty Allocated'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR005S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0004         1  0B 11  4
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XILOCN    R     A  O 11 10REFFLD(WILOCN WLOCITM1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            FL0010        30   O 11 21
     A            WK0044    R        O 11 53REFFLD(WIQOH WLOCITM1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            WK0043    R        O 11 66REFFLD(WIQAL WLOCITM1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            HRC14          9  0H
     A            HD0024    R        H      REFFLD(WICOYNO WLOCITM1)
     A                                      ALIAS(ALIAS00008)
     A            HD0027    R        H      REFFLD(WIWHSE WLOCITM1)
     A                                      ALIAS(ALIAS00009)
     A            HD0025    R        H      REFFLD(WIITEM WLOCITM1)
     A                                      ALIAS(ALIAS00010)
     A            HD0026    R        H      REFFLD(WILOCN WLOCITM1)
     A                                      ALIAS(ALIAS00011)
     A            INSAV1        99   H
     A          R SCR005C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR005S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR005S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(9)
     A                                      SFLSIZ(9)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0005CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 23 4 25)
     A                                      HLPPNLGRP(SC0005WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 27 4 66)
     A                                      HLPPNLGRP(SC0005WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(5 23 5 42)
     A                                      HLPPNLGRP(SC0005WDITEM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 23 6 62)
     A                                      HLPPNLGRP(SC0005ITIDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 4 19 4)
     A                                      HLPPNLGRP(SC0005FL0004 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 10 19 19)
     A                                      HLPPNLGRP(WILOCN -
     A                                      WLOCITM1H)
     A          H                           HLPARA(11 21 19 50)
     A                                      HLPPNLGRP(SC0005FL0010 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 53 19 62)
     A                                      HLPPNLGRP(SC0005WIQOH -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 66 19 75)
     A                                      HLPPNLGRP(SC0005WIQAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(SC0005PS0501 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MWAREHEDH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0501        10   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=C-
     A                                      ancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN03          4S 0H      SFLRCDNBR
     A            XRN03          4S 0H
     A          R SCR006
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0006CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 25 6 27)
     A                                      HLPPNLGRP(SC0006WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 29 6 68)
     A                                      HLPPNLGRP(SC0006WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 25 7 44)
     A                                      HLPPNLGRP(SC0006WDITEM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 25 8 64)
     A                                      HLPPNLGRP(SC0006ITIDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 25 10 34)
     A                                      HLPPNLGRP(WILOCN -
     A                                      WLOCITM1H)
     A          H                           HLPARA(10 36 10 75)
     A                                      HLPPNLGRP(SC0006WLDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 25 11 34)
     A                                      HLPPNLGRP(SC0006WIMINB -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 25 12 34)
     A                                      HLPPNLGRP(SC0006WIQOH -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 25 13 34)
     A                                      HLPPNLGRP(SC0006WIQAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 25 15 34)
     A                                      HLPPNLGRP(SC0006WICRBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 25 16 34)
     A                                      HLPPNLGRP(SC0006FL0011 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(17 25 17 34)
     A                                      HLPPNLGRP(SC0006WILMBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(18 25 18 34)
     A                                      HLPPNLGRP(SC0006FL0012 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MWAREHEDH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0006    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'Warehouse Number  . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  6 25REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  6 29REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Item Number . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDITEM    R     A  O  7 25REFFLD(WDITEM WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0002    R     A  O  8 25REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10  2'Location  . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XILOCN    R     A  B 10 25REFFLD(WILOCN WLOCITM1)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  06                                  DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  05                                  DSPATR(PR)
     A            XLDESC    R     A  O 10 36REFFLD(WLDESC WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A                                 11  2'Minimum Balance . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0042    R        B 11 25REFFLD(WIMINB WLOCITM1)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A  03                                  DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  02                                  DSPATR(PR)
     A                                 12  2'Quantity on hand  . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0044    R        O 12 25REFFLD(WIQOH WLOCITM1)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 13  2'Qty Allocated . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0043    R        O 13 25REFFLD(WIQAL WLOCITM1)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 15  2'Created By  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0037    R     A  O 15 25REFFLD(WICRBY WLOCITM1)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 16  2'Created Date  . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0011        10   O 16 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 17  2'Amended By  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0040    R     A  O 17 25REFFLD(WILMBY WLOCITM1)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 18  2'Amended date  . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0012        10   O 18 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-
     A                                      4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR007
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0007    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Warehouse Number  . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  4 25REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  4 41REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  5  2'Item Number . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDITEM    R     A  O  5 25REFFLD(WDITEM WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0002    R     A  O  6 25REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Transaction Type'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 26'Period Qty'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 37'Period Value'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 53'YTD Qty'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  7 64'YTD Value'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR007S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            XTTRNC    R     A  O  8  2REFFLD(WTTRNC WRITTYP)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            FL0013        20   O  8  5
     A            XTTRPQ    R        O  8 26REFFLD(WTTRPQ WRITTYP)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            XTTRPV    R        O  8 37REFFLD(WTTRPV WRITTYP)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            XTTRYQ    R        O  8 53REFFLD(WTTRYQ WRITTYP)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            XTTRYV    R        O  8 64REFFLD(WTTRYV WRITTYP)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            HRC16          9  0H
     A            HD0028    R        H      REFFLD(WTCOYNO WRITTYP)
     A                                      ALIAS(ALIAS00012)
     A            HD0031    R        H      REFFLD(WTWHSE WRITTYP)
     A                                      ALIAS(ALIAS00013)
     A            HD0029    R        H      REFFLD(WTITEM WRITTYP)
     A                                      ALIAS(ALIAS00014)
     A            HD0030    R        H      REFFLD(WTTRNC WRITTYP)
     A                                      ALIAS(ALIAS00015)
     A            INSAV1        99   H
     A          R SCR007C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR007S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR007S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0007CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 25 4 27)
     A                                      HLPPNLGRP(SC0007WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 41 4 80)
     A                                      HLPPNLGRP(SC0007WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(5 25 5 44)
     A                                      HLPPNLGRP(SC0007WDITEM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 25 6 64)
     A                                      HLPPNLGRP(SC0007ITIDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 2 19 3)
     A                                      HLPPNLGRP(SC0007WTTRNC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 5 19 24)
     A                                      HLPPNLGRP(SC0007FL0013 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 26 19 35)
     A                                      HLPPNLGRP(SC0007WTTRPQ -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 37 19 51)
     A                                      HLPPNLGRP(SC0007WTTRPV -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 53 19 62)
     A                                      HLPPNLGRP(SC0007WTTRYQ -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 64 19 78)
     A                                      HLPPNLGRP(SC0007WTTRYV -
     A                                      MWAREHEDH)
     A          H                           HLPARA(21 18 21 19)
     A                                      HLPPNLGRP(SC0007PS0701 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MWAREHEDH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0701         2   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN04          4S 0H      SFLRCDNBR
     A            XRN04          4S 0H
     A          R SCR008
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SCMOVE    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Warehouse Number  . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  4 25REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  4 29REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  5  2'Item Number . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDITEM    R     A  O  5 25REFFLD(WDITEM WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A            WK0002    R     A  O  6 25REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Opening Balance . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDOBAL    R        O  7 25REFFLD(WDOBAL WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                      EDTCDE(M)
     A                                  7 41'Quantity on Hand . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XDQOH     R        O  7 63REFFLD(WDQOH WAREDET)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                      EDTCDE(M)
     A                                  8  2'Trans Date'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  8 15'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  8 28'Transaction'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  8 47'Quantity'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  8 59'Reference'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR008S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0023        10   O  9  2
     A  01                                  DSPATR(ND)
     A            XTLOCN    R     A  O  9 15REFFLD(STLOCN STOKMOV1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A            FL0024        15   O  9 28
     A            XTTQTY    R        O  9 46REFFLD(STTQTY STOKMOV1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A            XTTREF    R     A  O  9 59REFFLD(STTREF STOKMOV1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            HRC03          9  0H
     A            HD0008    R        H      REFFLD(STCOYNO STOKMOV1)
     A                                      ALIAS(ALIAS00016)
     A            HTWHSE    R        H      REFFLD(STWHSE STOKMOV1)
     A                                      ALIAS(ALIAS00017)
     A            HD0009    R        H      REFFLD(STITEM STOKMOV1)
     A                                      ALIAS(ALIAS00018)
     A            HTDTTR    R        H      REFFLD(STDTTR STOKMOV1)
     A                                      ALIAS(ALIAS00019)
     A            INSAV1        99   H
     A          R SCR008C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR008S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR008S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(13)
     A                                      SFLSIZ(13)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCMOVE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SCMOVECYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 25 4 27)
     A                                      HLPPNLGRP(SCMOVEWHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 29 4 68)
     A                                      HLPPNLGRP(SCMOVEWHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(5 25 5 44)
     A                                      HLPPNLGRP(WDITEM -
     A                                      WAREDETH)
     A          H                           HLPARA(6 25 6 64)
     A                                      HLPPNLGRP(SCMOVEITIDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 25 7 34)
     A                                      HLPPNLGRP(SCMOVEWDOBAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 63 7 72)
     A                                      HLPPNLGRP(SCMOVEWDQOH -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 2 21 11)
     A                                      HLPPNLGRP(SCMOVEFL0023 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 15 21 24)
     A                                      HLPPNLGRP(SCMOVESTLOCN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 28 21 42)
     A                                      HLPPNLGRP(SCMOVEFL0024 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 46 21 55)
     A                                      HLPPNLGRP(SCMOVESTTQTY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 59 21 73)
     A                                      HLPPNLGRP(SCMOVESTTREF -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SCMOVE -
     A                                      MWAREHEDH)
     A                                 23  2'F1=Help  F3=Exit  F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN05          4S 0H      SFLRCDNBR
     A            XRN05          4S 0H
     A          R SCR009
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0009    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Warehouse Number  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  4 31REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  4 35REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  6  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 35'6=Items'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  9  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 10'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 22'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 64'Route'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR009S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0006         1  0B 10  4
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XLLOCN    R     A  O 10 10REFFLD(WLLOCN WARELOC)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XLDESC    R     A  O 10 22REFFLD(WLDESC WARELOC)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XLPCKR    R     A  O 10 64REFFLD(WLPCKR WARELOC)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC15          9  0H
     A            HD0021    R        H      REFFLD(WLCOYNO WARELOC)
     A                                      ALIAS(ALIAS00020)
     A            HLWHSE    R        H      REFFLD(WLWHSE WARELOC)
     A                                      ALIAS(ALIAS00021)
     A            HLLOCN    R        H      REFFLD(WLLOCN WARELOC)
     A                                      ALIAS(ALIAS00022)
     A            INSAV1        99   H
     A          R SCR009C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR009S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR009S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(10)
     A                                      SFLSIZ(10)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0009CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 31 4 33)
     A                                      HLPPNLGRP(SC0009WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 35 4 74)
     A                                      HLPPNLGRP(SC0009WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 4 19 4)
     A                                      HLPPNLGRP(SC0009FL0006 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 10 19 19)
     A                                      HLPPNLGRP(SC0009WLLOCN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 22 19 61)
     A                                      HLPPNLGRP(SC0009WLDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 64 19 68)
     A                                      HLPPNLGRP(SC0009WLPCKR -
     A                                      MWAREHEDH)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(SC0009PS0901 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MWAREHEDH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0901        10   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=C-
     A                                      ancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN06          4S 0H      SFLRCDNBR
     A            XRN06          4S 0H
     A          R SCR010
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0010CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 31 6 33)
     A                                      HLPPNLGRP(SC0010WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 35 6 74)
     A                                      HLPPNLGRP(SC0010WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 31 7 40)
     A                                      HLPPNLGRP(SC0010WLLOCN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(8 31 8 70)
     A                                      HLPPNLGRP(SC0010WLDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 31 9 35)
     A                                      HLPPNLGRP(SC0010WLPCKR -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 31 10 31)
     A                                      HLPPNLGRP(SC0010WLPCKA -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 31 11 31)
     A                                      HLPPNLGRP(SC0010WLPCKF -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 31 12 36)
     A                                      HLPPNLGRP(SC0010WLSIZE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 31 13 36)
     A                                      HLPPNLGRP(SC0010WLHITE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 31 14 45)
     A                                      HLPPNLGRP(SC0010WLWEIG -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 31 15 45)
     A                                      HLPPNLGRP(SC0010WLRSTN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(17 31 17 40)
     A                                      HLPPNLGRP(SC0010WLCRBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(18 31 18 40)
     A                                      HLPPNLGRP(SC0010FL0014 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(19 31 19 40)
     A                                      HLPPNLGRP(SC0010WLLMBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(20 31 20 40)
     A                                      HLPPNLGRP(SC0010FL0015 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MWAREHEDH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0010    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'Warehouse Number  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  6 31REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  6 35REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Location  . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLLOCN    R     A  B  7 31REFFLD(WLLOCN WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  07                                  DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  06                                  DSPATR(PR)
     A                                  8  2'Location Description  . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLDESC    R     A  B  8 31REFFLD(WLDESC WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                  9  2'Picking Route . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLPCKR    R     A  B  9 31REFFLD(WLPCKR WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 10  2'Picking Allowed Y/N . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLPCKA    R     A  B 10 31REFFLD(WLPCKA WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 11  2'Pick Face Y/N . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLPCKF    R     A  B 11 31REFFLD(WLPCKF WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 12  2'Size  . . . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLSIZE    R        B 12 31REFFLD(WLSIZE WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 13  2'Height  . . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLHITE    R        B 13 31REFFLD(WLHITE WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 14  2'Maximum weight  . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLWEIG    R        B 14 31REFFLD(WLWEIG WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 15  2'Restrictions  . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLRSTN    R     A  B 15 31REFFLD(WLRSTN WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 17  2'Created By  . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLCRBY    R     A  O 17 31REFFLD(WLCRBY WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 18  2'Created Date  . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0014        10   O 18 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 19  2'Last Maint User . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLLMBY    R     A  O 19 31REFFLD(WLLMBY WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 20  2'Date last maintained  . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0015        10   O 20 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F12=Cancel  F14=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR011
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0011    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Warehouse Number  . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  4 27REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  4 38REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  5  2'Location  . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLLOCN    R     A  O  5 27REFFLD(WLLOCN WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLDESC    R     A  O  5 38REFFLD(WLDESC WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 10  1'Act'
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                 10  5'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 26'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 57'Qty On hand'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 69'Qty Alloc'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR011S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0007         1  0B 11  2
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XIITEM    R     A  O 11  5REFFLD(WIITEM WLOCITM)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            FL0016        30   O 11 26
     A            XIQOH     R        O 11 57REFFLD(WIQOH WLOCITM)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            XIQAL     R        O 11 69REFFLD(WIQAL WLOCITM)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A            HRC17          9  0H
     A            HD0023    R        H      REFFLD(WICOYNO WLOCITM)
     A                                      ALIAS(ALIAS00023)
     A            HIWHSE    R        H      REFFLD(WIWHSE WLOCITM)
     A                                      ALIAS(ALIAS00024)
     A            HILOCN    R        H      REFFLD(WILOCN WLOCITM)
     A                                      ALIAS(ALIAS00025)
     A            HIITEM    R        H      REFFLD(WIITEM WLOCITM)
     A                                      ALIAS(ALIAS00026)
     A            INSAV1        99   H
     A          R SCR011C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR011S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR011S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(9)
     A                                      SFLSIZ(9)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0011 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0011CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 27 4 29)
     A                                      HLPPNLGRP(SC0011WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(4 38 4 77)
     A                                      HLPPNLGRP(SC0011WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(5 27 5 36)
     A                                      HLPPNLGRP(SC0011WLLOCN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(5 38 5 77)
     A                                      HLPPNLGRP(SC0011WLDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 2 19 2)
     A                                      HLPPNLGRP(SC0011FL0007 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 5 19 24)
     A                                      HLPPNLGRP(WIITEM -
     A                                      WLOCITMH)
     A          H                           HLPARA(11 26 19 55)
     A                                      HLPPNLGRP(SC0011FL0016 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 57 19 66)
     A                                      HLPPNLGRP(SC0011WIQOH -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 69 19 78)
     A                                      HLPPNLGRP(SC0011WIQAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(21 18 21 37)
     A                                      HLPPNLGRP(SC0011PS1101 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0011 -
     A                                      MWAREHEDH)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS1101        20   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F3=Exit  F6=Create  F12=C-
     A                                      ancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN07          4S 0H      SFLRCDNBR
     A            XRN07          4S 0H
     A          R SCR012
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0012 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0012CYDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 25 6 27)
     A                                      HLPPNLGRP(SC0012WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 29 6 68)
     A                                      HLPPNLGRP(SC0012WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 25 7 34)
     A                                      HLPPNLGRP(SC0012WLLOCN -
     A                                      MWAREHEDH)
     A          H                           HLPARA(7 36 7 75)
     A                                      HLPPNLGRP(SC0012WLDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(9 25 9 44)
     A                                      HLPPNLGRP(SC0012WIITEM -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 25 10 64)
     A                                      HLPPNLGRP(SC0012ITIDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 25 12 34)
     A                                      HLPPNLGRP(SC0012WIMINB -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 25 13 34)
     A                                      HLPPNLGRP(SC0012WIQOH -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 25 14 34)
     A                                      HLPPNLGRP(SC0012WIQAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 25 16 34)
     A                                      HLPPNLGRP(SC0012WICRBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(17 25 17 34)
     A                                      HLPPNLGRP(SC0012FL0017 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(18 25 18 34)
     A                                      HLPPNLGRP(SC0012WILMBY -
     A                                      MWAREHEDH)
     A          H                           HLPARA(19 25 19 34)
     A                                      HLPPNLGRP(SC0012FL0018 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0012 -
     A                                      MWAREHEDH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with Warehouse Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0012    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'Warehouse Number  . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  6 25REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0023    R     A  O  6 29REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Location  . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLLOCN    R     A  O  7 25REFFLD(WLLOCN WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XLDESC    R     A  O  7 36REFFLD(WLDESC WARELOC)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  9  2'Item Number . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XIITEM    R     A  B  9 25REFFLD(WIITEM WLOCITM)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  04                                  DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A  03                                  DSPATR(PR)
     A            WK0002    R     A  O 10 25REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                 12  2'Minimum Balance . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XIMINB    R        B 12 25REFFLD(WIMINB WLOCITM)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A  07                                  DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  06                                  DSPATR(PR)
     A                                 13  2'Quantity on hand  . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XIQOH     R        O 13 25REFFLD(WIQOH WLOCITM)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 14  2'Quantity Allocated  :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XIQAL     R        O 14 25REFFLD(WIQAL WLOCITM)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                 16  2'Created By  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XICRBY    R     A  O 16 25REFFLD(WICRBY WLOCITM)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 17  2'Created Date  . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0017        10   O 17 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 18  2'Amended By  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XILMBY    R     A  O 18 25REFFLD(WILMBY WLOCITM)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 19  2'Amended date  . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0018        10   O 19 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-
     A                                      4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR013
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Alpha Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0013 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 7 10 7)
     A                                      HLPPNLGRP(SC0013T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 10 10 29)
     A                                      HLPPNLGRP(SC0013T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 31 10 70)
     A                                      HLPPNLGRP(SC0013T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 7 11 7)
     A                                      HLPPNLGRP(SC0013T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 10 11 29)
     A                                      HLPPNLGRP(SC0013T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 31 11 70)
     A                                      HLPPNLGRP(SC0013T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 7 12 7)
     A                                      HLPPNLGRP(SC0013T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 10 12 29)
     A                                      HLPPNLGRP(SC0013T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 31 12 70)
     A                                      HLPPNLGRP(SC0013T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 7 13 7)
     A                                      HLPPNLGRP(SC0013T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 10 13 29)
     A                                      HLPPNLGRP(SC0013T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 31 13 70)
     A                                      HLPPNLGRP(SC0013T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 7 14 7)
     A                                      HLPPNLGRP(SC0013T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 10 14 29)
     A                                      HLPPNLGRP(SC0013T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 31 14 70)
     A                                      HLPPNLGRP(SC0013T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 23 16 42)
     A                                      HLPPNLGRP(SC0013FL0020 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 19 74)
     A                                      HLPPNLGRP(SC0013 -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                '
     A                                  4 22'        List of Items         '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 53'                    '
     A                                  4 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                        '
     A                                  5 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                            '
     A                                  6 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                            '
     A                                  7 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                        '
     A                                  8 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Act'
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                  9 10'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 22'        '
     A                                  9 31'Item Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 48'                         '
     A                                  9 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5' '
     A            T01001         1  0B 10  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A            T02001        20   O 10 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03001        40   O 10 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 72' '
     A                                 10 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5' '
     A            T01002         1  0B 11  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A            T02002        20   O 11 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03002        40   O 11 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 72' '
     A                                 11 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5' '
     A            T01003         1  0B 12  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A            T02003        20   O 12 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03003        40   O 12 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 72' '
     A                                 12 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5' '
     A            T01004         1  0B 13  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A            T02004        20   O 13 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03004        40   O 13 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 72' '
     A                                 13 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5' '
     A            T01005         1  0B 14  7
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A            T02005        20   O 14 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03005        40   O 14 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 72' '
     A                                 14 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                        '
     A                                 15 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'Position To . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0020        20   B 16 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 16 44'                             '
     A                                 16 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'                                  -
     A                                                                        '
     A                                 17 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  6'F12=Cancel  F18=Alpha Seq'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 32'                                  -
     A                                             '
     A                                 18 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR014
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0014 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0014T04 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 14 10 14)
     A                                      HLPPNLGRP(SC0014T05 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 25 10 64)
     A                                      HLPPNLGRP(SC0014T06 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0014T04 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 14 11 14)
     A                                      HLPPNLGRP(SC0014T05 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 25 11 64)
     A                                      HLPPNLGRP(SC0014T06 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0014T04 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 14 12 14)
     A                                      HLPPNLGRP(SC0014T05 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 25 12 64)
     A                                      HLPPNLGRP(SC0014T06 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0014T04 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 14 13 14)
     A                                      HLPPNLGRP(SC0014T05 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 25 13 64)
     A                                      HLPPNLGRP(SC0014T06 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0014T04 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 14 14 14)
     A                                      HLPPNLGRP(SC0014T05 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 25 14 64)
     A                                      HLPPNLGRP(SC0014T06 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 68)
     A                                      HLPPNLGRP(SC0014 -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                                                      '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'             '
     A                                  4 19'     List Turnover Groups     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 50'                 '
     A                                  4 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                  '
     A                                  5 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  '
     A                                  6 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                      '
     A                                  7 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                  '
     A                                  8 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Trnvr Grp'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 25'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 37'                              '
     A                                  9 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T04001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T05001         1   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 16'        '
     A            T06001        40   O 10 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 66' '
     A                                 10 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T04002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T05002         1   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 16'        '
     A            T06002        40   O 11 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 66' '
     A                                 11 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T04003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T05003         1   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 16'        '
     A            T06003        40   O 12 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 66' '
     A                                 12 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T04004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T05004         1   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 16'        '
     A            T06004        40   O 13 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 66' '
     A                                 13 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T04005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T05005         1   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 16'        '
     A            T06005        40   O 14 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 66' '
     A                                 14 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                  '
     A                                 15 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  5'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 16'                                  -
     A                                                       '
     A                                 16 68' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                      '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR015
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Alpha Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0015 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 14 10 19)
     A                                      HLPPNLGRP(SC0015T08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 21 10 23)
     A                                      HLPPNLGRP(SC0015T09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 26 10 65)
     A                                      HLPPNLGRP(SC0015T10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 14 11 19)
     A                                      HLPPNLGRP(SC0015T08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 21 11 23)
     A                                      HLPPNLGRP(SC0015T09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 26 11 65)
     A                                      HLPPNLGRP(SC0015T10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 14 12 19)
     A                                      HLPPNLGRP(SC0015T08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 21 12 23)
     A                                      HLPPNLGRP(SC0015T09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 26 12 65)
     A                                      HLPPNLGRP(SC0015T10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 14 13 19)
     A                                      HLPPNLGRP(SC0015T08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 21 13 23)
     A                                      HLPPNLGRP(SC0015T09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 26 13 65)
     A                                      HLPPNLGRP(SC0015T10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0015T07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 14 14 19)
     A                                      HLPPNLGRP(SC0015T08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 21 14 23)
     A                                      HLPPNLGRP(SC0015T09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 26 14 65)
     A                                      HLPPNLGRP(SC0015T10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 23 16 28)
     A                                      HLPPNLGRP(SC0015FL0021 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 30 16 32)
     A                                      HLPPNLGRP(SC0015FL0022 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 19 72)
     A                                      HLPPNLGRP(SC0015 -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'              '
     A                                  4 20'       List Suppliers         '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 51'                    '
     A                                  4 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                      '
     A                                  5 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                          '
     A                                  6 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                          '
     A                                  7 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                      '
     A                                  8 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Supplier'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 23'  '
     A                                  9 26'Name'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 31'                                  -
     A                                            '
     A                                  9 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T07001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T08001         6   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09001         3   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10001        40   O 10 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 67'    '
     A                                 10 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T07002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T08002         6   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09002         3   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10002        40   O 11 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 67'    '
     A                                 11 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T07003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T08003         6   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09003         3   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10003        40   O 12 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 67'    '
     A                                 12 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T07004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T08004         6   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09004         3   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10004        40   O 13 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 67'    '
     A                                 13 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T07005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T08005         6   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09005         3   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10005        40   O 14 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 67'    '
     A                                 14 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                      '
     A                                 15 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0021         6   B 16 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A            FL0022         3   B 16 30
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                 16 34'                                  -
     A                                         '
     A                                 16 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'                                  -
     A                                                                      '
     A                                 17 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  6'F12=Cancel  F18=Alpha Seq'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 32'                                  -
     A                                           '
     A                                 18 72' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                                  -
     A                                                                         -
     A                                       '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR016
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0016 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0016T11 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 14 10 18)
     A                                      HLPPNLGRP(SC0016T12 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 21 10 30)
     A                                      HLPPNLGRP(SC0016T13 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0016T11 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 14 11 18)
     A                                      HLPPNLGRP(SC0016T12 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 21 11 30)
     A                                      HLPPNLGRP(SC0016T13 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0016T11 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 14 12 18)
     A                                      HLPPNLGRP(SC0016T12 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 21 12 30)
     A                                      HLPPNLGRP(SC0016T13 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0016T11 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 14 13 18)
     A                                      HLPPNLGRP(SC0016T12 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 21 13 30)
     A                                      HLPPNLGRP(SC0016T13 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0016T11 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 14 14 18)
     A                                      HLPPNLGRP(SC0016T12 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 21 14 30)
     A                                      HLPPNLGRP(SC0016T13 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 41)
     A                                      HLPPNLGRP(SC0016 -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5' '
     A                                  4  7'     List Unit Of Measure     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 38'  '
     A                                  4 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                       '
     A                                  5 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'       '
     A                                  6 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                       '
     A                                  7 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                       '
     A                                  8 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'UOM'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 18'  '
     A                                  9 21'Qty/Unit '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 31'         '
     A                                  9 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T11001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T12001         5   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T13001         9  0B 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 10 32'        '
     A                                 10 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T11002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T12002         5   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T13002         9  0B 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 11 32'        '
     A                                 11 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T11003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T12003         5   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T13003         9  0B 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 12 32'        '
     A                                 12 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T11004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T12004         5   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T13004         9  0B 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 13 32'        '
     A                                 13 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T11005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T12005         5   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T13005         9  0B 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                 14 32'        '
     A                                 14 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                       '
     A                                 15 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                       '
     A                                 16 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR017
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0017 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0017T14 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 14 10 15)
     A                                      HLPPNLGRP(SC0017T15 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 20 10 59)
     A                                      HLPPNLGRP(SC0017T16 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0017T14 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 14 11 15)
     A                                      HLPPNLGRP(SC0017T15 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 20 11 59)
     A                                      HLPPNLGRP(SC0017T16 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0017T14 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 14 12 15)
     A                                      HLPPNLGRP(SC0017T15 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 20 12 59)
     A                                      HLPPNLGRP(SC0017T16 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0017T14 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 14 13 15)
     A                                      HLPPNLGRP(SC0017T15 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 20 13 59)
     A                                      HLPPNLGRP(SC0017T16 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0017T14 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 14 14 15)
     A                                      HLPPNLGRP(SC0017T15 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 20 14 59)
     A                                      HLPPNLGRP(SC0017T16 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 63)
     A                                      HLPPNLGRP(SC0017 -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'             '
     A                                  4 19'    List of Warehouse Types   '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 50'            '
     A                                  4 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                             '
     A                                  5 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                             '
     A                                  6 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                 '
     A                                  7 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                             '
     A                                  8 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Type'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 20'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 32'                              '
     A                                  9 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T14001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T15001         2   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 17'  '
     A            T16001        40   O 10 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 61' '
     A                                 10 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T14002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T15002         2   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 17'  '
     A            T16002        40   O 11 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 61' '
     A                                 11 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T14003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T15003         2   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 17'  '
     A            T16003        40   O 12 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 61' '
     A                                 12 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T14004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T15004         2   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 17'  '
     A            T16004        40   O 13 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 61' '
     A                                 13 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T14005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T15005         2   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 17'  '
     A            T16005        40   O 14 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 61' '
     A                                 14 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                             '
     A                                 15 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                 '
     A                                 16 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR018
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0018 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 23 6 25)
     A                                      HLPPNLGRP(SC0018WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 27 6 66)
     A                                      HLPPNLGRP(SC0018WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 6 12 6)
     A                                      HLPPNLGRP(SC0018T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 10 12 29)
     A                                      HLPPNLGRP(SC0018T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 31 12 70)
     A                                      HLPPNLGRP(SC0018T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 6 13 6)
     A                                      HLPPNLGRP(SC0018T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 10 13 29)
     A                                      HLPPNLGRP(SC0018T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 31 13 70)
     A                                      HLPPNLGRP(SC0018T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 6 14 6)
     A                                      HLPPNLGRP(SC0018T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 10 14 29)
     A                                      HLPPNLGRP(SC0018T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 31 14 70)
     A                                      HLPPNLGRP(SC0018T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 6 15 6)
     A                                      HLPPNLGRP(SC0018T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 10 15 29)
     A                                      HLPPNLGRP(SC0018T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(15 31 15 70)
     A                                      HLPPNLGRP(SC0018T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 6 16 6)
     A                                      HLPPNLGRP(SC0018T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 10 16 29)
     A                                      HLPPNLGRP(SC0018T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 31 16 70)
     A                                      HLPPNLGRP(SC0018T03 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 19 74)
     A                                      HLPPNLGRP(SC0018 -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                '
     A                                  4 22'List of Locations in Warehouse'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 53'                    '
     A                                  4 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                        '
     A                                  5 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Warehouse . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  6 23REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A            WK0023    R     A  O  6 27REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                  6 68'     '
     A                                  6 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'                                  -
     A                                                                        '
     A                                  7 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 33'                                  -
     A                                            '
     A                                  8 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  5'  '
     A                                  9  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  9 17'                                  -
     A                                                            '
     A                                  9 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'                                  -
     A                                                                        '
     A                                 10 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'Act'
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                 11 10'Location'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 11 19'           '
     A                                 11 31'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 11 43'                              '
     A                                 11 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01001         1  0B 12  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 12  8' '
     A            T02001        20   O 12 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03001        40   O 12 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 72' '
     A                                 12 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01002         1  0B 13  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 13  8' '
     A            T02002        20   O 13 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03002        40   O 13 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 72' '
     A                                 13 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01003         1  0B 14  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 14  8' '
     A            T02003        20   O 14 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03003        40   O 14 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 72' '
     A                                 14 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01004         1  0B 15  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 15  8' '
     A            T02004        20   O 15 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03004        40   O 15 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 15 72' '
     A                                 15 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01005         1  0B 16  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 16  8' '
     A            T02005        20   O 16 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03005        40   O 16 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 16 72' '
     A                                 16 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'                                  -
     A                                                                        '
     A                                 17 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 17'                                  -
     A                                                            '
     A                                 18 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR019
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0019 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 23 6 25)
     A                                      HLPPNLGRP(SC0019WHWHSE -
     A                                      MWAREHEDH)
     A          H                           HLPARA(6 27 6 66)
     A                                      HLPPNLGRP(SC0019WHWDESC -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 6 10 6)
     A                                      HLPPNLGRP(SC0019T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 10 10 29)
     A                                      HLPPNLGRP(SC0019T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 31 10 70)
     A                                      HLPPNLGRP(SC0019T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 6 11 6)
     A                                      HLPPNLGRP(SC0019T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 10 11 29)
     A                                      HLPPNLGRP(SC0019T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 31 11 70)
     A                                      HLPPNLGRP(SC0019T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 6 12 6)
     A                                      HLPPNLGRP(SC0019T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 10 12 29)
     A                                      HLPPNLGRP(SC0019T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 31 12 70)
     A                                      HLPPNLGRP(SC0019T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 6 13 6)
     A                                      HLPPNLGRP(SC0019T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 10 13 29)
     A                                      HLPPNLGRP(SC0019T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 31 13 70)
     A                                      HLPPNLGRP(SC0019T03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 6 14 6)
     A                                      HLPPNLGRP(SC0019T01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 10 14 29)
     A                                      HLPPNLGRP(SC0019T02 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 31 14 70)
     A                                      HLPPNLGRP(SC0019T03 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 74)
     A                                      HLPPNLGRP(SC0019 -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                     '
     A                                  4 27'  List of Items in Warehouse  '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 58'               '
     A                                  4 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                        '
     A                                  5 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Warehouse . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XHWHSE    R     A  O  6 23REFFLD(WHWHSE WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A            WK0023    R     A  O  6 27REFFLD(WHWDESC WAREHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                  6 68'     '
     A                                  6 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                            '
     A                                  7 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                        '
     A                                  8 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  5'Act'
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                  9 10'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 22'        '
     A                                  9 31'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 43'                              '
     A                                  9 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01001         1  0B 10  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10  8' '
     A            T02001        20   O 10 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03001        40   O 10 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 72' '
     A                                 10 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01002         1  0B 11  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11  8' '
     A            T02002        20   O 11 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03002        40   O 11 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 72' '
     A                                 11 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01003         1  0B 12  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12  8' '
     A            T02003        20   O 12 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03003        40   O 12 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 72' '
     A                                 12 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01004         1  0B 13  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13  8' '
     A            T02004        20   O 13 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03004        40   O 13 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 72' '
     A                                 13 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01005         1  0B 14  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14  8' '
     A            T02005        20   O 14 10
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03005        40   O 14 31
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 72' '
     A                                 14 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                        '
     A                                 15 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                            '
     A                                 16 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                         -
     A                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR020
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Number Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCIALP -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 4 10 4)
     A                                      HLPPNLGRP(SCIALPT01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 6 10 15)
     A                                      HLPPNLGRP(SCIALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 38 10 77)
     A                                      HLPPNLGRP(SCIALPT03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 4 11 4)
     A                                      HLPPNLGRP(SCIALPT01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 6 11 15)
     A                                      HLPPNLGRP(SCIALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 38 11 77)
     A                                      HLPPNLGRP(SCIALPT03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 4 12 4)
     A                                      HLPPNLGRP(SCIALPT01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 6 12 15)
     A                                      HLPPNLGRP(SCIALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 38 12 77)
     A                                      HLPPNLGRP(SCIALPT03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 4 13 4)
     A                                      HLPPNLGRP(SCIALPT01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 6 13 15)
     A                                      HLPPNLGRP(SCIALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 38 13 77)
     A                                      HLPPNLGRP(SCIALPT03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 4 14 4)
     A                                      HLPPNLGRP(SCIALPT01 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 6 14 15)
     A                                      HLPPNLGRP(SCIALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 38 14 77)
     A                                      HLPPNLGRP(SCIALPT03 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 23 16 32)
     A                                      HLPPNLGRP(SCIALPFL0019 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 1 19 79)
     A                                      HLPPNLGRP(SCIALP -
     A                                      MWAREHEDH)
     A                                  3  1'                                  -
     A                                                                         -
     A                                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3'                      '
     A                                  4 26'    List of Items in Alpha    '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 57'                     '
     A                                  4 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3'                                  -
     A                                                                         -
     A                                            '
     A                                  5 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                  6  5'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 32'                                  -
     A                                                  '
     A                                  6 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3'   '
     A                                  7  7'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 16'                                  -
     A                                                                  '
     A                                  7 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3'                                  -
     A                                                                         -
     A                                            '
     A                                  8 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3'Act'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9  8'Alpha'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'  '
     A                                  9 17'Item Number'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 29'        '
     A                                  9 38'Item Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 55'                       '
     A                                  9 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01001         1  0B 10  4
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A            TAL001        10   O 10  6
     A                                      OVRDTA
     A                                      OVRATR
     A            T02001        20   O 10 17
     A                                      OVRDTA
     A                                      OVRATR
     A            T03001        40   O 10 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01002         1  0B 11  4
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A            TAL002        10   O 11  6
     A                                      OVRDTA
     A                                      OVRATR
     A            T02002        20   O 11 17
     A                                      OVRDTA
     A                                      OVRATR
     A            T03002        40   O 11 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01003         1  0B 12  4
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A            TAL003        10   O 12  6
     A                                      OVRDTA
     A                                      OVRATR
     A            T02003        20   O 12 17
     A                                      OVRDTA
     A                                      OVRATR
     A            T03003        40   O 12 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01004         1  0B 13  4
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A            TAL004        10   O 13  6
     A                                      OVRDTA
     A                                      OVRATR
     A            T02004        20   O 13 17
     A                                      OVRDTA
     A                                      OVRATR
     A            T03004        40   O 13 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T01005         1  0B 14  4
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A            TAL005        10   O 14  6
     A                                      OVRDTA
     A                                      OVRATR
     A            T02005        20   O 14 17
     A                                      OVRDTA
     A                                      OVRATR
     A            T03005        40   O 14 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 15 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3'  '
     A                                 16  6'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0019        10   B 16 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 16 34'                                  -
     A                                                '
     A                                 16 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  1' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3'  '
     A                                 18  6'F12=Cancel  F18=Number Seq'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 33'                                  -
     A                                                 '
     A                                 18 79' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  1'                                  -
     A                                                                         -
     A                                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR021
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Number Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCSALP -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 6 10 6)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 9 10 18)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 21 10 26)
     A                                      HLPPNLGRP(SCSALPT08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 28 10 30)
     A                                      HLPPNLGRP(SCSALPT09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(10 32 10 71)
     A                                      HLPPNLGRP(SCSALPT10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 6 11 6)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 9 11 18)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 21 11 26)
     A                                      HLPPNLGRP(SCSALPT08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 28 11 30)
     A                                      HLPPNLGRP(SCSALPT09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(11 32 11 71)
     A                                      HLPPNLGRP(SCSALPT10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 6 12 6)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 9 12 18)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 21 12 26)
     A                                      HLPPNLGRP(SCSALPT08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 28 12 30)
     A                                      HLPPNLGRP(SCSALPT09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(12 32 12 71)
     A                                      HLPPNLGRP(SCSALPT10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 6 13 6)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 9 13 18)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 21 13 26)
     A                                      HLPPNLGRP(SCSALPT08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 28 13 30)
     A                                      HLPPNLGRP(SCSALPT09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(13 32 13 71)
     A                                      HLPPNLGRP(SCSALPT10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 6 14 6)
     A                                      HLPPNLGRP(SCSALPT07 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 9 14 18)
     A                                      HLPPNLGRP(SCSALPTAL -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 21 14 26)
     A                                      HLPPNLGRP(SCSALPT08 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 28 14 30)
     A                                      HLPPNLGRP(SCSALPT09 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(14 32 14 71)
     A                                      HLPPNLGRP(SCSALPT10 -
     A                                      MWAREHEDH)
     A          H                           HLPARA(16 23 16 32)
     A                                      HLPPNLGRP(SCSALPFL0019 -
     A                                      MWAREHEDH)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 19 73)
     A                                      HLPPNLGRP(SCSALP -
     A                                      MWAREHEDH)
     A                                  3  3'                                  -
     A                                                                         -
     A                                        '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'                    '
     A                                  4 26'    List Suppliers in Alpha   '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 57'               '
     A                                  4 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                       '
     A                                  5 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 32'                                  -
     A                                            '
     A                                  6 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5' '
     A                                  7  7'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 16'                                  -
     A                                                            '
     A                                  7 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                       '
     A                                  8 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  5'Act'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9  9'Alpha'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 15'     '
     A                                  9 21'Supplier'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 30' '
     A                                  9 32'Name'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 37'                                  -
     A                                       '
     A                                  9 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T07001         1  0B 10  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A            TAL001        10   O 10  9
     A                                      OVRDTA
     A                                      OVRATR
     A            T08001         6   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09001         3   O 10 28
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10001        40   O 10 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T07002         1  0B 11  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A            TAL002        10   O 11  9
     A                                      OVRDTA
     A                                      OVRATR
     A            T08002         6   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09002         3   O 11 28
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10002        40   O 11 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T07003         1  0B 12  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A            TAL003        10   O 12  9
     A                                      OVRDTA
     A                                      OVRATR
     A            T08003         6   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09003         3   O 12 28
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10003        40   O 12 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T07004         1  0B 13  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A            TAL004        10   O 13  9
     A                                      OVRDTA
     A                                      OVRATR
     A            T08004         6   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09004         3   O 13 28
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10004        40   O 13 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            T07005         1  0B 14  6
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A            TAL005        10   O 14  9
     A                                      OVRDTA
     A                                      OVRATR
     A            T08005         6   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T09005         3   O 14 28
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T10005        40   O 14 32
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                       '
     A                                 15 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0019        10   B 16 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                 16 34'                                  -
     A                                          '
     A                                 16 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'                                  -
     A                                                                       '
     A                                 17 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 17'                                  -
     A                                                           '
     A                                 18 73' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                                  -
     A                                                                         -
     A                                        '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A*********************************************************************
     A          R PSSR0001                  CLRL(*NO) OVERLAY
     A                                  1 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  2 15'PSSR0001'
     A                                  2 24'       Execution Error Handler    -
     A                                                ' DSPATR(HI)
     A                                  2 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 15'                                  -
     A                                                         '
     A                                  3 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 15'Job . . . . :'
     A            WSID          10A  O  4 29COLOR(WHT)
     A                                  4 40'  Program  . . :'
     A            PGM           10A  O  4 57COLOR(WHT)
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 15'User  . . . :'
     A            USER          10A  O  5 29COLOR(WHT)
     A                                  5 40'  Library  . . :'
     A            ULIB          10A  O  5 57COLOR(WHT)
     A                                  5 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 15'Number  . . :'
     A            UJOBN          6S 0O  6 29COLOR(WHT)
     A                                  6 36'      Compiled . . :'
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)  COLOR(WHT)
     A                                  6 66'  '
     A                                  6 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 15'Routine . . :'
     A            UROUTN         8A  O  7 29COLOR(WHT)
     A                                  7 38'                  '
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')  COLOR(WHT)
     A                                  7 66'  '
     A                                  7 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 15'Status Code :'
     A            USTAT4         4A  O  8 29COLOR(WHT)
     A                                  8 34'        Source Line. :'
     A            USRCLN         8A  O  8 57COLOR(WHT)
     A                                  8 66'  '
     A                                  8 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 15'Message ID  :'
     A            MSGID          7A  O  9 29COLOR(WHT)
     A                                  9 37'     File Name  . :'
     A            UFILE          8A  O  9 57COLOR(WHT)
     A                                  9 66'  '
     A                                  9 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 16'                                  -
     A                                                       '
     A                                 10 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 11 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)
     A                                 11 67' '
     A                                 11 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 12 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)
     A                                 12 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 13 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)
     A                                 13 46'                      '
     A                                 13 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 15'                                  -
     A                                                         '
     A                                 14 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 15'Select one of the following option-
     A                                      s. Then Enter.     '
     A                                 15 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 15'                                  -
     A                                                         '
     A                                 16 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 17 13' ' DSPATR(RI) COLOR(TRQ)
     A            UEROPT         1A  B 17 15DSPATR(UL) DSPATR(HI)
     A                                      VALUES('1' '2' '3')
     A                                 17 17' 1. Continue at the beginning of p-
     A                                      rogram           '
     A                                 17 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 15'   2. Cancel the processing of the-
     A                                       program           '
     A                                 18 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 15'   3. Return control to the system-
     A                                       error handler     '
     A                                 19 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 15'                                  -
     A                                                         '
     A                                 20 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 15'Enter                             -
     A                                                         '  DSPATR(HI)
     A                                 21 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 22 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A*********************************************************************
     A          R MSGRCD                    TEXT('MSG SFL RECORD')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGM                       SFLPGMQ
     A*********************************************************************
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ
     A N98                                  SFLEND
     A            PGM                       SFLPGMQ
     A*
