     A******************************************************************             A* Copyrigh
     A* Copyright   ** KDP Software Limited **    1996                               A**********
     A******************************************************************             A*
     A*                                                                              A*  DISPLAY
     A*  DISPLAY FILE ID     -    MNU010
     A*  DISPLAY FILE NAME   -      Maintain User Menu Details
     A*  DATE CREATED        -    Feb 8, 1996
     A*                                                                              A**********
     A******************************************************************             A**********
     A                                      PRINT                                    A**********
     A                                      ALTHELP(CA01)                            A**********
     A                                      CHGINPDFT                                A**********
     A                                      INDARA                                   A**********
     A                                      HLPTITLE(' ')                            A**********
     A                                      HELP                                     A**********
     A          R SCR001                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A  99                                  OVERLAY                                  A**********
     A            USER          10   O  1  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            WSID          10   O  1 13                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            ZZCOMP        30   O  1 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                  1 73DATE EDTCDE(Y)                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            PGM           10   O  2  2                                         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 26'  Maintain User Menu Details  '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 73TIME                                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  5  2'Type one or more action codes. The-     A**********
     A                                      n Enter.                           -     A**********
     A                                               '                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  6  4'2=Revise'                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  6 14'3=Copy'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  6 22'4=Delete'                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRATR                                   A**********
     A                                  6 32'5=Display'                              A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRATR                                   A**********
     A                                  6 43'6=Menus'                                A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRATR                                   A**********
     A                                  8  2'Action'                                 A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                      OVRATR                                   A**********
     A                                  8 10'User'                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                      OVRATR                                   A**********
     A                                  8 22'Surname'                                A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                      OVRATR                                   A**********
     A                                  8 44'User Group'                             A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                      OVRATR                                   A**********
     A          R SCR001S1                                                           A**********
     A                                      SFL                                      A**********
     A  65                                  SFLNXTCHG                                A**********
     A            FL0001         1  0B  9  2                                         A**********
     A  03                                  DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  01                                  DSPATR(PC)                               A**********
     A  01                                  DSPATR(RI)                               A**********
     A  04                                  DSPATR(ND)                               A**********
     A  02                                  DSPATR(PR)                               A**********
     A            XAUSER    R        O  9 10REFFLD(MAUSER MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XASURN    R        O  9 22REFFLD(MASURN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            WK0001    R        O  9 44REFFLD(MAGUSER MNUUSR)                   A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  05                                  DSPATR(PC)                               A**********
     A  05                                  DSPATR(RI)                               A**********
     A            HRC01          9  0H                                               A**********
     A            HAUSER    R        H      REFFLD(MAUSER MNUUSR)                    A**********
     A                                      ALIAS(ALIAS00001)                        A**********
     A            INSAV1        99   H                                               A**********
     A          R SCR001C1                                                           A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      SFLCTL(SCR001S1)                         A**********
     A  64                                  SFLDSP                                   A**********
     A  63                                  SFLDSPCTL                                A**********
     A N63                                  SFLCLR                                   A**********
     A  66                                  SFLINZ                                   A**********
     A N67                                  SFLEND                                   A**********
     A                                      OVERLAY                                  A**********
     A                                      SFLPAG(11)                               A**********
     A                                      SFLSIZ(11)                               A**********
     A                                      CF03 INDTXT(03 'Exit')                   A**********
     A                                      CF06 INDTXT(06 'Create')                 A**********
     A                                      CF07 INDTXT(07 'Bkwd')                   A**********
     A                                      CF08 INDTXT(08 'Fwd')                    A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      ROLLDOWN(62 'Bkwd')                      A**********
     A                                      ROLLUP(61 'Fwd')                         A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0001 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(1 26 1 55)                        A**********
     A                                      HLPPNLGRP(SC0001ZZCOMP -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(9 2 19 2)                         A**********
     A                                      HLPPNLGRP(SC0001FL0001 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(9 10 19 19)                       A**********
     A                                      HLPPNLGRP(SC0001MAUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(9 22 19 41)                       A**********
     A                                      HLPPNLGRP(SC0001MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(21 18 21 27)                      A**********
     A                                      HLPPNLGRP(SC0001PS0101 -                 A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(1 1 24 80)                        A**********
     A                                      HLPPNLGRP(SC0001 -                       A**********
     A                                      MNU010H)                                 A**********
     A                                 21  2'Position to . .'                        A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            PS0101        10   B 21 18                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                 23  2'Enter  F1=Help  F3=Exit  F6=Create-     A**********
     A                                        F7=Bkwd  F8=Fwd  F12=Cancel  '         A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A            RRN01          4S 0H      SFLRCDNBR                                A**********
     A            XRN01          4S 0H                                               A**********
     A          R SCR002                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      OVERLAY                                  A**********
     A                                      CF04 INDTXT(04 'Prompt')                 A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      CF14 INDTXT(14 'Delete')                 A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0002 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(1 26 1 55)                        A**********
     A                                      HLPPNLGRP(SC0002ZZCOMP -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(4 29 4 38)                        A**********
     A                                      HLPPNLGRP(SC0002MAUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(5 29 5 48)                        A**********
     A                                      HLPPNLGRP(SC0002MAFORN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(6 29 6 48)                        A**********
     A                                      HLPPNLGRP(SC0002MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(7 29 7 38)                        A**********
     A                                      HLPPNLGRP(SC0002MAGUSER -                A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(7 40 7 59)                        A**********
     A                                      HLPPNLGRP(SC0002MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(8 29 8 38)                        A**********
     A                                      HLPPNLGRP(SC0002MADFV1 -                 A**********
     A                                      SC0002)                                  A**********
     A          H                           HLPARA(9 29 9 38)                        A**********
     A                                      HLPPNLGRP(SC0002MADFV2 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 29 10 38)                      A**********
     A                                      HLPPNLGRP(SC0002MADFV3 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 29 11 29)                      A**********
     A                                      HLPPNLGRP(SC0002MACHG -                  A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(1 1 24 80)                        A**********
     A                                      HLPPNLGRP(SC0002 -                       A**********
     A                                      MNU010H)                                 A**********
     A            USER          10   O  1  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            WSID          10   O  1 13                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            ZZCOMP        30   O  1 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                  1 73DATE EDTCDE(Y)                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            PGM           10   O  2  2                                         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 26'  Maintain User Menu Details  '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 73TIME                                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  4  2'User  . . . . . . . . . .'              A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XAUSER    R        B  4 29REFFLD(MAUSER MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  09                                  DSPATR(PC)                               A**********
     A  09                                  DSPATR(RI)                               A**********
     A  10                                  DSPATR(PR)                               A**********
     A  03                                  DSPATR(UL)                               A**********
     A                                  5  2'Forename  . . . . . . . .'              A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XAFORN    R        B  5 29REFFLD(MAFORN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      CHECK(LC)                                A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                  6  2'Surname . . . . . . . . .'              A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRATR                                   A**********
     A            XASURN    R        B  6 29REFFLD(MASURN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                  7  2'Group User  . . . . . . .'              A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRATR                                   A**********
     A            WK0001    R        B  7 29REFFLD(MAGUSER MNUUSR)                   A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  04                                  DSPATR(PC)                               A**********
     A  04                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A            WK0002    R        O  7 40REFFLD(MASURN MNUUSR1)                   A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            FL0008        25   O  8  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            XADFV1    R        B  8 29REFFLD(MADFV1 MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  06                                  DSPATR(PC)                               A**********
     A  06                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A            FL0009        25   O  9  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            XADFV2    R        B  9 29REFFLD(MADFV2 MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  07                                  DSPATR(PC)                               A**********
     A  07                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A            FL0010        25   O 10  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            XADFV3    R        B 10 29REFFLD(MADFV3 MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  08                                  DSPATR(PC)                               A**********
     A  08                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 11  2'Allow F18 Selection . . .'              A**********
     A                                      OVRATR                                   A**********
     A            XACHG     R        B 11 29REFFLD(MACHG MNUUSR)                     A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  05                                  DSPATR(PC)                               A**********
     A  05                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-     A**********
     A                                      4=Delete'                                A**********
     A                                      COLOR(BLU)                               A**********
     A                                      OVRATR                                   A**********
     A          R SCR003                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      OVERLAY                                  A**********
     A            USER          10   O  1  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            WSID          10   O  1 13                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            ZZCOMP        30   O  1 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                  1 73DATE EDTCDE(Y)                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            PGM           10   O  2  2                                         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 26'  Maintain User Menu Details  '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 73TIME                                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  3  2'User  . . . :'                          A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XAUSER    R        O  3 17REFFLD(MAUSER MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  4  2'Surname . . :'                          A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XASURN    R        O  4 17REFFLD(MASURN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  6  2'Type one or more action codes. The-     A**********
     A                                      n Enter.                           -     A**********
     A                                               '                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7  4'2=Revise'                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7 14'4=Delete'                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7 24'5=Display'                              A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7 35'6=Options'                              A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7 46'7=Help'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  9  2'Action'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 10'Menu'                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 17'Menu Description'                       A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A          R SCR003S1                                                           A**********
     A                                      SFL                                      A**********
     A  65                                  SFLNXTCHG                                A**********
     A            FL0002         1  0B 10  2                                         A**********
     A  03                                  DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  01                                  DSPATR(PC)                               A**********
     A  01                                  DSPATR(RI)                               A**********
     A  04                                  DSPATR(ND)                               A**********
     A  02                                  DSPATR(PR)                               A**********
     A            XBMNUC    R        O 10 10REFFLD(MBMNUC MNUHED)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XBMNUD    R        O 10 17REFFLD(MBMNUD MNUHED)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            HRC04          9  0H                                               A**********
     A            HBUSER    R        H      REFFLD(MBUSER MNUHED)                    A**********
     A                                      ALIAS(ALIAS00002)                        A**********
     A            HBMNUC    R        H      REFFLD(MBMNUC MNUHED)                    A**********
     A                                      ALIAS(ALIAS00003)                        A**********
     A            INSAV1        99   H                                               A**********
     A          R SCR003C1                                                           A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      SFLCTL(SCR003S1)                         A**********
     A  64                                  SFLDSP                                   A**********
     A  63                                  SFLDSPCTL                                A**********
     A N63                                  SFLCLR                                   A**********
     A  66                                  SFLINZ                                   A**********
     A N67                                  SFLEND                                   A**********
     A                                      OVERLAY                                  A**********
     A                                      SFLPAG(10)                               A**********
     A                                      SFLSIZ(10)                               A**********
     A                                      CF03 INDTXT(03 'Exit')                   A**********
     A                                      CF06 INDTXT(06 'Create')                 A**********
     A                                      CF07 INDTXT(07 'Bkwd')                   A**********
     A                                      CF08 INDTXT(08 'Fwd')                    A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      ROLLDOWN(62 'Bkwd')                      A**********
     A                                      ROLLUP(61 'Fwd')                         A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0003 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(1 26 1 55)                        A**********
     A                                      HLPPNLGRP(SC0003ZZCOMP -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(3 17 3 26)                        A**********
     A                                      HLPPNLGRP(SC0003MAUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(4 17 4 36)                        A**********
     A                                      HLPPNLGRP(SC0003MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 2 19 2)                        A**********
     A                                      HLPPNLGRP(SC0003FL0002 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 10 19 14)                      A**********
     A                                      HLPPNLGRP(SC0003MBMNUC -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 17 19 46)                      A**********
     A                                      HLPPNLGRP(SC0003MBMNUD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(21 18 21 22)                      A**********
     A                                      HLPPNLGRP(SC0003PS0301 -                 A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(1 1 24 80)                        A**********
     A                                      HLPPNLGRP(SC0003 -                       A**********
     A                                      MNU010H)                                 A**********
     A                                 21  2'Position to . .'                        A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            PS0301         5   B 21 18                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                 23  2'Enter  F1=Help  F3=Exit  F6=Create-     A**********
     A                                        F7=Bkwd  F8=Fwd  F12=Cancel  '         A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A            RRN02          4S 0H      SFLRCDNBR                                A**********
     A            XRN02          4S 0H                                               A**********
     A          R SCR004                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      OVERLAY                                  A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      CF14 INDTXT(14 'Delete')                 A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0004 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(1 26 1 55)                        A**********
     A                                      HLPPNLGRP(SC0004ZZCOMP -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(4 26 4 35)                        A**********
     A                                      HLPPNLGRP(SC0004MAUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(5 26 5 45)                        A**********
     A                                      HLPPNLGRP(SC0004MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(6 26 6 30)                        A**********
     A                                      HLPPNLGRP(SC0004MBMNUC -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(7 26 7 55)                        A**********
     A                                      HLPPNLGRP(SC0004MBMNUD -                 A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(1 1 24 80)                        A**********
     A                                      HLPPNLGRP(SC0004 -                       A**********
     A                                      MNU010H)                                 A**********
     A            USER          10   O  1  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            WSID          10   O  1 13                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            ZZCOMP        30   O  1 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                  1 73DATE EDTCDE(Y)                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            PGM           10   O  2  2                                         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 26'  Maintain User Menu Details  '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 73TIME                                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  4  2'User . . . . . . . . :'                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XAUSER    R        O  4 26REFFLD(MAUSER MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  5  2'Surname  . . . . . . :'                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XASURN    R        O  5 26REFFLD(MASURN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  6  2'Menu . . . . . . . . .'                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XBMNUC    R        B  6 26REFFLD(MBMNUC MNUHED)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  03                                  DSPATR(PC)                               A**********
     A  03                                  DSPATR(RI)                               A**********
     A  04                                  DSPATR(PR)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A                                  7  2'Menu Description . . .'                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XBMNUD    R        B  7 26REFFLD(MBMNUD MNUHED)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A  05                                  DSPATR(PC)                               A**********
     A  05                                  DSPATR(RI)                               A**********
     A  06                                  DSPATR(PR)                               A**********
     A  01                                  DSPATR(UL)                               A**********
     A                                 23  2'F1=Help  F12=Cancel  F14=Delete'        A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A          R SCR005                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      OVERLAY                                  A**********
     A            USER          10   O  1  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            WSID          10   O  1 13                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            ZZCOMP        30   O  1 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                  1 73DATE EDTCDE(Y)                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            PGM           10   O  2  2                                         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 26'  Maintain User Menu Details  '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 73TIME                                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  3  2'User . . . . . . . . :'                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XAUSER    R        O  3 26REFFLD(MAUSER MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  4  2'Surname  . . . . . . :'                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XASURN    R        O  4 26REFFLD(MASURN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  5  2'Menu Description . . :'                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XBMNUD    R        O  5 26REFFLD(MBMNUD MNUHED)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7  2'Type one or more action codes. The-     A**********
     A                                      n Enter.                           -     A**********
     A                                               '                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  8  4'2=Revise'                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  8 14'4=Delete'                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  8 24'5=Display'                              A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  8 35'6=Help'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 10  2'Action'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                 10 10'Option'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                 10 18'Option Description'                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A          R SCR005S1                                                           A**********
     A                                      SFL                                      A**********
     A  65                                  SFLNXTCHG                                A**********
     A            FL0003         1  0B 11  2                                         A**********
     A  03                                  DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  01                                  DSPATR(PC)                               A**********
     A  01                                  DSPATR(RI)                               A**********
     A  04                                  DSPATR(ND)                               A**********
     A  02                                  DSPATR(PR)                               A**********
     A            XCOPTC    R        O 11 10REFFLD(MCOPTC MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCOPTD    R        O 11 18REFFLD(MCOPTD MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            HRC05          9  0H                                               A**********
     A            HCUSER    R        H      REFFLD(MCUSER MNUOPT)                    A**********
     A                                      ALIAS(ALIAS00004)                        A**********
     A            HCMNUC    R        H      REFFLD(MCMNUC MNUOPT)                    A**********
     A                                      ALIAS(ALIAS00005)                        A**********
     A            HCOPTC    R        H      REFFLD(MCOPTC MNUOPT)                    A**********
     A                                      ALIAS(ALIAS00006)                        A**********
     A            INSAV1        99   H                                               A**********
     A          R SCR005C1                                                           A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      SFLCTL(SCR005S1)                         A**********
     A  64                                  SFLDSP                                   A**********
     A  63                                  SFLDSPCTL                                A**********
     A N63                                  SFLCLR                                   A**********
     A  66                                  SFLINZ                                   A**********
     A N67                                  SFLEND                                   A**********
     A                                      OVERLAY                                  A**********
     A                                      SFLPAG(9)                                A**********
     A                                      SFLSIZ(9)                                A**********
     A                                      CF03 INDTXT(03 'Exit')                   A**********
     A                                      CF06 INDTXT(06 'Create')                 A**********
     A                                      CF07 INDTXT(07 'Bkwd')                   A**********
     A                                      CF08 INDTXT(08 'Fwd')                    A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      ROLLDOWN(62 'Bkwd')                      A**********
     A                                      ROLLUP(61 'Fwd')                         A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0005 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(1 26 1 55)                        A**********
     A                                      HLPPNLGRP(SC0005ZZCOMP -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(3 26 3 35)                        A**********
     A                                      HLPPNLGRP(SC0005MAUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(4 26 4 45)                        A**********
     A                                      HLPPNLGRP(SC0005MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(5 26 5 55)                        A**********
     A                                      HLPPNLGRP(SC0005MBMNUD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 2 19 2)                        A**********
     A                                      HLPPNLGRP(SC0005FL0003 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 10 19 14)                      A**********
     A                                      HLPPNLGRP(SC0005MCOPTC -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 18 19 47)                      A**********
     A                                      HLPPNLGRP(SC0005MCOPTD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(21 18 21 22)                      A**********
     A                                      HLPPNLGRP(SC0005PS0501 -                 A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(1 1 24 80)                        A**********
     A                                      HLPPNLGRP(SC0005 -                       A**********
     A                                      MNU010H)                                 A**********
     A                                 21  2'Position to . .'                        A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            PS0501         5   B 21 18                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                 23  2'Enter  F1=Help  F3=Exit  F6=Create-     A**********
     A                                        F7=Bkwd  F8=Fwd  F12=Cancel  '         A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A            RRN03          4S 0H      SFLRCDNBR                                A**********
     A            XRN03          4S 0H                                               A**********
     A          R SCR006                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      OVERLAY                                  A**********
     A                                      CF04 INDTXT(04 'Prompt')                 A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      CF14 INDTXT(14 'Delete')                 A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0006 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(1 26 1 55)                        A**********
     A                                      HLPPNLGRP(SC0006ZZCOMP -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(4 28 4 37)                        A**********
     A                                      HLPPNLGRP(SC0006MAUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(5 28 5 47)                        A**********
     A                                      HLPPNLGRP(SC0006MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(6 28 6 57)                        A**********
     A                                      HLPPNLGRP(SC0006MBMNUD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(7 28 7 32)                        A**********
     A                                      HLPPNLGRP(SC0006MCOPTC -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(8 28 8 57)                        A**********
     A                                      HLPPNLGRP(SC0006MCOPTD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(9 28 9 37)                        A**********
     A                                      HLPPNLGRP(SC0006MCPGMN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 28 10 37)                      A**********
     A                                      HLPPNLGRP(SC0006MCSPGM -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 28 11 47)                      A**********
     A                                      HLPPNLGRP(SC0006MCPRM1 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 28 12 47)                      A**********
     A                                      HLPPNLGRP(SC0006MCPRM2 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 28 13 47)                      A**********
     A                                      HLPPNLGRP(SC0006MCPRM3 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 28 14 47)                      A**********
     A                                      HLPPNLGRP(SC0006MCPRM4 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(15 28 15 28)                      A**********
     A                                      HLPPNLGRP(SC0006MCACTA -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(16 28 16 28)                      A**********
     A                                      HLPPNLGRP(SC0006MCACTR -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(17 28 17 28)                      A**********
     A                                      HLPPNLGRP(SC0006MCACTD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(19 28 19 28)                      A**********
     A                                      HLPPNLGRP(SC0006MCPGMT -                 A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(1 1 24 80)                        A**********
     A                                      HLPPNLGRP(SC0006 -                       A**********
     A                                      MNU010H)                                 A**********
     A            USER          10   O  1  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            WSID          10   O  1 13                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            ZZCOMP        30   O  1 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                  1 73DATE EDTCDE(Y)                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            PGM           10   O  2  2                                         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 26'  Maintain User Menu Details  '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 73TIME                                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  4  2'User . . . . . . . . . :'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XAUSER    R        O  4 28REFFLD(MAUSER MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  5  2'Surname  . . . . . . . :'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XASURN    R        O  5 28REFFLD(MASURN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  6  2'Menu Description . . . :'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XBMNUD    R        O  6 28REFFLD(MBMNUD MNUHED)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7  2'Option . . . . . . . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCOPTC    R        B  7 28REFFLD(MCOPTC MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  08                                  DSPATR(PC)                               A**********
     A  08                                  DSPATR(RI)                               A**********
     A  04                                  DSPATR(UL)                               A**********
     A  03                                  DSPATR(PR)                               A**********
     A                                  8  2'Option Description . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCOPTD    R        B  8 28REFFLD(MCOPTD MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A  09                                  DSPATR(PC)                               A**********
     A  09                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                  9  2'Program Name . . . . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCPGMN    R        B  9 28REFFLD(MCPGMN MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  10                                  DSPATR(PC)                               A**********
     A  10                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 10  2'Secondary Program  . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCSPGM    R        B 10 28REFFLD(MCSPGM MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  12                                  DSPATR(PC)                               A**********
     A  12                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 11  2'Parameters . . . . . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCPRM1    R        B 11 28REFFLD(MCPRM1 MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A            XCPRM2    R        B 12 28REFFLD(MCPRM2 MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A            XCPRM3    R        B 13 28REFFLD(MCPRM3 MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A            XCPRM4    R        B 14 28REFFLD(MCPRM4 MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 15  2'Create Allowed . . . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCACTA    R        B 15 28REFFLD(MCACTA MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  05                                  DSPATR(PC)                               A**********
     A  05                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 16  2'Update Allowed . . . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCACTR    R        B 16 28REFFLD(MCACTR MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  07                                  DSPATR(PC)                               A**********
     A  07                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 17  2'Delete Allowed . . . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCACTD    R        B 17 28REFFLD(MCACTD MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  06                                  DSPATR(PC)                               A**********
     A  06                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 19  2'Program Type . . . . . .'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCPGMT    R        B 19 28REFFLD(MCPGMT MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  11                                  DSPATR(PC)                               A**********
     A  11                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-     A**********
     A                                      4=Delete'                                A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A          R SCR007                    CSRLOC(LIN POS)                          A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      OVERLAY                                  A**********
     A            USER          10   O  1  2                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            WSID          10   O  1 13                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            ZZCOMP        30   O  1 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                  1 73DATE EDTCDE(Y)                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A            PGM           10   O  2  2                                         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 26'  Maintain User Menu Details  '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  2 73TIME                                     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  3  2'User . . . . . . . . . :'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XAUSER    R        O  3 28REFFLD(MAUSER MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  4  2'Surname  . . . . . . . :'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XASURN    R        O  4 28REFFLD(MASURN MNUUSR)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  5  2'Menu Description . . . :'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XBMNUD    R        O  5 28REFFLD(MBMNUD MNUHED)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  6  2'Option Description . . :'               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            XCOPTD    R        O  6 28REFFLD(MCOPTD MNUOPT)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  8  2'Type one or more action codes. The-     A**********
     A                                      n Enter.                           -     A**********
     A                                               '                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  04                                  DSPATR(ND)                               A**********
     A                                  9  2'4=Delete'                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  04                                  DSPATR(ND)                               A**********
     A                                 11  2'Action'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A  04                                  DSPATR(ND)                               A**********
     A                                 11 10'Seq'                                    A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                 11 17'Text'                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A            LIN            3  0H                                               A**********
     A            POS            3  0H                                               A**********
     A          R SCR007S1                                                           A**********
     A                                      SFL                                      A**********
     A  65                                  SFLNXTCHG                                A**********
     A            XDOPTC    R        H      REFFLD(MDOPTC MNUHLP)                    A**********
     A            XDMNUC    R        H      REFFLD(MDMNUC MNUHLP)                    A**********
     A            FL0004         1  0B 12  2                                         A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  03                                  DSPATR(UL)                               A**********
     A  01                                  DSPATR(PC)                               A**********
     A  01                                  DSPATR(RI)                               A**********
     A  02                                  DSPATR(PR)                               A**********
     A            XDSEQN    R        B 12 10REFFLD(MDSEQN MNUHLP)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  06                                  DSPATR(UL)                               A**********
     A  05                                  DSPATR(PR)                               A**********
     A            XDTEXT    R        B 12 17REFFLD(MDTEXT MNUHLP)                    A**********
     A                                      DLTEDT                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                      CHECK(LC)                                A**********
     A  08                                  DSPATR(UL)                               A**********
     A  07                                  DSPATR(PR)                               A**********
     A            HRC07          9  0H                                               A**********
     A            HDMNUC    R        H      REFFLD(MDMNUC MNUHLP)                    A**********
     A                                      ALIAS(ALIAS00007)                        A**********
     A            HDOPTC    R        H      REFFLD(MDOPTC MNUHLP)                    A**********
     A                                      ALIAS(ALIAS00008)                        A**********
     A            HDSEQN    R        H      REFFLD(MDSEQN MNUHLP)                    A**********
     A                                      ALIAS(ALIAS00009)                        A**********
     A            INSAV1        99   H                                               A**********
     A          R SCR007C1                  CSRLOC(LIN POS)                          A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      SFLCTL(SCR007S1)                         A**********
     A  64                                  SFLDSP                                   A**********
     A  63                                  SFLDSPCTL                                A**********
     A N63                                  SFLCLR                                   A**********
     A  66                                  SFLINZ                                   A**********
     A N67                                  SFLEND                                   A**********
     A                                      OVERLAY                                  A**********
     A                                      SFLPAG(8)                                A**********
     A                                      SFLSIZ(8)                                A**********
     A                                      CF03 INDTXT(03 'Exit')                   A**********
     A                                      CF07 INDTXT(07 'Bkwd')                   A**********
     A                                      CF08 INDTXT(08 'Fwd')                    A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      CF14 INDTXT(14 'Allow Delt')             A**********
     A                                      CF18 INDTXT(18 'Add/Insert')             A**********
     A                                      ROLLDOWN(62 'Bkwd')                      A**********
     A                                      ROLLUP(61 'Fwd')                         A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0007 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(1 26 1 55)                        A**********
     A                                      HLPPNLGRP(SC0007ZZCOMP -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(3 28 3 37)                        A**********
     A                                      HLPPNLGRP(SC0007MAUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(4 28 4 47)                        A**********
     A                                      HLPPNLGRP(SC0007MASURN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(5 28 5 57)                        A**********
     A                                      HLPPNLGRP(SC0007MBMNUD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(6 28 6 57)                        A**********
     A                                      HLPPNLGRP(SC0007MCOPTD -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 2 19 2)                        A**********
     A                                      HLPPNLGRP(SC0007FL0004 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 10 19 14)                      A**********
     A                                      HLPPNLGRP(SC0007MDSEQN -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 17 19 76)                      A**********
     A                                      HLPPNLGRP(SC0007MDTEXT -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(21 18 21 23)                      A**********
     A                                      HLPPNLGRP(SC0007PS0701 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(23 67 23 76)                      A**********
     A                                      HLPPNLGRP(SC0007F18 -                    A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(1 1 24 80)                        A**********
     A                                      HLPPNLGRP(SC0007 -                       A**********
     A                                      MNU010H)                                 A**********
     A                                 21  2'Position to . .'                        A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            PS0701         5  0B 21 18                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                 23  2'F1=Help'                                A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 23 11'F3=Exit'                                A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 23 20'F12=Cancel'                             A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 23 32'F7=Bkwd'                                A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 23 41'F8=Fwd'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 23 49'F14=Allow Delete'                       A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A            F18           10   O 23 67                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A            LIN            3  0H                                               A**********
     A            POS            3  0H                                               A**********
     A            RRN04          4S 0H      SFLRCDNBR                                A**********
     A            XRN04          4S 0H                                               A**********
     A          R SCR008                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      PROTECT                                  A**********
     A                                      OVERLAY                                  A**********
     A                                      CLRL(*NO)                                A**********
     A                                      CF07 INDTXT(07 'Bkwd')                   A**********
     A                                      CF08 INDTXT(08 'Fwd')                    A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      ROLLDOWN(62 'Bkwd')                      A**********
     A                                      ROLLUP(61 'Fwd')                         A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0008 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 6 10 6)                        A**********
     A                                      HLPPNLGRP(SC0008T01 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 14 10 23)                      A**********
     A                                      HLPPNLGRP(SC0008T02 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 26 10 45)                      A**********
     A                                      HLPPNLGRP(SC0008T03 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 6 11 6)                        A**********
     A                                      HLPPNLGRP(SC0008T01 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 14 11 23)                      A**********
     A                                      HLPPNLGRP(SC0008T02 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 26 11 45)                      A**********
     A                                      HLPPNLGRP(SC0008T03 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 6 12 6)                        A**********
     A                                      HLPPNLGRP(SC0008T01 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 14 12 23)                      A**********
     A                                      HLPPNLGRP(SC0008T02 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 26 12 45)                      A**********
     A                                      HLPPNLGRP(SC0008T03 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 6 13 6)                        A**********
     A                                      HLPPNLGRP(SC0008T01 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 14 13 23)                      A**********
     A                                      HLPPNLGRP(SC0008T02 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 26 13 45)                      A**********
     A                                      HLPPNLGRP(SC0008T03 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 6 14 6)                        A**********
     A                                      HLPPNLGRP(SC0008T01 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 14 14 23)                      A**********
     A                                      HLPPNLGRP(SC0008T02 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 26 14 45)                      A**********
     A                                      HLPPNLGRP(SC0008T03 -                    A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(3 3 17 49)                        A**********
     A                                      HLPPNLGRP(SC0008 -                       A**********
     A                                      MNU010H)                                 A**********
     A                                  3  3'                                  -     A**********
     A                                                   '                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  4  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  4  6'List of Users                 '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  4 37'           '                            A**********
     A                                  4 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  5  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  5  5'                                  -     A**********
     A                                               '                               A**********
     A                                  5 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  6  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  6  5'                                  -     A**********
     A                                               '                               A**********
     A                                  6 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  7  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  7  6'Type ''1'' to Select.'                  A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7 26'                      '                 A**********
     A                                  7 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  8  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  8  5'                                  -     A**********
     A                                               '                               A**********
     A                                  8 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  9  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  9  6'Action'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 14'User'                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 19'      '                                 A**********
     A                                  9 26'Surname'                                A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 34'              '                         A**********
     A                                  9 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 10  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T01001         1  0B 10  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  80                                  DSPATR(PC)                               A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  02                                  DSPATR(ND)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 10  8'     '                                  A**********
     A            T02001        10   O 10 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T03001        20   O 10 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 10 47' '                                      A**********
     A                                 10 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 11  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T01002         1  0B 11  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  80                                  DSPATR(PC)                               A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  04                                  DSPATR(ND)                               A**********
     A  03                                  DSPATR(PR)                               A**********
     A                                 11  8'     '                                  A**********
     A            T02002        10   O 11 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T03002        20   O 11 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 11 47' '                                      A**********
     A                                 11 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 12  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T01003         1  0B 12  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  80                                  DSPATR(PC)                               A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  06                                  DSPATR(ND)                               A**********
     A  05                                  DSPATR(PR)                               A**********
     A                                 12  8'     '                                  A**********
     A            T02003        10   O 12 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T03003        20   O 12 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 12 47' '                                      A**********
     A                                 12 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 13  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T01004         1  0B 13  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  80                                  DSPATR(PC)                               A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  08                                  DSPATR(ND)                               A**********
     A  07                                  DSPATR(PR)                               A**********
     A                                 13  8'     '                                  A**********
     A            T02004        10   O 13 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T03004        20   O 13 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 13 47' '                                      A**********
     A                                 13 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 14  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T01005         1  0B 14  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  80                                  DSPATR(PC)                               A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  10                                  DSPATR(ND)                               A**********
     A  09                                  DSPATR(PR)                               A**********
     A                                 14  8'     '                                  A**********
     A            T02005        10   O 14 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T03005        20   O 14 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 14 47' '                                      A**********
     A                                 14 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 15  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 15  5'                                  -     A**********
     A                                               '                               A**********
     A                                 15 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 16  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 16  6'Enter  F7=Bkwd  F8=Fwd  F12=Cancel'     A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 16 41'       '                                A**********
     A                                 16 49' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 17  3'                                  -     A**********
     A                                                   '                           A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A          R SCR009                                                             A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      PROTECT                                  A**********
     A                                      OVERLAY                                  A**********
     A                                      CLRL(*NO)                                A**********
     A                                      CF07 INDTXT(07 'Bkwd')                   A**********
     A                                      CF08 INDTXT(08 'Fwd')                    A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      ROLLDOWN(62 'Bkwd')                      A**********
     A                                      ROLLUP(61 'Fwd')                         A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0010 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 6 10 6)                        A**********
     A                                      HLPPNLGRP(SC0010T04 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 14 10 23)                      A**********
     A                                      HLPPNLGRP(SC0010T05 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 26 10 35)                      A**********
     A                                      HLPPNLGRP(SC0010T07 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(10 38 10 67)                      A**********
     A                                      HLPPNLGRP(SC0010T06 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 6 11 6)                        A**********
     A                                      HLPPNLGRP(SC0010T04 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 14 11 23)                      A**********
     A                                      HLPPNLGRP(SC0010T05 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 26 11 35)                      A**********
     A                                      HLPPNLGRP(SC0010T07 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(11 38 11 67)                      A**********
     A                                      HLPPNLGRP(SC0010T06 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 6 12 6)                        A**********
     A                                      HLPPNLGRP(SC0010T04 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 14 12 23)                      A**********
     A                                      HLPPNLGRP(SC0010T05 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 26 12 35)                      A**********
     A                                      HLPPNLGRP(SC0010T07 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(12 38 12 67)                      A**********
     A                                      HLPPNLGRP(SC0010T06 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 6 13 6)                        A**********
     A                                      HLPPNLGRP(SC0010T04 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 14 13 23)                      A**********
     A                                      HLPPNLGRP(SC0010T05 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 26 13 35)                      A**********
     A                                      HLPPNLGRP(SC0010T07 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(13 38 13 67)                      A**********
     A                                      HLPPNLGRP(SC0010T06 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 6 14 6)                        A**********
     A                                      HLPPNLGRP(SC0010T04 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 14 14 23)                      A**********
     A                                      HLPPNLGRP(SC0010T05 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 26 14 35)                      A**********
     A                                      HLPPNLGRP(SC0010T07 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 38 14 67)                      A**********
     A                                      HLPPNLGRP(SC0010T06 -                    A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(15 14 15 23)                      A**********
     A                                      HLPPNLGRP(SC0010FL0006 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(15 25 15 34)                      A**********
     A                                      HLPPNLGRP(SC0010FL0007 -                 A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(3 3 17 71)                        A**********
     A                                      HLPPNLGRP(SC0010 -                       A**********
     A                                      MNU010H)                                 A**********
     A                                  3  3'                                  -     A**********
     A                                                                         '     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  4  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  4  6'List of Programs              '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                  4 37'                                 '      A**********
     A                                  4 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  5  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  5  5'                                  -     A**********
     A                                                                     '         A**********
     A                                  5 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  6  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  6  5'                                  -     A**********
     A                                                                     '         A**********
     A                                  6 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  7  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  7  6'Type ''1'' to Select.'                  A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                  7 26'                                  -     A**********
     A                                                '                              A**********
     A                                  7 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  8  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  8  5'                    '                   A**********
     A                                  8 26'Secondary'                              A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  8 36'                                  '     A**********
     A                                  8 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  9  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                  9  6'Action'                                 A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 14'Program'                                A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 22'   '                                    A**********
     A                                  9 26'Program'                                A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 34'   '                                    A**********
     A                                  9 38'Description'                            A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(WHT)                               A**********
     A                                  9 50'                    '                   A**********
     A                                  9 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 10  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T04001         1  0B 10  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  02                                  DSPATR(ND)                               A**********
     A  01                                  DSPATR(PR)                               A**********
     A                                 10  8'     '                                  A**********
     A            T05001        10   O 10 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T07001        10   O 10 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            T06001        30   O 10 38                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 10 69' '                                      A**********
     A                                 10 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 11  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T04002         1  0B 11  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  04                                  DSPATR(ND)                               A**********
     A  03                                  DSPATR(PR)                               A**********
     A                                 11  8'     '                                  A**********
     A            T05002        10   O 11 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T07002        10   O 11 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            T06002        30   O 11 38                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 11 69' '                                      A**********
     A                                 11 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 12  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T04003         1  0B 12  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  06                                  DSPATR(ND)                               A**********
     A  05                                  DSPATR(PR)                               A**********
     A                                 12  8'     '                                  A**********
     A            T05003        10   O 12 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T07003        10   O 12 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            T06003        30   O 12 38                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 12 69' '                                      A**********
     A                                 12 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 13  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T04004         1  0B 13  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  08                                  DSPATR(ND)                               A**********
     A  07                                  DSPATR(PR)                               A**********
     A                                 13  8'     '                                  A**********
     A            T05004        10   O 13 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T07004        10   O 13 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            T06004        30   O 13 38                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 13 69' '                                      A**********
     A                                 13 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 14  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            T04005         1  0B 14  6                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                      EDTCDE(Z)                                A**********
     A  10                                  DSPATR(ND)                               A**********
     A  09                                  DSPATR(PR)                               A**********
     A                                 14  8'     '                                  A**********
     A            T05005        10   O 14 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            T07005        10   O 14 26                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A            T06005        30   O 14 38                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 14 69' '                                      A**********
     A                                 14 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 15  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 15  5'Position'                               A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            FL0006        10   B 15 14                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A            FL0007        10   B 15 25                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A                                 15 36'                                  '     A**********
     A                                 15 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 16  3' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 16  6'Enter  F7=Bkwd  F8=Fwd  F12=Cancel'     A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 16 41'                             '          A**********
     A                                 16 71' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 17  3'                                  -     A**********
     A                                                                         '     A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A          R SCR010                    CSRLOC(LIN POS)                          A**********
     A N79                                  PUTOVR                                   A**********
     A                                      SETOFF(79)                               A**********
     A                                      PROTECT                                  A**********
     A                                      OVERLAY                                  A**********
     A                                      CLRL(*NO)                                A**********
     A                                      CF04 INDTXT(04 'Prompt')                 A**********
     A                                      CF12 INDTXT(12 'Cancel')                 A**********
     A                                      HLPCLR                                   A**********
     A          H                           HLPARA(*NONE)                            A**********
     A                                      HLPPNLGRP(SC0009 -                       A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(14 58 14 67)                      A**********
     A                                      HLPPNLGRP(SC0009FL0005 -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(16 58 16 58)                      A**********
     A                                      HLPPNLGRP(SC0009CPYMNU -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(17 58 17 58)                      A**********
     A                                      HLPPNLGRP(SC0009CPYOPT -                 A**********
     A                                      MNU010H)                                 A**********
     A          H                           HLPARA(18 58 18 67)                      A**********
     A                                      HLPPNLGRP(SC0009TOUSER -                 A**********
     A                                      MNU010H)                                 A**********
     A                                      HLPBDY                                   A**********
     A          H                           HLPARA(11 35 21 74)                      A**********
     A                                      HLPPNLGRP(SC0009 -                       A**********
     A                                      MNU010H)                                 A**********
     A                                 11 35'                                  -     A**********
     A                                            '                                  A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 12 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 12 38'Copy Users                    '         A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(HI)                               A**********
     A                                      COLOR(BLU)                               A**********
     A                                 12 69'    '                                   A**********
     A                                 12 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 13 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 13 37'                                  -     A**********
     A                                        '                                      A**********
     A                                 13 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 14 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 14 38'Copy From User . :'                     A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            FL0005        10   O 14 58                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A                                 14 69'    '                                   A**********
     A                                 14 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 15 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 15 37'                                  -     A**********
     A                                        '                                      A**********
     A                                 15 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 16 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 16 38'Copy Menus . . . :'                     A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            CPYMNU         1   O 16 58                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A  01                                  DSPATR(PC)                               A**********
     A  01                                  DSPATR(RI)                               A**********
     A                                 16 60'             '                          A**********
     A                                 16 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 17 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 17 38'Copy Options . . .'                     A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            CPYOPT         1   B 17 58                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  03                                  DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A  02                                  DSPATR(PC)                               A**********
     A  02                                  DSPATR(RI)                               A**********
     A                                 17 60'             '                          A**********
     A                                 17 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 18 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 18 38'Copy To User . . .'                     A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(GRN)                               A**********
     A            TOUSER        10   B 18 58                                         A**********
     A                                      OVRDTA                                   A**********
     A                                      OVRATR                                   A**********
     A  05                                  DSPATR(UL)                               A**********
     A                                      COLOR(GRN)                               A**********
     A  04                                  DSPATR(PC)                               A**********
     A  04                                  DSPATR(RI)                               A**********
     A                                 18 69'    '                                   A**********
     A                                 18 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 19 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 19 37'                                  -     A**********
     A                                        '                                      A**********
     A                                 19 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 20 35' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 20 38'F1=Help  F4=Prompt  F12=Cancel'         A**********
     A                                      OVRATR                                   A**********
     A                                      COLOR(BLU)                               A**********
     A                                 20 69'    '                                   A**********
     A                                 20 74' '                                      A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A                                 21 35'                                  -     A**********
     A                                            '                                  A**********
     A                                      OVRATR                                   A**********
     A                                      DSPATR(RI)                               A**********
     A                                      COLOR(RED)                               A**********
     A            LIN            3  0H                                               A**********
     A            POS            3  0H                                               A**********
     A*********************************************************************          A
     A          R PSSR0001                  CLRL(*NO) OVERLAY                        A
     A                                  1 13'                                  -     A
     A                                                             '                 A
     A                                      DSPATR(RI) COLOR(TRQ)                    A
     A                                  2 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  2 15'PSSR0001'                               A
     A                                  2 24'       Execution Error Handler    -     A
     A                                                ' DSPATR(HI)                   A
     A                                  2 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  3 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  3 15'                                  -     A
     A                                                         '                     A
     A                                  3 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  4 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  4 15'Job . . . . :'                          A
     A            WSID          10A  O  4 29COLOR(WHT)                               A
     A                                  4 40'  Program  . . :'                       A
     A            PGM           10A  O  4 57COLOR(WHT)                               A
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  5 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  5 15'User  . . . :'                          A
     A            USER          10A  O  5 29COLOR(WHT)                               A
     A                                  5 40'  Library  . . :'                       A
     A            ULIB          10A  O  5 57COLOR(WHT)                               A
     A                                  5 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  6 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  6 15'Number  . . :'                          A
     A            UJOBN          6S 0O  6 29COLOR(WHT)                               A
     A                                  6 36'      Compiled . . :'                   A
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)  COLOR(WHT)                    A
     A                                  6 66'  '                                     A
     A                                  6 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  7 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  7 15'Routine . . :'                          A
     A            UROUTN         8A  O  7 29COLOR(WHT)                               A
     A                                  7 38'                  '                     A
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')  COLOR(WHT)           A
     A                                  7 66'  '                                     A
     A                                  7 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  8 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  8 15'Status Code :'                          A
     A            USTAT4         4A  O  8 29COLOR(WHT)                               A
     A                                  8 34'        Source Line. :'                 A
     A            USRCLN         8A  O  8 57COLOR(WHT)                               A
     A                                  8 66'  '                                     A
     A                                  8 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  9 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                  9 15'Message ID  :'                          A
     A            MSGID          7A  O  9 29COLOR(WHT)                               A
     A                                  9 37'     File Name  . :'                    A
     A            UFILE          8A  O  9 57COLOR(WHT)                               A
     A                                  9 66'  '                                     A
     A                                  9 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 10 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 10 16'                                  -     A
     A                                                       '                       A
     A                                 10 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 11 13' ' DSPATR(RI) COLOR(TRQ)                A
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)                    A
     A                                 11 67' '                                      A
     A                                 11 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 12 13' ' DSPATR(RI) COLOR(TRQ)                A
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)                    A
     A                                 12 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 13 13' ' DSPATR(RI) COLOR(TRQ)                A
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)                    A
     A                                 13 46'                      '                 A
     A                                 13 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 14 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 14 15'                                  -     A
     A                                                         '                     A
     A                                 14 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 15 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 15 15'Select one of the following option-     A
     A                                      s. Then Enter.     '                     A
     A                                 15 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 16 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 16 15'                                  -     A
     A                                                         '                     A
     A                                 16 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 17 13' ' DSPATR(RI) COLOR(TRQ)                A
     A            UEROPT         1A  B 17 15DSPATR(UL) DSPATR(HI)                    A
     A                                      VALUES('1' '2' '3')                      A
     A                                 17 17' 1. Continue at the beginning of p-     A
     A                                      rogram           '                       A
     A                                 17 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 18 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 18 15'   2. Cancel the processing of the-     A
     A                                       program           '                     A
     A                                 18 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 19 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 19 15'   3. Return control to the system-     A
     A                                       error handler     '                     A
     A                                 19 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 20 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 20 15'                                  -     A
     A                                                         '                     A
     A                                 20 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 21 13' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 21 15'Enter                             -     A
     A                                                         '  DSPATR(HI)         A
     A                                 21 69' ' DSPATR(RI) COLOR(TRQ)                A
     A                                 22 13'                                  -     A
     A                                                             '                 A
     A                                      DSPATR(RI) COLOR(TRQ)                    A
     A*********************************************************************          A
     A          R MSGRCD                    TEXT('MSG SFL RECORD')                   A
     A                                      SFL                                      A
     A                                      SFLMSGRCD(24)                            A
     A            MSGKEY                    SFLMSGKEY                                A
     A            PGM                       SFLPGMQ                                  A**********
     A*********************************************************************          A
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')                  A
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)        A
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ        A N98
     A N98                                  SFLEND                                   A
     A            PGM                       SFLPGMQ                                  A*
     A*                                                                              A*
