     A********************************************************************
     A* Copyright 2012    ** KDP Software Ltd **      All Rights Reserved
     A********************************************************************
     A*
     A*  DISPLAY FILE ID     -    MITMMAST
     A*  DISPLAY FILE NAME   -        Work with Item Master
     A*  DATE CREATED        -    Jan 11, 2012
     A*
     A******************************************************************
     A                                      PRINT
     A                                      ALTHELP(CA01)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      HLPTITLE(' ')
     A                                      HELP
     A          R SCR001
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'    Work with Item Master     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SCALPH    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0001    42   O  4  2MSGID(M010000 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0002     8   O  5  4MSGID(M010010 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0003     8   O  5 14MSGID(M010020 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0004     9   O  5 24MSGID(M010030 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0005     3   O  7  2MSGID(M010090 *LIBL/CONSTDEF)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A            MSGFLD0006    12   O  7  6MSGID(M010060 *LIBL/CONSTDEF)
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A            MSGFLD0007    16   O  7 19MSGID(M010050 *LIBL/CONSTDEF)
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A            MSGFLD0008    11   O  7 60MSGID(M010040 *LIBL/CONSTDEF)
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A          R SCR001S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0002         1  0B  8  3
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            WK0008    R     A  O  8  6REFFLD(ITALPHA ITMMAST1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0010    R     A  O  8 19REFFLD(ITIDESC ITMMAST1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            WK0011    R     A  O  8 60REFFLD(ITITEM ITMMAST1)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A            HRC01          9  0H
     A            HD0006    R        H      REFFLD(ITCOYNO ITMMAST1)
     A                                      ALIAS(ALIAS00001)
     A            HD0005    R        H      REFFLD(ITALPHA ITMMAST1)
     A                                      ALIAS(ALIAS00002)
     A            HD0007    R        H      REFFLD(ITITEM ITMMAST1)
     A                                      ALIAS(ALIAS00003)
     A            INSAV1        99   H
     A          R SCR001C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR001S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR001S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Number Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SCALPH -
     A                                      MITMMASTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SCALPHCYDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(8 3 19 3)
     A                                      HLPPNLGRP(SCALPHFL0002 -
     A                                      MITMMASTH)
     A          H                           HLPARA(8 6 19 15)
     A                                      HLPPNLGRP(SCALPHITALPHA -
     A                                      MITMMASTH)
     A          H                           HLPARA(8 19 19 58)
     A                                      HLPPNLGRP(SCALPHITIDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(8 60 19 79)
     A                                      HLPPNLGRP(SCALPHITITEM -
     A                                      MITMMASTH)
     A          H                           HLPARA(21 19 21 28)
     A                                      HLPPNLGRP(SCALPHPSALPH -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SCALPH -
     A                                      MITMMASTH)
     A            MSGFLD0009    15   O 21  2MSGID(M010070 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PSALPH        10   B 21 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A            MSGFLD0010    55   O 23  2MSGID(M010080 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN01          4S 0H      SFLRCDNBR
     A            XRN01          4S 0H
     A          R SCR002
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 22REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  2 26'    Work with Item Master     '
     A                                      OVRATR
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  3  2'SC0001    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0011    42   O  4  2MSGID(M010140 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0012    29   O  5  4MSGID(M010150 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0013    11   O  6  6MSGID(M010100 *LIBL/CONSTDEF)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A            MSGFLD0014    16   O  6 28MSGID(M010110 *LIBL/CONSTDEF)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A            MSGFLD0015    12   O  6 69MSGID(M010120 *LIBL/CONSTDEF)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A          R SCR002S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0001         1  0B  7  3
     A  80
     AO 01                                  DSPATR(PC)
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XTITEM    R     A  O  7  6REFFLD(ITITEM ITMMAST)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            WK0007    R     A  O  7 28REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0005    R     A  O  7 70REFFLD(ITALPHA ITMMAST)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC04          9  0H
     A            HD0004    R        H      REFFLD(ITCOYNO ITMMAST)
     A                                      ALIAS(ALIAS00004)
     A            HTITEM    R        H      REFFLD(ITITEM ITMMAST)
     A                                      ALIAS(ALIAS00005)
     A            INSAV1        99   H
     A          R SCR002C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR002S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR002S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(12)
     A                                      SFLSIZ(12)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF18 INDTXT(18 'Alpha Seq')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MITMMASTH)
     A          H                           HLPARA(1 22 1 61)
     A                                      HLPPNLGRP(CYDESC -
     A                                      COMPANYH)
     A          H                           HLPARA(7 3 18 3)
     A                                      HLPPNLGRP(SC0001FL0001 -
     A                                      MITMMASTH)
     A          H                           HLPARA(7 6 18 25)
     A                                      HLPPNLGRP(SC0001ITITEM -
     A                                      MITMMASTH)
     A          H                           HLPARA(7 28 18 67)
     A                                      HLPPNLGRP(SC0001ITIDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(7 70 18 79)
     A                                      HLPPNLGRP(SC0001ITALPHA -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MITMMASTH)
     A            MSGFLD0016    15   O 21  2MSGID(M010160 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0102        20   B 21 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A            MSGFLD0017    45   O 23  1MSGID(M010130 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN02          4S 0H      SFLRCDNBR
     A            XRN02          4S 0H
     A          R SCR003                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MITMMASTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SC0002CYDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(6 33 6 52)
     A                                      HLPPNLGRP(SC0002ITITEM -
     A                                      MITMMASTH)
     A          H                           HLPARA(7 33 7 72)
     A                                      HLPPNLGRP(SC0002ITIDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(8 33 8 42)
     A                                      HLPPNLGRP(SC0002ITALPHA -
     A                                      MITMMASTH)
     A          H                           HLPARA(9 33 9 52)
     A                                      HLPPNLGRP(SC0002ITSUPG -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 33 10 52)
     A                                      HLPPNLGRP(SC0002ITSUPD -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 33 11 52)
     A                                      HLPPNLGRP(SC0002ITSUBS -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 33 12 47)
     A                                      HLPPNLGRP(SC0002ITMANF -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 33 13 46)
     A                                      HLPPNLGRP(SC0002ITWEIG -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 33 14 35)
     A                                      HLPPNLGRP(SC0002ITCLAS -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 37 14 76)
     A                                      HLPPNLGRP(SC0002ICDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(15 33 15 35)
     A                                      HLPPNLGRP(SC0002ITIGRP -
     A                                      MITMMASTH)
     A          H                           HLPARA(15 37 15 76)
     A                                      HLPPNLGRP(SC0002SGSDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(16 33 16 37)
     A                                      HLPPNLGRP(SC0002ITUOM -
     A                                      MITMMASTH)
     A          H                           HLPARA(17 33 17 37)
     A                                      HLPPNLGRP(SC0002ITPACK -
     A                                      MITMMASTH)
     A          H                           HLPARA(18 33 18 37)
     A                                      HLPPNLGRP(SC0002ITUOMO -
     A                                      MITMMASTH)
     A          H                           HLPARA(19 33 19 41)
     A                                      HLPPNLGRP(SC0002ITQTYO -
     A                                      MITMMASTH)
     A          H                           HLPARA(20 33 20 33)
     A                                      HLPPNLGRP(SC0002ITPALL -
     A                                      MITMMASTH)
     A          H                           HLPARA(21 33 21 34)
     A                                      HLPPNLGRP(SC0002ITVATC -
     A                                      MITMMASTH)
     A          H                           HLPARA(21 36 21 75)
     A                                      HLPPNLGRP(SC0002VCDESC -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MITMMASTH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  20                                  DSPATR(PC)
     A  20                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'    Work with Item Master     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SC0002    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0018    26   O  4  2MSGID(M010330 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0019    29   O  6  2MSGID(M010340 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTITEM    R     A  B  6 33REFFLD(ITITEM ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  09                                  DSPATR(UL)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  08                                  DSPATR(PR)
     A            MSGFLD0020    29   O  7  2MSGID(M010170 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0007    R     A  B  7 33REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0021    29   O  8  2MSGID(M010180 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0005    R     A  B  8 33REFFLD(ITALPHA ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0022    29   O  9  2MSGID(M010190 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSUPG    R     A  B  9 33REFFLD(ITSUPG ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  15                                  DSPATR(PC)
     A  15                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0023    29   O 10  2MSGID(M010200 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSUPD    R     A  B 10 33REFFLD(ITSUPD ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  14                                  DSPATR(PC)
     A  14                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0024    29   O 11  2MSGID(M010210 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSUBS    R     A  B 11 33REFFLD(ITSUBS ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  13                                  DSPATR(PC)
     A  13                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0025    29   O 12  2MSGID(M010220 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTMANF    R     A  B 12 33REFFLD(ITMANF ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0026    29   O 13  2MSGID(M010230 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTWEIG    R        B 13 33REFFLD(ITWEIG ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  19                                  DSPATR(PC)
     A  19                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0027    29   O 14  2MSGID(M010240 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTCLAS    R     A  B 14 33REFFLD(ITCLAS ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XCDESC    R     A  O 14 37REFFLD(ICDESC ITMCLAS)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0028    29   O 15  2MSGID(M010250 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTIGRP    R     A  B 15 33REFFLD(ITIGRP ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0017    R     A  O 15 37REFFLD(SGSDESC STOKGRP)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0029    29   O 16  2MSGID(M010260 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTUOM     R     A  B 16 33REFFLD(ITUOM ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  16                                  DSPATR(PC)
     A  16                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0030    29   O 17  2MSGID(M010270 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTPACK    R        B 17 33REFFLD(ITPACK ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0031    29   O 18  2MSGID(M010280 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTUOMO    R     A  B 18 33REFFLD(ITUOMO ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  17                                  DSPATR(PC)
     A  17                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0032    29   O 19  2MSGID(M010310 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTQTYO    R        B 19 33REFFLD(ITQTYO ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0033    29   O 20  2MSGID(M010290 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTPALL    R     A  B 20 33REFFLD(ITPALL ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0034    29   O 21  2MSGID(M010300 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTVATC    R     A  B 21 33REFFLD(ITVATC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  18                                  DSPATR(PC)
     A  18                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0022    R     A  O 21 36REFFLD(VCDESC VATCOD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A            MSGFLD0035    42   O 23  2MSGID(M010320 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR004                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF03 INDTXT(03 'Cancel')
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Return')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SUP014 -
     A                                      MITMMASTH)
     A          H                           HLPARA(1 21 1 60)
     A                                      HLPPNLGRP(SUP014CYDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(5 23 5 42)
     A                                      HLPPNLGRP(SUP014ITITEM -
     A                                      MITMMASTH)
     A          H                           HLPARA(6 23 6 62)
     A                                      HLPPNLGRP(ITIDESC -
     A                                      ITMMASTH)
     A          H                           HLPARA(7 29 7 43)
     A                                      HLPPNLGRP(SUP014ITNLAC -
     A                                      MITMMASTH)
     A          H                           HLPARA(8 29 8 43)
     A                                      HLPPNLGRP(SUP014ITNLAS -
     A                                      MITMMASTH)
     A          H                           HLPARA(9 29 9 43)
     A                                      HLPPNLGRP(SUP014ITNLST -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 2 10 16)
     A                                      HLPPNLGRP(SUP014CDHEAD1 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 29 10 33)
     A                                      HLPPNLGRP(SUP014ITUDF1 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 2 11 16)
     A                                      HLPPNLGRP(SUP014CDHEAD2 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 29 11 33)
     A                                      HLPPNLGRP(SUP014ITUDF2 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 2 12 16)
     A                                      HLPPNLGRP(SUP014CDHEAD3 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 29 12 33)
     A                                      HLPPNLGRP(SUP014ITUDF3 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 29 13 29)
     A                                      HLPPNLGRP(SUP014ITITYP -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 31 13 70)
     A                                      HLPPNLGRP(SUP014BADESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 29 14 29)
     A                                      HLPPNLGRP(SUP014ITSANL -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 31 14 70)
     A                                      HLPPNLGRP(SUP014SADESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(15 29 15 29)
     A                                      HLPPNLGRP(SUP014ITSVG -
     A                                      MITMMASTH)
     A          H                           HLPARA(15 31 15 70)
     A                                      HLPPNLGRP(SUP014VGDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(16 29 16 30)
     A                                      HLPPNLGRP(SUP014ITSIG -
     A                                      MITMMASTH)
     A          H                           HLPARA(16 32 16 71)
     A                                      HLPPNLGRP(SUP014SIDESC -
     A                                      MITMMASTH)
     A          H                           HLPARA(17 29 17 40)
     A                                      HLPPNLGRP(SUP014ITLPRC -
     A                                      MITMMASTH)
     A          H                           HLPARA(18 29 18 41)
     A                                      HLPPNLGRP(SUP014ITSTUC -
     A                                      MITMMASTH)
     A          H                           HLPARA(19 69 19 78)
     A                                      HLPPNLGRP(SUP014DTDTCR -
     A                                      MITMMASTH)
     A          H                           HLPARA(20 69 20 78)
     A                                      HLPPNLGRP(SUP014ITCRTU -
     A                                      MITMMASTH)
     A          H                           HLPARA(21 69 21 78)
     A                                      HLPPNLGRP(SUP014DTDTLM -
     A                                      MITMMASTH)
     A          H                           HLPARA(22 69 22 78)
     A                                      HLPPNLGRP(SUP014ITLMBY -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SUP014 -
     A                                      MITMMASTH)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            XYDESC    R     A  O  1 21REFFLD(CYDESC COMPANY)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  13                                  DSPATR(PC)
     A  13                                  DSPATR(RI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'    Work with Item Master     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  3  2'SUP014    '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0036    26   O  4  2MSGID(M010930 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            MSGFLD0037    18   O  5  2MSGID(M010910 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTITEM    R     A  O  5 23REFFLD(ITITEM ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A            WK0007    R     A  O  6 23REFFLD(ITIDESC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A            MSGFLD0038    25   O  7  2MSGID(M010750 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTNLAC    R     A  B  7 29REFFLD(ITNLAC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0039    25   O  8  2MSGID(M010760 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTNLAS    R     A  B  8 29REFFLD(ITNLAS ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0040    25   O  9  2MSGID(M010770 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTNLST    R     A  B  9 29REFFLD(ITNLST ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0001    R     A  O 10  2REFFLD(CDHEAD1 IMSCPYD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0041     9   O 10 18MSGID(M010840 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTUDF1    R     A  B 10 29REFFLD(ITUDF1 ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0002    R     A  O 11  2REFFLD(CDHEAD2 IMSCPYD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0042     9   O 11 18MSGID(M010850 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTUDF2    R     A  B 11 29REFFLD(ITUDF2 ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0003    R     A  O 12  2REFFLD(CDHEAD3 IMSCPYD)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0043     9   O 12 18MSGID(M010860 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTUDF3    R     A  B 12 29REFFLD(ITUDF3 ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0044    25   O 13  2MSGID(M010780 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTITYP    R     A  B 13 29REFFLD(ITITYP ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XADESC    R     A  O 13 31REFFLD(BADESC ITMTYP)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            MSGFLD0045    25   O 14  2MSGID(M010790 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSANL    R     A  B 14 29REFFLD(ITSANL ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0014    R     A  O 14 31REFFLD(SADESC STANYS)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A            MSGFLD0046    25   O 15  2MSGID(M010800 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSVG     R     A  B 15 29REFFLD(ITSVG ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XGDESC    R     A  O 15 31REFFLD(VGDESC STVGRP)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0047    25   O 16  2MSGID(M010810 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSIG     R     A  B 16 29REFFLD(ITSIG ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XIDESC    R     A  O 16 32REFFLD(SIDESC STIGRP)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0048    25   O 17  2MSGID(M010820 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTLPRC    R        B 17 29REFFLD(ITLPRC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0049    25   O 18  2MSGID(M010830 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTSTUC    R        B 18 29REFFLD(ITSTUC ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(3)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            MSGFLD0050    13   O 18 57MSGID(M010940 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0051    16   O 19 51MSGID(M010870 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            DTDTCR        10   O 19 69
     A                                      OVRDTA
     A                                      OVRATR
     A            MSGFLD0052    16   O 20 51MSGID(M010880 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTCRTU    R     A  O 20 69REFFLD(ITCRTU ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0053    16   O 21 51MSGID(M010890 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            DTDTLM        10   O 21 69
     A                                      OVRDTA
     A                                      OVRATR
     A            MSGFLD0054    16   O 22 51MSGID(M010900 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XTLMBY    R     A  O 22 69REFFLD(ITLMBY ITMMAST)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            MSGFLD0055    53   O 23  2MSGID(M010920 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR005
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 21 10 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 21 11 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 21 12 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 21 13 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0003T01 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0003T02 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 21 14 60)
     A                                      HLPPNLGRP(SC0003T03 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 64)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'              '
     A                                  5 20'     List of Item Classes     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 51'            '
     A                                  5 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                                              '
     A                                  6 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0056    19   O  7  6MSGID(M010350 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                         '
     A                                  7 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                              '
     A                                  8 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0057     6   O  9  6MSGID(M010360 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0058     5   O  9 14MSGID(M010370 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0059    11   O  9 21MSGID(M010380 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 33'                              '
     A                                  9 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T01001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T02001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18'  '
     A            T03001        40   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 62' '
     A                                 10 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T01002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T02002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18'  '
     A            T03002        40   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 62' '
     A                                 11 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T01003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T02003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18'  '
     A            T03003        40   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 62' '
     A                                 12 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T01004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T02004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18'  '
     A            T03004        40   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 62' '
     A                                 13 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T01005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T02005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18'  '
     A            T03005        40   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 62' '
     A                                 14 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                              '
     A                                 15 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0060    10   O 16  6MSGID(M010390 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                  '
     A                                 16 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR006
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 14)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 20 10 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 14)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 20 11 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 14)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 20 12 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 14)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 20 13 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0004T04 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 14)
     A                                      HLPPNLGRP(SC0004T05 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 20 14 59)
     A                                      HLPPNLGRP(SC0004T06 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 63)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'             '
     A                                  5 19'      List of item types      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 50'            '
     A                                  5 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                                             '
     A                                  6 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0061    19   O  7  6MSGID(M010400 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                        '
     A                                  7 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                             '
     A                                  8 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0062     6   O  9  6MSGID(M010410 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0063     4   O  9 14MSGID(M010420 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0064    11   O  9 20MSGID(M010430 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 32'                              '
     A                                  9 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T04001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T05001         1   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 16'   '
     A            T06001        40   O 10 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 61' '
     A                                 10 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T04002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T05002         1   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 16'   '
     A            T06002        40   O 11 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 61' '
     A                                 11 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T04003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T05003         1   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 16'   '
     A            T06003        40   O 12 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 61' '
     A                                 12 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T04004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T05004         1   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 16'   '
     A            T06004        40   O 13 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 61' '
     A                                 13 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T04005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T05005         1   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 16'   '
     A            T06005        40   O 14 20
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 61' '
     A                                 14 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                             '
     A                                 15 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0065    10   O 16  6MSGID(M010440 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                 '
     A                                 16 63' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                 '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR007
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 14)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 21 10 60)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 14)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 21 11 60)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 14)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 21 12 60)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 14)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 21 13 60)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0007T14 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 14)
     A                                      HLPPNLGRP(SC0007T15 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 21 14 60)
     A                                      HLPPNLGRP(SC0007T16 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 64)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'               '
     A                                  5 21' List of stock analysis codes '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 52'           '
     A                                  5 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                                              '
     A                                  6 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0066    19   O  7  6MSGID(M010450 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                         '
     A                                  7 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                              '
     A                                  8 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0067     6   O  9  6MSGID(M010460 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0068     5   O  9 14MSGID(M010470 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0069    11   O  9 21MSGID(M010480 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 33'                              '
     A                                  9 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T14001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T15001         1   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 16'    '
     A            T16001        40   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 62' '
     A                                 10 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T14002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T15002         1   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 16'    '
     A            T16002        40   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 62' '
     A                                 11 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T14003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T15003         1   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 16'    '
     A            T16003        40   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 62' '
     A                                 12 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T14004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T15004         1   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 16'    '
     A            T16004        40   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 62' '
     A                                 13 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T14005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T15005         1   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 16'    '
     A            T16005        40   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 62' '
     A                                 14 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                              '
     A                                 15 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0070    10   O 16  6MSGID(M010490 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                  '
     A                                 16 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR008
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 15)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 23 10 62)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 15)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 23 11 62)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 15)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 23 12 62)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 15)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 23 13 62)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0008T17 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 15)
     A                                      HLPPNLGRP(SC0008T18 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 23 14 62)
     A                                      HLPPNLGRP(SC0008T19 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 66)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                                                    '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'              '
     A                                  5 20'List of Stock inventory groups'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 51'              '
     A                                  5 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                                                '
     A                                  6 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0071    19   O  7  6MSGID(M010500 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                           '
     A                                  7 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                '
     A                                  8 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0072     6   O  9  6MSGID(M010510 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0073     7   O  9 14MSGID(M010520 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0074    11   O  9 23MSGID(M010530 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 35'                              '
     A                                  9 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T17001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T18001         2   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 17'     '
     A            T19001        40   O 10 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 64' '
     A                                 10 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T17002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T18002         2   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 17'     '
     A            T19002        40   O 11 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 64' '
     A                                 11 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T17003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T18003         2   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 17'     '
     A            T19003        40   O 12 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 64' '
     A                                 12 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T17004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T18004         2   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 17'     '
     A            T19004        40   O 13 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 64' '
     A                                 13 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T17005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T18005         2   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 17'     '
     A            T19005        40   O 14 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 64' '
     A                                 14 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                '
     A                                 15 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0075    10   O 16  6MSGID(M010540 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                    '
     A                                 16 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                    '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR009
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 21 10 60)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 21 11 60)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 21 12 60)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 21 13 60)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0009T20 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 16)
     A                                      HLPPNLGRP(SC0009T21 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 21 14 60)
     A                                      HLPPNLGRP(SC0009T22 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 64)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'              '
     A                                  5 20'     List of stock groups     '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 51'            '
     A                                  5 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                                              '
     A                                  6 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0076    19   O  7  6MSGID(M010550 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                         '
     A                                  7 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                              '
     A                                  8 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0077     6   O  9  6MSGID(M010560 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0078     5   O  9 14MSGID(M010570 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0079    11   O  9 21MSGID(M010580 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 33'                              '
     A                                  9 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T20001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T21001         3   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 18'  '
     A            T22001        40   O 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 62' '
     A                                 10 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T20002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T21002         3   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 18'  '
     A            T22002        40   O 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 62' '
     A                                 11 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T20003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T21003         3   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 18'  '
     A            T22003        40   O 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 62' '
     A                                 12 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T20004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T21004         3   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 18'  '
     A            T22004        40   O 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 62' '
     A                                 13 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T20005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T21005         3   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 18'  '
     A            T22005        40   O 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 62' '
     A                                 14 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                              '
     A                                 15 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0080    10   O 16  6MSGID(M010590 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                  '
     A                                 16 64' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                  '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR010
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0010T23 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 14)
     A                                      HLPPNLGRP(SC0010T24 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 23 10 62)
     A                                      HLPPNLGRP(SC0010T25 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0010T23 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 14)
     A                                      HLPPNLGRP(SC0010T24 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 23 11 62)
     A                                      HLPPNLGRP(SC0010T25 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0010T23 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 14)
     A                                      HLPPNLGRP(SC0010T24 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 23 12 62)
     A                                      HLPPNLGRP(SC0010T25 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0010T23 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 14)
     A                                      HLPPNLGRP(SC0010T24 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 23 13 62)
     A                                      HLPPNLGRP(SC0010T25 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0010T23 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 14)
     A                                      HLPPNLGRP(SC0010T24 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 23 14 62)
     A                                      HLPPNLGRP(SC0010T25 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 66)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                                                    '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'              '
     A                                  5 20'  List of stock value groups  '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 51'              '
     A                                  5 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                                                '
     A                                  6 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0081    19   O  7  6MSGID(M010600 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                           '
     A                                  7 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                                '
     A                                  8 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0082     6   O  9  6MSGID(M010610 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0083     7   O  9 14MSGID(M010620 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0084    11   O  9 23MSGID(M010630 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 35'                              '
     A                                  9 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T23001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T24001         1   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 16'      '
     A            T25001        40   O 10 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 64' '
     A                                 10 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T23002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T24002         1   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 16'      '
     A            T25002        40   O 11 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 64' '
     A                                 11 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T23003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T24003         1   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 16'      '
     A            T25003        40   O 12 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 64' '
     A                                 12 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T23004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T24004         1   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 16'      '
     A            T25004        40   O 13 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 64' '
     A                                 13 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T23005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T24005         1   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 16'      '
     A            T25005        40   O 14 23
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 64' '
     A                                 14 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                '
     A                                 15 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0085    10   O 16  6MSGID(M010640 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                    '
     A                                 16 66' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                    '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR011
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0011 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0011T26 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 18)
     A                                      HLPPNLGRP(SC0011T27 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 21 10 29)
     A                                      HLPPNLGRP(SC0011T28 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0011T26 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 18)
     A                                      HLPPNLGRP(SC0011T27 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 21 11 29)
     A                                      HLPPNLGRP(SC0011T28 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0011T26 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 18)
     A                                      HLPPNLGRP(SC0011T27 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 21 12 29)
     A                                      HLPPNLGRP(SC0011T28 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0011T26 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 18)
     A                                      HLPPNLGRP(SC0011T27 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 21 13 29)
     A                                      HLPPNLGRP(SC0011T28 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0011T26 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 18)
     A                                      HLPPNLGRP(SC0011T27 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 21 14 29)
     A                                      HLPPNLGRP(SC0011T28 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 41)
     A                                      HLPPNLGRP(SC0011 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'  '
     A                                  5  8'   List of Units of Measure   '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 39' '
     A                                  5 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                       '
     A                                  6 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0086    19   O  7  6MSGID(M010650 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'              '
     A                                  7 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                       '
     A                                  8 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0087     6   O  9  6MSGID(M010660 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0088     3   O  9 14MSGID(M010670 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 18'  '
     A            MSGFLD0089     9   O  9 21MSGID(M010680 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 31'         '
     A                                  9 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T26001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T27001         5   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T28001         9  0B 10 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 10 31'         '
     A                                 10 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T26002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T27002         5   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T28002         9  0B 11 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 11 31'         '
     A                                 11 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T26003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T27003         5   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T28003         9  0B 12 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 12 31'         '
     A                                 12 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T26004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T27004         5   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T28004         9  0B 13 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 13 31'         '
     A                                 13 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T26005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T27005         5   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T28005         9  0B 14 21
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                 14 31'         '
     A                                 14 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                       '
     A                                 15 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0090    10   O 16  6MSGID(M010690 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                       '
     A                                 16 41' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                           '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR012
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0012 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0012T29 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 14 10 15)
     A                                      HLPPNLGRP(SC0012T30 -
     A                                      MITMMASTH)
     A          H                           HLPARA(10 19 10 58)
     A                                      HLPPNLGRP(SC0012T31 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0012T29 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 14 11 15)
     A                                      HLPPNLGRP(SC0012T30 -
     A                                      MITMMASTH)
     A          H                           HLPARA(11 19 11 58)
     A                                      HLPPNLGRP(SC0012T31 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0012T29 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 14 12 15)
     A                                      HLPPNLGRP(SC0012T30 -
     A                                      MITMMASTH)
     A          H                           HLPARA(12 19 12 58)
     A                                      HLPPNLGRP(SC0012T31 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0012T29 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 14 13 15)
     A                                      HLPPNLGRP(SC0012T30 -
     A                                      MITMMASTH)
     A          H                           HLPARA(13 19 13 58)
     A                                      HLPPNLGRP(SC0012T31 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0012T29 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 14 14 15)
     A                                      HLPPNLGRP(SC0012T30 -
     A                                      MITMMASTH)
     A          H                           HLPARA(14 19 14 58)
     A                                      HLPPNLGRP(SC0012T31 -
     A                                      MITMMASTH)
     A                                      HLPBDY
     A          H                           HLPARA(4 3 17 62)
     A                                      HLPPNLGRP(SC0012 -
     A                                      MITMMASTH)
     A                                  4  3'                                  -
     A                                                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'          '
     A                                  5 16'       List of Tax codes      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  5 47'              '
     A                                  5 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  5'                                  -
     A                                                            '
     A                                  6 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0091    19   O  7  6MSGID(M010700 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 26'                                  -
     A                                       '
     A                                  7 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                                            '
     A                                  8 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0092     6   O  9  6MSGID(M010710 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0093     3   O  9 14MSGID(M010720 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            MSGFLD0094    11   O  9 19MSGID(M010730 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 31'                              '
     A                                  9 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T29001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T30001         2   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 17' '
     A            T31001        40   O 10 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 60' '
     A                                 10 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T29002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T30002         2   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 17' '
     A            T31002        40   O 11 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 60' '
     A                                 11 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T29003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T30003         2   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 17' '
     A            T31003        40   O 12 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 60' '
     A                                 12 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T29004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T30004         2   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 17' '
     A            T31004        40   O 13 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 60' '
     A                                 13 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T29005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T30005         2   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 17' '
     A            T31005        40   O 14 19
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 60' '
     A                                 14 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                            '
     A                                 15 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            MSGFLD0095    10   O 16  6MSGID(M010740 *LIBL/CONSTDEF)
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                                  -
     A                                                '
     A                                 16 62' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A*********************************************************************
     A          R PSSR0001                  CLRL(*NO) OVERLAY
     A                                  1 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  2 15'PSSR0001'
     A                                  2 24'       Execution Error Handler    -
     A                                                ' DSPATR(HI)
     A                                  2 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 15'                                  -
     A                                                         '
     A                                  3 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 15'Job . . . . :'
     A            WSID          10A  O  4 29COLOR(WHT)
     A                                  4 40'  Program  . . :'
     A            PGM           10A  O  4 57COLOR(WHT)
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 15'User  . . . :'
     A            USER          10A  O  5 29COLOR(WHT)
     A                                  5 40'  Library  . . :'
     A            ULIB          10A  O  5 57COLOR(WHT)
     A                                  5 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 15'Number  . . :'
     A            UJOBN          6S 0O  6 29COLOR(WHT)
     A                                  6 36'      Compiled . . :'
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)  COLOR(WHT)
     A                                  6 66'  '
     A                                  6 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 15'Routine . . :'
     A            UROUTN         8A  O  7 29COLOR(WHT)
     A                                  7 38'                  '
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')  COLOR(WHT)
     A                                  7 66'  '
     A                                  7 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 15'Status Code :'
     A            USTAT4         4A  O  8 29COLOR(WHT)
     A                                  8 34'        Source Line. :'
     A            USRCLN         8A  O  8 57COLOR(WHT)
     A                                  8 66'  '
     A                                  8 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 15'Message ID  :'
     A            MSGID          7A  O  9 29COLOR(WHT)
     A                                  9 37'     File Name  . :'
     A            UFILE          8A  O  9 57COLOR(WHT)
     A                                  9 66'  '
     A                                  9 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 16'                                  -
     A                                                       '
     A                                 10 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 11 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)
     A                                 11 67' '
     A                                 11 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 12 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)
     A                                 12 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 13 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)
     A                                 13 46'                      '
     A                                 13 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 15'                                  -
     A                                                         '
     A                                 14 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 15'Select one of the following option-
     A                                      s. Then Enter.     '
     A                                 15 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 15'                                  -
     A                                                         '
     A                                 16 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 17 13' ' DSPATR(RI) COLOR(TRQ)
     A            UEROPT         1A  B 17 15DSPATR(UL) DSPATR(HI)
     A                                      VALUES('1' '2' '3')
     A                                 17 17' 1. Continue at the beginning of p-
     A                                      rogram           '
     A                                 17 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 15'   2. Cancel the processing of the-
     A                                       program           '
     A                                 18 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 15'   3. Return control to the system-
     A                                       error handler     '
     A                                 19 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 15'                                  -
     A                                                         '
     A                                 20 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 15'Enter                             -
     A                                                         '  DSPATR(HI)
     A                                 21 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 22 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A*********************************************************************
     A          R MSGRCD                    TEXT('MSG SFL RECORD')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGM                       SFLPGMQ
     A*********************************************************************
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ
     A N98                                  SFLEND
     A            PGM                       SFLPGMQ
     A*
