     A********************************************************************
     A* Copyright 2012    ** KDP Software Ltd **      All Rights Reserved
     A********************************************************************
     A*
     A*  DISPLAY FILE ID     -    MNU010
     A*  DISPLAY FILE NAME   -      Work with User Menu Details
     A*  DATE CREATED        -    Jan 11, 2012
     A*
     A******************************************************************
     A                                      PRINT
     A                                      ALTHELP(CA01)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      HLPTITLE(' ')
     A                                      HELP
     A          R SCR001
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            ZZCOMP        30   O  1 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with User Menu Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  5  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 14'3=Copy'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 22'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 32'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 43'6=Menus'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A                                  8  2'Action'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  8 10'User'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  8 22'Surname'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A                                  8 44'User Group'
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      OVRATR
     A          R SCR001S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0001         1  0B  9  4
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XAUSER    R     A  O  9 10REFFLD(MAUSER MNUUSR)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XASURN    R     A  O  9 22REFFLD(MASURN MNUUSR)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            WK0001    R     A  O  9 44REFFLD(MAGUSER MNUUSR)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            HRC01          9  0H
     A            HAUSER    R        H      REFFLD(MAUSER MNUUSR)
     A                                      ALIAS(ALIAS00001)
     A            INSAV1        99   H
     A          R SCR001C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR001S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR001S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(11)
     A                                      SFLSIZ(11)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MNU010H)
     A          H                           HLPARA(1 26 1 55)
     A                                      HLPPNLGRP(SC0001ZZCOMP -
     A                                      MNU010H)
     A          H                           HLPARA(9 4 19 4)
     A                                      HLPPNLGRP(SC0001FL0001 -
     A                                      MNU010H)
     A          H                           HLPARA(9 10 19 19)
     A                                      HLPPNLGRP(SC0001MAUSER -
     A                                      MNU010H)
     A          H                           HLPARA(9 22 19 41)
     A                                      HLPPNLGRP(SC0001MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(21 18 21 27)
     A                                      HLPPNLGRP(SC0001PS0101 -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0001 -
     A                                      MNU010H)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0101        10   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'Enter  F1=Help  F3=Exit  F6=Create-
     A                                        F7=Bkwd  F8=Fwd  F12=Cancel  '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN01          4S 0H      SFLRCDNBR
     A            XRN01          4S 0H
     A          R SCR002
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MNU010H)
     A          H                           HLPARA(1 26 1 55)
     A                                      HLPPNLGRP(SC0002ZZCOMP -
     A                                      MNU010H)
     A          H                           HLPARA(6 29 6 38)
     A                                      HLPPNLGRP(SC0002MAUSER -
     A                                      MNU010H)
     A          H                           HLPARA(7 29 7 48)
     A                                      HLPPNLGRP(SC0002MAFORN -
     A                                      MNU010H)
     A          H                           HLPARA(8 29 8 48)
     A                                      HLPPNLGRP(SC0002MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(9 29 9 38)
     A                                      HLPPNLGRP(SC0002MAGUSER -
     A                                      MNU010H)
     A          H                           HLPARA(9 40 9 59)
     A                                      HLPPNLGRP(SC0002MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(10 29 10 38)
     A                                      HLPPNLGRP(SC0002MADFV1 -
     A                                      SC0002)
     A          H                           HLPARA(11 29 11 38)
     A                                      HLPPNLGRP(SC0002MADFV2 -
     A                                      MNU010H)
     A          H                           HLPARA(12 29 12 38)
     A                                      HLPPNLGRP(SC0002MADFV3 -
     A                                      MNU010H)
     A          H                           HLPARA(13 29 13 29)
     A                                      HLPPNLGRP(SC0002MACHG -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0002 -
     A                                      MNU010H)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            ZZCOMP        30   O  1 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with User Menu Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'User  . . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XAUSER    R     A  B  6 29REFFLD(MAUSER MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A  10                                  DSPATR(PR)
     A  03                                  DSPATR(UL)
     A                                  7  2'Forename  . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XAFORN    R     A  B  7 29REFFLD(MAFORN MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                  8  2'Surname . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XASURN    R     A  B  8 29REFFLD(MASURN MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                  9  2'Group User  . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            WK0001    R     A  B  9 29REFFLD(MAGUSER MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            WK0002    R     A  O  9 40REFFLD(MASURN MNUUSR1)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0008        25   O 10  2
     A                                      OVRDTA
     A                                      OVRATR
     A            XADFV1    R     A  B 10 29REFFLD(MADFV1 MNUUSR)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            FL0009        25   O 11  2
     A                                      OVRDTA
     A                                      OVRATR
     A            XADFV2    R     A  B 11 29REFFLD(MADFV2 MNUUSR)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            FL0010        25   O 12  2
     A                                      OVRDTA
     A                                      OVRATR
     A            XADFV3    R     A  B 12 29REFFLD(MADFV3 MNUUSR)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 13  2'Allow F18 Selection . . .'
     A                                      OVRATR
     A            XACHG     R     A  B 13 29REFFLD(MACHG MNUUSR)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-
     A                                      4=Delete'
     A                                      COLOR(BLU)
     A                                      OVRATR
     A          R SCR003
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                      OVRATR
     A            ZZCOMP        30   O  1 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with User Menu Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  4  2'User  . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XAUSER    R     A  O  4 17REFFLD(MAUSER MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  5  2'Surname . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XASURN    R     A  O  5 17REFFLD(MASURN MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 35'6=Options'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 46'7=Help'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 10  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 10'Menu'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 17'Menu Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR003S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0002         1  0B 11  4
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XBMNUC    R     A  O 11 10REFFLD(MBMNUC MNUHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XBMNUD    R     A  O 11 17REFFLD(MBMNUD MNUHED)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC04          9  0H
     A            HBUSER    R        H      REFFLD(MBUSER MNUHED)
     A                                      ALIAS(ALIAS00002)
     A            HBMNUC    R        H      REFFLD(MBMNUC MNUHED)
     A                                      ALIAS(ALIAS00003)
     A            INSAV1        99   H
     A          R SCR003C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR003S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR003S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(9)
     A                                      SFLSIZ(9)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MNU010H)
     A          H                           HLPARA(1 26 1 55)
     A                                      HLPPNLGRP(SC0003ZZCOMP -
     A                                      MNU010H)
     A          H                           HLPARA(4 17 4 26)
     A                                      HLPPNLGRP(SC0003MAUSER -
     A                                      MNU010H)
     A          H                           HLPARA(5 17 5 36)
     A                                      HLPPNLGRP(SC0003MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(11 4 19 4)
     A                                      HLPPNLGRP(SC0003FL0002 -
     A                                      MNU010H)
     A          H                           HLPARA(11 10 19 14)
     A                                      HLPPNLGRP(SC0003MBMNUC -
     A                                      MNU010H)
     A          H                           HLPARA(11 17 19 66)
     A                                      HLPPNLGRP(SC0003MBMNUD -
     A                                      MNU010H)
     A          H                           HLPARA(21 18 21 22)
     A                                      HLPPNLGRP(SC0003PS0301 -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0003 -
     A                                      MNU010H)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0301         5   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'Enter  F1=Help  F3=Exit  F6=Create-
     A                                        F7=Bkwd  F8=Fwd  F12=Cancel  '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN02          4S 0H      SFLRCDNBR
     A            XRN02          4S 0H
     A          R SCR004
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MNU010H)
     A          H                           HLPARA(1 26 1 55)
     A                                      HLPPNLGRP(SC0004ZZCOMP -
     A                                      MNU010H)
     A          H                           HLPARA(6 26 6 35)
     A                                      HLPPNLGRP(SC0004MAUSER -
     A                                      MNU010H)
     A          H                           HLPARA(7 26 7 45)
     A                                      HLPPNLGRP(SC0004MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(8 26 8 30)
     A                                      HLPPNLGRP(SC0004MBMNUC -
     A                                      MNU010H)
     A          H                           HLPARA(9 26 9 75)
     A                                      HLPPNLGRP(SC0004MBMNUD -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0004 -
     A                                      MNU010H)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            ZZCOMP        30   O  1 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with User Menu Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'User . . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XAUSER    R     A  O  6 26REFFLD(MAUSER MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Surname  . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XASURN    R     A  O  7 26REFFLD(MASURN MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  8  2'Menu . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XBMNUC    R     A  B  8 26REFFLD(MBMNUC MNUHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  04                                  DSPATR(PR)
     A  02                                  DSPATR(UL)
     A                                  9  2'Menu Description . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XBMNUD    R     A  B  9 26REFFLD(MBMNUD MNUHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  06                                  DSPATR(PR)
     A  01                                  DSPATR(UL)
     A                                 10  2'Start menu . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XBSTRT    R     A  B 10 26REFFLD(MBSTRT MNUHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  01                                  DSPATR(UL)
     A                                 10 30'Y/N'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help  F12=Cancel  F14=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR005
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            ZZCOMP        30   O  1 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with User Menu Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  4  2'User . . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XAUSER    R     A  O  4 26REFFLD(MAUSER MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  4 41'Surname  . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XASURN    R     A  O  4 61REFFLD(MASURN MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  5  2'Menu Description . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XBMNUD    R     A  O  5 26REFFLD(MBMNUD MNUHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8  4'2=Revise'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 14'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 24'5=Display'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  8 35'6=Help'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 10  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 10'Option'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 10 18'Option Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A          R SCR005S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0003         1  0B 11  4
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  04                                  DSPATR(ND)
     A  02                                  DSPATR(PR)
     A            XCOPTC    R     A  O 11 10REFFLD(MCOPTC MNUOPT)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            XCOPTD    R     A  O 11 18REFFLD(MCOPTD MNUOPT)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A            HRC05          9  0H
     A            HCUSER    R        H      REFFLD(MCUSER MNUOPT)
     A                                      ALIAS(ALIAS00004)
     A            HCMNUC    R        H      REFFLD(MCMNUC MNUOPT)
     A                                      ALIAS(ALIAS00005)
     A            HCOPTC    R        H      REFFLD(MCOPTC MNUOPT)
     A                                      ALIAS(ALIAS00006)
     A            INSAV1        99   H
     A          R SCR005C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR005S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR005S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(9)
     A                                      SFLSIZ(9)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MNU010H)
     A          H                           HLPARA(1 26 1 55)
     A                                      HLPPNLGRP(SC0005ZZCOMP -
     A                                      MNU010H)
     A          H                           HLPARA(4 26 4 35)
     A                                      HLPPNLGRP(SC0005MAUSER -
     A                                      MNU010H)
     A          H                           HLPARA(4 61 4 80)
     A                                      HLPPNLGRP(SC0005MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(5 26 5 75)
     A                                      HLPPNLGRP(SC0005MBMNUD -
     A                                      MNU010H)
     A          H                           HLPARA(11 4 19 4)
     A                                      HLPPNLGRP(SC0005FL0003 -
     A                                      MNU010H)
     A          H                           HLPARA(11 10 19 14)
     A                                      HLPPNLGRP(SC0005MCOPTC -
     A                                      MNU010H)
     A          H                           HLPARA(11 18 19 67)
     A                                      HLPPNLGRP(SC0005MCOPTD -
     A                                      MNU010H)
     A          H                           HLPARA(21 18 21 22)
     A                                      HLPPNLGRP(SC0005PS0501 -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0005 -
     A                                      MNU010H)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0501         5   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'Enter  F1=Help  F3=Exit  F6=Create-
     A                                        F7=Bkwd  F8=Fwd  F12=Cancel  '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            RRN03          4S 0H      SFLRCDNBR
     A            XRN03          4S 0H
     A          R SCR006
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Delete')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MNU010H)
     A          H                           HLPARA(1 26 1 55)
     A                                      HLPPNLGRP(SC0006ZZCOMP -
     A                                      MNU010H)
     A          H                           HLPARA(6 28 6 37)
     A                                      HLPPNLGRP(SC0006MAUSER -
     A                                      MNU010H)
     A          H                           HLPARA(7 28 7 47)
     A                                      HLPPNLGRP(SC0006MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(8 28 8 77)
     A                                      HLPPNLGRP(SC0006MBMNUD -
     A                                      MNU010H)
     A          H                           HLPARA(9 28 9 32)
     A                                      HLPPNLGRP(SC0006MCOPTC -
     A                                      MNU010H)
     A          H                           HLPARA(10 28 10 77)
     A                                      HLPPNLGRP(SC0006MCOPTD -
     A                                      MNU010H)
     A          H                           HLPARA(11 28 11 37)
     A                                      HLPPNLGRP(SC0006MCPGMN -
     A                                      MNU010H)
     A          H                           HLPARA(12 28 12 37)
     A                                      HLPPNLGRP(SC0006MCSPGM -
     A                                      MNU010H)
     A          H                           HLPARA(13 28 13 77)
     A                                      HLPPNLGRP(SC0006MCPRM1 -
     A                                      MNU010H)
     A          H                           HLPARA(14 28 14 77)
     A                                      HLPPNLGRP(SC0006MCPRM2 -
     A                                      MNU010H)
     A          H                           HLPARA(15 28 15 77)
     A                                      HLPPNLGRP(SC0006MCPRM3 -
     A                                      MNU010H)
     A          H                           HLPARA(16 28 16 77)
     A                                      HLPPNLGRP(SC0006MCPRM4 -
     A                                      MNU010H)
     A          H                           HLPARA(17 28 17 28)
     A                                      HLPPNLGRP(SC0006MCPGMT -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0006 -
     A                                      MNU010H)
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            ZZCOMP        30   O  1 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with User Menu Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  4  2'Type choices, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6  2'User . . . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XAUSER    R     A  O  6 28REFFLD(MAUSER MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  7  2'Surname  . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XASURN    R     A  O  7 28REFFLD(MASURN MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  8  2'Menu Description . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XBMNUD    R     A  O  8 28REFFLD(MBMNUD MNUHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  9  2'Option . . . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XCOPTC    R     A  B  9 28REFFLD(MCOPTC MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  04                                  DSPATR(UL)
     A  03                                  DSPATR(PR)
     A                                 10  2'Option Description . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XCOPTD    R     A  B 10 28REFFLD(MCOPTD MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 11  2'Program Name . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XCPGMN    R     A  B 11 28REFFLD(MCPGMN MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 12  2'Secondary Program  . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XCSPGM    R     A  B 12 28REFFLD(MCSPGM MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 13  2'Parameters . . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XCPRM1    R     A  B 13 28REFFLD(MCPRM1 MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XCPRM2    R     A  B 14 28REFFLD(MCPRM2 MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XCPRM3    R     A  B 15 28REFFLD(MCPRM3 MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            XCPRM4    R     A  B 16 28REFFLD(MCPRM4 MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 17  2'Program Type . . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XCPGMT    R     A  B 17 28REFFLD(MCPGMT MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A  02                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A                                 23  2'F1=Help  F4=Prompt  F12=Cancel  F1-
     A                                      4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A          R SCR007                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            USER          10   O  1  2
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            ZZCOMP        30   O  1 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  1 73DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A            PGM           10   O  2  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  2 26'  Work with User Menu Details '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(BLU)
     A                                  4  2'User . . . . . . . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XAUSER    R     A  O  4 28REFFLD(MAUSER MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  4 41'Surname  . . . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XASURN    R     A  O  4 61REFFLD(MASURN MNUUSR)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  5  2'Menu Description . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XBMNUD    R     A  O  5 28REFFLD(MBMNUD MNUHED)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  6  2'Option Description . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            XCOPTD    R     A  O  6 28REFFLD(MCOPTD MNUOPT)
     A                                      DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                  8  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A                                      COLOR(BLU)
     A  04                                  DSPATR(ND)
     A                                  9  4'4=Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A  04                                  DSPATR(ND)
     A                                 11  2'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A  04                                  DSPATR(ND)
     A                                 11 10'Seq'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 11 17'Text'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A            LIN            3  0H
     A            POS            3  0H
     A          R SCR007S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            XDOPTC    R        H      REFFLD(MDOPTC MNUHLP)
     A            XDMNUC    R        H      REFFLD(MDMNUC MNUHLP)
     A            FL0004         1  0B 12  4
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  03                                  DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  02                                  DSPATR(PR)
     A            XDSEQN    R        B 12 10REFFLD(MDSEQN MNUHLP)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(UL)
     A  05                                  DSPATR(PR)
     A            XDTEXT    R     A  B 12 17REFFLD(MDTEXT MNUHLP)
     A                                      DLTEDT
     A                                      COLOR(GRN)
     A                                      CHECK(LC)
     A  08                                  DSPATR(UL)
     A  07                                  DSPATR(PR)
     A            HRC07          9  0H
     A            HDMNUC    R        H      REFFLD(MDMNUC MNUHLP)
     A                                      ALIAS(ALIAS00007)
     A            HDOPTC    R        H      REFFLD(MDOPTC MNUHLP)
     A                                      ALIAS(ALIAS00008)
     A            HDSEQN    R        H      REFFLD(MDSEQN MNUHLP)
     A                                      ALIAS(ALIAS00009)
     A            INSAV1        99   H
     A          R SCR007C1                  CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR007S1)
     A  64                                  SFLDSP
     A N64                                  ERASE(SCR007S1)
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(8)
     A                                      SFLSIZ(8)
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Allow Delt')
     A                                      CF18 INDTXT(18 'Add/Insert')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MNU010H)
     A          H                           HLPARA(1 26 1 55)
     A                                      HLPPNLGRP(SC0007ZZCOMP -
     A                                      MNU010H)
     A          H                           HLPARA(4 28 4 37)
     A                                      HLPPNLGRP(SC0007MAUSER -
     A                                      MNU010H)
     A          H                           HLPARA(4 61 4 80)
     A                                      HLPPNLGRP(SC0007MASURN -
     A                                      MNU010H)
     A          H                           HLPARA(5 28 5 77)
     A                                      HLPPNLGRP(SC0007MBMNUD -
     A                                      MNU010H)
     A          H                           HLPARA(6 28 6 77)
     A                                      HLPPNLGRP(SC0007MCOPTD -
     A                                      MNU010H)
     A          H                           HLPARA(12 4 19 4)
     A                                      HLPPNLGRP(SC0007FL0004 -
     A                                      MNU010H)
     A          H                           HLPARA(12 10 19 14)
     A                                      HLPPNLGRP(SC0007MDSEQN -
     A                                      MNU010H)
     A          H                           HLPARA(12 17 19 76)
     A                                      HLPPNLGRP(SC0007MDTEXT -
     A                                      MNU010H)
     A          H                           HLPARA(21 18 21 23)
     A                                      HLPPNLGRP(SC0007PS0701 -
     A                                      MNU010H)
     A          H                           HLPARA(23 67 23 76)
     A                                      HLPPNLGRP(SC0007F18 -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPPNLGRP(SC0007 -
     A                                      MNU010H)
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            PS0701         5  0B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F1=Help'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 23 11'F3=Exit'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 23 20'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 23 32'F7=Bkwd'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 23 41'F8=Fwd'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 23 49'F14=Allow Delete'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            F18           10   O 23 67
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A            RRN04          4S 0H      SFLRCDNBR
     A            XRN04          4S 0H
     A          R SCR008
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MNU010H)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MNU010H)
     A          H                           HLPARA(10 14 10 23)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MNU010H)
     A          H                           HLPARA(10 26 10 45)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MNU010H)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MNU010H)
     A          H                           HLPARA(11 14 11 23)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MNU010H)
     A          H                           HLPARA(11 26 11 45)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MNU010H)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MNU010H)
     A          H                           HLPARA(12 14 12 23)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MNU010H)
     A          H                           HLPARA(12 26 12 45)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MNU010H)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MNU010H)
     A          H                           HLPARA(13 14 13 23)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MNU010H)
     A          H                           HLPARA(13 26 13 45)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MNU010H)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0008T01 -
     A                                      MNU010H)
     A          H                           HLPARA(14 14 14 23)
     A                                      HLPPNLGRP(SC0008T02 -
     A                                      MNU010H)
     A          H                           HLPARA(14 26 14 45)
     A                                      HLPPNLGRP(SC0008T03 -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 17 49)
     A                                      HLPPNLGRP(SC0008 -
     A                                      MNU010H)
     A                                  3  3'                                  -
     A                                                   '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'    '
     A                                  4 10'List of Users                 '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 41'       '
     A                                  4 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                               '
     A                                  5 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'               '
     A                                  6 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                               '
     A                                  7 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                                  -
     A                                               '
     A                                  8 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'User'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 19'      '
     A                                  9 26'Surname'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 34'              '
     A                                  9 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T01001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T02001        10   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03001        20   O 10 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 47' '
     A                                 10 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T01002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T02002        10   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03002        20   O 11 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 47' '
     A                                 11 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T01003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T02003        10   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03003        20   O 12 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 47' '
     A                                 12 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T01004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T02004        10   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03004        20   O 13 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 47' '
     A                                 13 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T01005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T02005        10   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T03005        20   O 14 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 47' '
     A                                 14 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                               '
     A                                 15 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 16 17'                               '
     A                                 16 49' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3'                                  -
     A                                                   '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR009
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MNU010H)
     A          H                           HLPARA(10 8 10 8)
     A                                      HLPPNLGRP(SC0010T04 -
     A                                      MNU010H)
     A          H                           HLPARA(10 14 10 23)
     A                                      HLPPNLGRP(SC0010T05 -
     A                                      MNU010H)
     A          H                           HLPARA(10 26 10 35)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MNU010H)
     A          H                           HLPARA(10 38 10 67)
     A                                      HLPPNLGRP(SC0010T06 -
     A                                      MNU010H)
     A          H                           HLPARA(11 8 11 8)
     A                                      HLPPNLGRP(SC0010T04 -
     A                                      MNU010H)
     A          H                           HLPARA(11 14 11 23)
     A                                      HLPPNLGRP(SC0010T05 -
     A                                      MNU010H)
     A          H                           HLPARA(11 26 11 35)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MNU010H)
     A          H                           HLPARA(11 38 11 67)
     A                                      HLPPNLGRP(SC0010T06 -
     A                                      MNU010H)
     A          H                           HLPARA(12 8 12 8)
     A                                      HLPPNLGRP(SC0010T04 -
     A                                      MNU010H)
     A          H                           HLPARA(12 14 12 23)
     A                                      HLPPNLGRP(SC0010T05 -
     A                                      MNU010H)
     A          H                           HLPARA(12 26 12 35)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MNU010H)
     A          H                           HLPARA(12 38 12 67)
     A                                      HLPPNLGRP(SC0010T06 -
     A                                      MNU010H)
     A          H                           HLPARA(13 8 13 8)
     A                                      HLPPNLGRP(SC0010T04 -
     A                                      MNU010H)
     A          H                           HLPARA(13 14 13 23)
     A                                      HLPPNLGRP(SC0010T05 -
     A                                      MNU010H)
     A          H                           HLPARA(13 26 13 35)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MNU010H)
     A          H                           HLPARA(13 38 13 67)
     A                                      HLPPNLGRP(SC0010T06 -
     A                                      MNU010H)
     A          H                           HLPARA(14 8 14 8)
     A                                      HLPPNLGRP(SC0010T04 -
     A                                      MNU010H)
     A          H                           HLPARA(14 14 14 23)
     A                                      HLPPNLGRP(SC0010T05 -
     A                                      MNU010H)
     A          H                           HLPARA(14 26 14 35)
     A                                      HLPPNLGRP(SC0010T07 -
     A                                      MNU010H)
     A          H                           HLPARA(14 38 14 67)
     A                                      HLPPNLGRP(SC0010T06 -
     A                                      MNU010H)
     A          H                           HLPARA(16 15 16 24)
     A                                      HLPPNLGRP(SC0010FL0006 -
     A                                      MNU010H)
     A          H                           HLPARA(16 26 16 35)
     A                                      HLPPNLGRP(SC0010FL0007 -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(3 3 19 71)
     A                                      HLPPNLGRP(SC0010 -
     A                                      MNU010H)
     A                                  3  3'                                  -
     A                                                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4  5'              '
     A                                  4 20'List of Programs              '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  4 51'                   '
     A                                  4 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5  5'                                  -
     A                                                                     '
     A                                  5 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6  6'Type options, press Enter.'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  6 33'                                  -
     A                                         '
     A                                  6 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  5'  '
     A                                  7  8'1=Select'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                  7 17'                                  -
     A                                                         '
     A                                  7 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  5'                    '
     A                                  8 26'Secondary'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  8 36'                                  '
     A                                  8 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  6'Action'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 14'Program'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 22'   '
     A                                  9 26'Program'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 34'   '
     A                                  9 38'Description'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  9 50'                    '
     A                                  9 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10  5'  '
     A            T04001         1  0B 10  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(ND)
     A  01                                  DSPATR(PR)
     A                                 10 10'   '
     A            T05001        10   O 10 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T07001        10   O 10 26
     A                                      OVRDTA
     A                                      OVRATR
     A            T06001        30   O 10 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 10 69' '
     A                                 10 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11  5'  '
     A            T04002         1  0B 11  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  04                                  DSPATR(ND)
     A  03                                  DSPATR(PR)
     A                                 11 10'   '
     A            T05002        10   O 11 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T07002        10   O 11 26
     A                                      OVRDTA
     A                                      OVRATR
     A            T06002        30   O 11 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 11 69' '
     A                                 11 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12  5'  '
     A            T04003         1  0B 12  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(ND)
     A  05                                  DSPATR(PR)
     A                                 12 10'   '
     A            T05003        10   O 12 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T07003        10   O 12 26
     A                                      OVRDTA
     A                                      OVRATR
     A            T06003        30   O 12 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 12 69' '
     A                                 12 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13  5'  '
     A            T04004         1  0B 13  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(ND)
     A  07                                  DSPATR(PR)
     A                                 13 10'   '
     A            T05004        10   O 13 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T07004        10   O 13 26
     A                                      OVRDTA
     A                                      OVRATR
     A            T06004        30   O 13 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 13 69' '
     A                                 13 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14  5'  '
     A            T04005         1  0B 14  8
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(ND)
     A  09                                  DSPATR(PR)
     A                                 14 10'   '
     A            T05005        10   O 14 14
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            T07005        10   O 14 26
     A                                      OVRDTA
     A                                      OVRATR
     A            T06005        30   O 14 38
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 69' '
     A                                 14 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15  5'                                  -
     A                                                                     '
     A                                 15 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  6'Position'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0006        10   B 16 15
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A            FL0007        10   B 16 26
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 16 37'                                 '
     A                                 16 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'                                  -
     A                                                                     '
     A                                 17 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  6'F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 18 17'                                  -
     A                                                         '
     A                                 18 71' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                                  -
     A                                                                         '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R SCR010                    CSRLOC(LIN POS)
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF04 INDTXT(04 'Prompt')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      HLPCLR
     A          H                           HLPARA(*NONE)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MNU010H)
     A          H                           HLPARA(14 58 14 67)
     A                                      HLPPNLGRP(SC0009FL0005 -
     A                                      MNU010H)
     A          H                           HLPARA(16 58 16 58)
     A                                      HLPPNLGRP(SC0009CPYMNU -
     A                                      MNU010H)
     A          H                           HLPARA(17 58 17 58)
     A                                      HLPPNLGRP(SC0009CPYOPT -
     A                                      MNU010H)
     A          H                           HLPARA(18 58 18 67)
     A                                      HLPPNLGRP(SC0009TOUSER -
     A                                      MNU010H)
     A                                      HLPBDY
     A          H                           HLPARA(11 35 21 74)
     A                                      HLPPNLGRP(SC0009 -
     A                                      MNU010H)
     A                                 11 35'                                  -
     A                                            '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 38'Copy Users                    '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                 12 69'    '
     A                                 12 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13 37'                                  -
     A                                        '
     A                                 13 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14 38'Copy From User . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            FL0005        10   O 14 58
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A                                 14 69'    '
     A                                 14 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15 37'                                  -
     A                                        '
     A                                 15 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16 38'Copy Menus . . . :'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            CPYMNU         1   O 16 58
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(GRN)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                 16 60'             '
     A                                 16 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17 38'Copy Options . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            CPYOPT         1   B 17 58
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                 17 60'             '
     A                                 17 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18 38'Copy To User . . .'
     A                                      OVRATR
     A                                      COLOR(GRN)
     A            TOUSER        10   B 18 58
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(UL)
     A                                      COLOR(GRN)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A                                 18 69'    '
     A                                 18 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 37'                                  -
     A                                        '
     A                                 19 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 35' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20 38'F1=Help  F4=Prompt  F12=Cancel'
     A                                      OVRATR
     A                                      COLOR(BLU)
     A                                 20 69'    '
     A                                 20 74' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 21 35'                                  -
     A                                            '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            LIN            3  0H
     A            POS            3  0H
     A*********************************************************************
     A          R PSSR0001                  CLRL(*NO) OVERLAY
     A                                  1 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  2 15'PSSR0001'
     A                                  2 24'       Execution Error Handler    -
     A                                                ' DSPATR(HI)
     A                                  2 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  3 15'                                  -
     A                                                         '
     A                                  3 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  4 15'Job . . . . :'
     A            WSID          10A  O  4 29COLOR(WHT)
     A                                  4 40'  Program  . . :'
     A            PGM           10A  O  4 57COLOR(WHT)
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 15'User  . . . :'
     A            USER          10A  O  5 29COLOR(WHT)
     A                                  5 40'  Library  . . :'
     A            ULIB          10A  O  5 57COLOR(WHT)
     A                                  5 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  6 15'Number  . . :'
     A            UJOBN          6S 0O  6 29COLOR(WHT)
     A                                  6 36'      Compiled . . :'
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)  COLOR(WHT)
     A                                  6 66'  '
     A                                  6 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  7 15'Routine . . :'
     A            UROUTN         8A  O  7 29COLOR(WHT)
     A                                  7 38'                  '
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')  COLOR(WHT)
     A                                  7 66'  '
     A                                  7 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  8 15'Status Code :'
     A            USTAT4         4A  O  8 29COLOR(WHT)
     A                                  8 34'        Source Line. :'
     A            USRCLN         8A  O  8 57COLOR(WHT)
     A                                  8 66'  '
     A                                  8 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 13' ' DSPATR(RI) COLOR(TRQ)
     A                                  9 15'Message ID  :'
     A            MSGID          7A  O  9 29COLOR(WHT)
     A                                  9 37'     File Name  . :'
     A            UFILE          8A  O  9 57COLOR(WHT)
     A                                  9 66'  '
     A                                  9 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 10 16'                                  -
     A                                                       '
     A                                 10 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 11 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)
     A                                 11 67' '
     A                                 11 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 12 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)
     A                                 12 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 13 13' ' DSPATR(RI) COLOR(TRQ)
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)
     A                                 13 46'                      '
     A                                 13 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 14 15'                                  -
     A                                                         '
     A                                 14 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 15 15'Select one of the following option-
     A                                      s. Then Enter.     '
     A                                 15 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 16 15'                                  -
     A                                                         '
     A                                 16 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 17 13' ' DSPATR(RI) COLOR(TRQ)
     A            UEROPT         1A  B 17 15DSPATR(UL) DSPATR(HI)
     A                                      VALUES('1' '2' '3')
     A                                 17 17' 1. Continue at the beginning of p-
     A                                      rogram           '
     A                                 17 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 18 15'   2. Cancel the processing of the-
     A                                       program           '
     A                                 18 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 19 15'   3. Return control to the system-
     A                                       error handler     '
     A                                 19 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 20 15'                                  -
     A                                                         '
     A                                 20 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 13' ' DSPATR(RI) COLOR(TRQ)
     A                                 21 15'Enter                             -
     A                                                         '  DSPATR(HI)
     A                                 21 69' ' DSPATR(RI) COLOR(TRQ)
     A                                 22 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A*********************************************************************
     A          R MSGRCD                    TEXT('MSG SFL RECORD')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGM                       SFLPGMQ
     A*********************************************************************
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ
     A N98                                  SFLEND
     A            PGM                       SFLPGMQ
     A*
